{"paperId": "ebd6c29afd7ac7d839eea836ddcac78be5bddad7", "title": "SENTIMENT ANALYSIS OF CUSTOMER FEEDBACK IN THE BANKING SECTOR: A COMPARATIVE STUDY OF MACHINE LEARNING MODELS", "abstract": "This study investigates the application of sentiment analysis to customer feedback in the banking sector, utilizing natural language processing (NLP) techniques and machine learning models to classify customer sentiments into positive, neutral, and negative categories. Feedback was sourced from online platforms, including bank websites, social media, and third-party review sites. Data preprocessing steps, such as tokenization, stemming, and feature extraction using TF-IDF, were employed to prepare the text for analysis. Various machine learning algorithms, including Logistic Regression, Random Forest, Support Vector Machine (SVM), Long Short-Term Memory (LSTM), and Naïve Bayes, were implemented and evaluated using metrics such as accuracy, precision, recall, and F1-score. The results show that LSTM outperformed all models with a 91% accuracy, followed closely by SVM at 89%. These findings demonstrate the potential of advanced machine learning techniques in accurately classifying sentiments and provide valuable insights into customer satisfaction and areas for improvement within the banking sector. Future work aims to further optimize models for better classification of neutral feedback and explore more advanced deep learning models, such as BERT.", "year": 2024, "citationCount": 4, "openAccessPdf": {"url": "https://www.theamericanjournals.com/index.php/tajet/article/download/5503/5116/6360", "status": "GOLD", "license": null, "disclaimer": "Notice: This abstract is extracted from the open access paper or abstract available at https://api.unpaywall.org/v2/10.37547/tajet/volume06issue10-07?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.37547/tajet/volume06issue10-07, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."}, "fieldsOfStudy": null, "authors": [{"authorId": "70672602", "name": "Rowsan Jahan Bhuiyan"}, {"authorId": "2320570285", "name": "Salma Akter"}, {"authorId": "2306654591", "name": "Aftab Uddin"}, {"authorId": "2319785714", "name": "Md Shujan Shak"}, {"authorId": "2325216560", "name": "Md Rasibul Islam"}, {"authorId": "2325362240", "name": "S. M. S. I. Rishad"}, {"authorId": "2325285367", "name": "Farzana Sultana"}, {"authorId": "2325365621", "name": "Md. Hasan-Or-Rashid"}]}
