{"id": "math/9201266v1", "title": "Some basic information on information-based complexity theory", "abstract": "Numerical analysts might be expected to pay close attention to a branch of complexity theory called information-based complexity theory (IBCT), which produces an abundance of impressive results about the quest for approximate solutions to mathematical problems. Why then do most numerical analysts turn a cold shoulder to IBCT? Close analysis of two representative papers reveals a mixture of nice new observations, error bounds repackaged in new language, misdirected examples, and misleading theorems.   Some elements in the framework of IBCT, erected to support a rigorous yet flexible theory, make it difficult to judge whether a model is off-target or reasonably realistic. For instance, a sharp distinction is made between information and algorithms restricted to this information. Yet the information itself usually comes from an algorithm, so the distinction clouds the issues and can lead to true but misleading inferences. Another troublesome aspect of IBCT is a free parameter $F$, the class of admissible problem instances. By overlooking $F$'s membership fee, the theory sometimes distorts the economics of problem solving in a way reminiscent of agricultural subsidies.   The current theory's surprising results pertain only to unnatural situations, and its genuinely new insights might serve us better if expressed in the conventional modes of error analysis and approximation theory.", "authors": "Beresford N. Parlett", "num_authors": 1, "published_date": "1992-01-01", "days_since_pub": 12169, "updated_date": "1992-01-01", "days_since_update": 12169, "primary_category": "math.NA", "categories": "math.NA", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9201266v1", "title_word_count": 8, "title_word_diversity": 0.875, "title_avg_word_len": 6.75, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 198, "abstract_word_diversity": 0.6868686868686869, "abstract_avg_word_len": 5.797979797979798, "abstract_avg_sent_len": 26.0, "abstract_readability": 22.85, "abstract_sentiment": "Negative"}
{"id": "math/9201269v1", "title": "Perspectives on information-based complexity", "abstract": "The authors discuss information-based complexity theory, which is a model of finite-precision computations with real numbers, and its applications to numerical analysis.", "authors": "J. F. Traub, Henryk Woźniakowski", "num_authors": 2, "published_date": "1992-01-01", "days_since_pub": 12169, "updated_date": "1992-01-01", "days_since_update": 12169, "primary_category": "math.NA", "categories": "math.NA", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9201269v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 8.0, "title_avg_sent_len": 4.0, "title_sentiment": "Neutral", "abstract_word_count": 23, "abstract_word_diversity": 1.0, "abstract_avg_word_len": 6.173913043478261, "abstract_avg_sent_len": 25.0, "abstract_readability": -1.63, "abstract_sentiment": "Neutral"}
{"id": "math/9604245v1", "title": "Mathematical pressure volume models of the cerebrospinal fluid", "abstract": "Numerous mathematical models have emerged in the medical literature over the past two decades attempting to characterize the pressure and volume dynamics the central nervous system compartment. These models have been used to study he behavior of this compartment under such pathological clinical conditions s hydrocephalus, head injury and brain edema. The number of different pproaches has led to considerable confusion regarding the validity, accuracy or appropriateness of the various models. In this paper we review the mathematical basis for these models in a mplified fashion, leaving the mathematical details to appendices. We show at most previous models are in fact particular cases of a single basic differential equation describing the evolution in time of the cerebrospinal fluid pressure (CFS). Central to this approach is the hypothsis that the rate change of CSF volume with respect to pressure is a measure of the compliance of the brain tissue which as a consequence leads to particular models epending on the form of the compliance funtion. All such models in fact give essentially no information on the behavior of the brain itself. More recent models (solved numerically using the Finite Element Method) have begun to address this issue but have difficulties due to the lack of information about the mechanical properties of the brain. Suggestions are made on how development of models which account for these chanical properties might be developed.", "authors": "James M. Drake, Sivabal Sivaloganathan, Guiseppe Tenti", "num_authors": 3, "published_date": "1996-04-01", "days_since_pub": 10617, "updated_date": "1996-04-01", "days_since_update": 10617, "primary_category": "math.NA", "categories": "math.NA", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9604245v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 6.875, "title_avg_sent_len": 8.0, "title_sentiment": "Cautious", "abstract_word_count": 224, "abstract_word_diversity": 0.6071428571428571, "abstract_avg_word_len": 5.446428571428571, "abstract_avg_sent_len": 27.22222222222222, "abstract_readability": 28.77, "abstract_sentiment": "Negative"}
{"id": "math/9805088v1", "title": "Good rotations", "abstract": "Numerical integrations in celestial mechanics often involve the repeated computation of a rotation with a constant angle. A direct evaluation of these rotations yields a linear drift of the distance to the origin. This is due to roundoff in the representation of the sine s and cosine c of the angle theta. In a computer, one generally gets c^2 + s^2 <> 1, resulting in a mapping that is slightly contracting or expanding. In the present paper we present a method to find pairs of representable real numbers s and c such that c^2 + s^2 is as close to 1 as possible. We show that this results in a drastic decrease of the systematic error, making it negligible compared to the random error of other operations. We also verify that this approach gives good results in a realistic celestial mechanics integration.", "authors": "M. Henon, J-M. Petit", "num_authors": 2, "published_date": "1998-05-20", "days_since_pub": 9838, "updated_date": "1998-05-20", "days_since_update": 9838, "primary_category": "math.NA", "categories": "math.NA, 65G05 (Primary) 70F15 (Secondary)", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9805088v1", "title_word_count": 2, "title_word_diversity": 1.0, "title_avg_word_len": 6.5, "title_avg_sent_len": 2.0, "title_sentiment": "Positive", "abstract_word_count": 120, "abstract_word_diversity": 0.65, "abstract_avg_word_len": 5.233333333333333, "abstract_avg_sent_len": 21.857142857142858, "abstract_readability": 42.82, "abstract_sentiment": "Cautious"}
{"id": "math/9806061v1", "title": "Numerical Analysis of Two-Phase Flow in Gas-Dynamic Filter", "abstract": "This paper presents numerical and analytical investigation of gas flow in gas-dynamic filter - a device for cleaning gas from solid particles with counter flow of large water particles in order to prevent their release to the atmosphere.   Ideal and viscous gas flows are considered. It is assumed, that gas flow is stationary, incompressible and plane, thus in the case of ideal gas stream function is considered, and in its terms boundary conditions are formulated. To determine stream function Dirichlet problem for Laplace equation is solved. Numerical solution is obtained using five-point scheme, and analytical - by conformal mapping. It is demonstrated that numerical solution fits very accurately with the analytical one. Then in the already known gas flow field trajectories of particles of different size are calculated in Lagrange formulation, taking into account dust particles as well as filtering water drops.   Trajectories of particles of several different sizes under different modes of filter operation were analysed. The adequacy of real and computed flow is demonstrated.   Computation of the flow is done using full Navier-Stokes equations. The possibility of formation of rotation and separation zones in the flow is demonstrated.", "authors": "Ulyan G. Pirumov", "num_authors": 1, "published_date": "1998-06-11", "days_since_pub": 9816, "updated_date": "1998-06-11", "days_since_update": 9816, "primary_category": "math.NA", "categories": "math.NA, 65C20", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9806061v1", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 4.9, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 190, "abstract_word_diversity": 0.5789473684210527, "abstract_avg_word_len": 5.447368421052632, "abstract_avg_sent_len": 18.818181818181817, "abstract_readability": 28.74, "abstract_sentiment": "Optimistic"}
{"id": "math/9811125v1", "title": "Approximate Models of Dynamic Thermoviscoelasticity Describing Shape-Memory-Alloy Phase Transitions", "abstract": "We consider problems of dynamic viscoelasticity taking into account the coupling of elastic and thermal fields. Efficient approximate models are developed and computational results on thermomechanical behaviour of shape-memory-alloy structures are presented.", "authors": "R. V. N. Melnik, A. J. Roberts", "num_authors": 2, "published_date": "1998-11-21", "days_since_pub": 9653, "updated_date": "1998-11-21", "days_since_update": 9653, "primary_category": "math.NA", "categories": "math.NA, 65C20, 73F15", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9811125v1", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 8.090909090909092, "title_avg_sent_len": 9.0, "title_sentiment": "Positive", "abstract_word_count": 34, "abstract_word_diversity": 0.8823529411764706, "abstract_avg_word_len": 6.5588235294117645, "abstract_avg_sent_len": 17.0, "abstract_readability": -3.99, "abstract_sentiment": "Positive"}
{"id": "math/9901055v1", "title": "Numerical Calculations Using Maple: Why & How?", "abstract": "The possibility of interaction between Maple and numeric compiled languages in performing extensive numeric calculations is exemplified by the Ndynamics package, a tool for studying the (chaotic) behavior of dynamical systems. Programming hints concerning the construction of Ndynamics are presented. The system command, together with the application of the black-box concept, is used to implement a powerful cooperation between Maple code and some other numeric language code.", "authors": "E. V. Correa Silva, L. G. S. Duarte, L. A. C. P. da Mota, J. E. F. Skea", "num_authors": 4, "published_date": "1999-01-13", "days_since_pub": 9600, "updated_date": "1999-01-13", "days_since_update": 9600, "primary_category": "math.NA", "categories": "math.NA", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9901055v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 6.166666666666667, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 66, "abstract_word_diversity": 0.7424242424242424, "abstract_avg_word_len": 6.0606060606060606, "abstract_avg_sent_len": 25.0, "abstract_readability": 6.54, "abstract_sentiment": "Optimistic"}
{"id": "math/9901121v1", "title": "A multi-level algorithm for the solution of moment problems", "abstract": "We study numerical methods for the solution of general linear moment problems, where the solution belongs to a family of nested subspaces of a Hilbert space. Multi-level algorithms, based on the conjugate gradient method and the Landweber--Richardson method are proposed that determine the \"optimal\" reconstruction level a posteriori from quantities that arise during the numerical calculations. As an important example we discuss the reconstruction of band-limited signals from irregularly spaced noisy samples, when the actual bandwidth of the signal is not available. Numerical examples show the usefulness of the proposed algorithms.", "authors": "Otmar Scherzer, Thomas Strohmer", "num_authors": 2, "published_date": "1999-01-26", "days_since_pub": 9587, "updated_date": "1999-01-26", "days_since_update": 9587, "primary_category": "math.NA", "categories": "math.NA, 44A60, 65J10, 65J20, 62D05, 42A15", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9901121v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 5.444444444444445, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 91, "abstract_word_diversity": 0.7142857142857143, "abstract_avg_word_len": 5.835164835164835, "abstract_avg_sent_len": 25.5, "abstract_readability": 14.49, "abstract_sentiment": "Positive"}
{"id": "math/9901122v1", "title": "Rates of convergence for the approximation of dual shift-invariant systems in $l_2(Z)$", "abstract": "A shift-invariant system is a collection of functions $\\{g_{m,n}\\}$ of the form $g_{m,n}(k) = g_m(k-an)$. Such systems play an important role in time-frequency analysis and digital signal processing. A principal problem is to find a dual system $\\gamma_{m,n}(k) = \\gamma_m(k-an)$ such that each function $f$ can be written as $f = \\sum < f, \\gamma_{m,n} > g_{m,n}$. The mathematical theory usually addresses this problem in infinite dimensions (typically in $L_2(R)$ or $l_2(Z)$), whereas numerical methods have to operate with a finite-dimensional model. Exploiting the link between the frame operator and Laurent operators with matrix-valued symbol, we apply the finite section method to show that the dual functions obtained by solving a finite-dimensional problem converge to the dual functions of the original infinite-dimensional problem in $l_2(Z)$. For compactly supported $g_{m,n}$ (FIR filter banks) we prove an exponential rate of convergence and derive explicit expressions for the involved constants. Further we investigate under which conditions one can replace the discrete model of the finite section method by the periodic discrete model, which is used in many numerical procedures. Again we provide explicit estimates for the speed of convergence. Some remarks on tight frames complete the paper.", "authors": "Thomas Strohmer", "num_authors": 1, "published_date": "1999-01-26", "days_since_pub": 9587, "updated_date": "1999-01-26", "days_since_update": 9587, "primary_category": "math.NA", "categories": "math.NA, 41A25, 42C15, 47B35, 15A99", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9901122v1", "title_word_count": 12, "title_word_diversity": 0.9166666666666666, "title_avg_word_len": 5.5, "title_avg_sent_len": 17.0, "title_sentiment": "Neutral", "abstract_word_count": 177, "abstract_word_diversity": 0.632768361581921, "abstract_avg_word_len": 5.4576271186440675, "abstract_avg_sent_len": 31.555555555555557, "abstract_readability": 33.24, "abstract_sentiment": "Cautious"}
{"id": "math/9901123v2", "title": "A Levinson-Galerkin algorithm for regularized trigonometric approximation", "abstract": "Trigonometric polynomials are widely used for the approximation of a smooth function $f$ from a set of nonuniformly spaced samples $\\{f(x_j)\\}_{j=0}^{N-1}$. If the samples are perturbed by noise, controlling the smoothness of the trigonometric approximation becomes an essential issue to avoid overfitting and underfitting of the data. Using the polynomial degree as regularization parameter we derive a multi-level algorithm that iteratively adapts to the least squares solution of optimal smoothness. The proposed algorithm computes the solution in at most $\\cal{O}(NM + M^2)$ operations ($M$ being the polynomial degree of the approximation) by solving a family of nested Toeplitz systems. It is shown how the presented method can be extended to multivariate trigonometric approximation. We demonstrate the performance of the algorithm by applying it in echocardiography to the recovery of the boundary of the Left Ventricle.", "authors": "Thomas Strohmer", "num_authors": 1, "published_date": "1999-01-26", "days_since_pub": 9587, "updated_date": "2000-10-25", "days_since_update": 8949, "primary_category": "math.NA", "categories": "math.NA, 65T10, 42A10, 65D10, 65F10", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9901123v2", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 9.285714285714286, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 128, "abstract_word_diversity": 0.640625, "abstract_avg_word_len": 5.765625, "abstract_avg_sent_len": 28.833333333333332, "abstract_readability": 23.46, "abstract_sentiment": "Positive"}
{"id": "math/9204217v1", "title": "On the Selberg class of Dirichlet series: small degrees", "abstract": "In the study of Dirichlet series with arithmetic significance there has appeared (through the study of known examples) certain expectations, namely (i) if a functional equation and Euler product exists, then it is likely that a type of Riemann hypothesis will hold, (ii) that if in addition the function has a simple pole at the point s=1, then it must be a product of the Riemann zeta-function and another Dirichlet series with similar properties, and (iii) that a type of converse theorem holds, namely that all such Dirichlet series can be obtained by considering Mellin transforms of automorphic forms associated with arithmetic groups.", "authors": "J. Brian Conrey, Amit Ghosh", "num_authors": 2, "published_date": "1992-04-01", "days_since_pub": 12078, "updated_date": "1992-04-01", "days_since_update": 12078, "primary_category": "math.NT", "categories": "math.NT", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9204217v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 5.111111111111111, "title_avg_sent_len": 10.0, "title_sentiment": "Neutral", "abstract_word_count": 97, "abstract_word_diversity": 0.6597938144329897, "abstract_avg_word_len": 5.288659793814433, "abstract_avg_sent_len": 118.0, "abstract_readability": -41.54, "abstract_sentiment": "Positive"}
{"id": "math/9204234v1", "title": "Algorithms in algebraic number theory", "abstract": "In this paper we discuss the basic problems of algorithmic algebraic number theory. The emphasis is on aspects that are of interest from a purely mathematical point of view, and practical issues are largely disregarded. We describe what has been done and, more importantly, what remains to be done in the area. We hope to show that the study of algorithms not only increases our understanding of algebraic number fields but also stimulates our curiosity about them. The discussion is concentrated of three topics: the determination of Galois groups, the determination of the ring of integers of an algebraic number field, and the computation of the group of units and the class group of that ring of integers.", "authors": "Hendrik W. Lenstra Jr.", "num_authors": 1, "published_date": "1992-04-01", "days_since_pub": 12078, "updated_date": "1992-04-01", "days_since_update": 12078, "primary_category": "math.NT", "categories": "math.NT", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9204234v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 6.6, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 117, "abstract_word_diversity": 0.6153846153846154, "abstract_avg_word_len": 4.957264957264957, "abstract_avg_sent_len": 25.8, "abstract_readability": 39.06, "abstract_sentiment": "Optimistic"}
{"id": "math/9210214v1", "title": "Additive functions on shifted primes", "abstract": "Best possible bounds are obtained for the concentration function of an additive arithmetic function on sequences of shifted primes.", "authors": "P. D. T. A. Elliott", "num_authors": 1, "published_date": "1992-10-01", "days_since_pub": 11895, "updated_date": "1992-10-01", "days_since_update": 11895, "primary_category": "math.NT", "categories": "math.NT", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9210214v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 6.4, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 19, "abstract_word_diversity": 0.8947368421052632, "abstract_avg_word_len": 5.894736842105263, "abstract_avg_sent_len": 20.0, "abstract_readability": 35.27, "abstract_sentiment": "Optimistic"}
{"id": "math/9407219v1", "title": "Selberg's Conjectures and Artin $L$-functions", "abstract": "The author reviews results and conjectures of Selberg on a class of Dirichlet series functions which share properties with the Riemann zeta function, and he relates this work to the theory of Artin L-functions.", "authors": "M. Ram Murty", "num_authors": 1, "published_date": "1994-07-01", "days_since_pub": 11257, "updated_date": "1994-07-01", "days_since_update": 11257, "primary_category": "math.NT", "categories": "math.NT", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9407219v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 33, "abstract_word_diversity": 0.8181818181818182, "abstract_avg_word_len": 5.212121212121212, "abstract_avg_sent_len": 36.0, "abstract_readability": 45.43, "abstract_sentiment": "Positive"}
{"id": "math/9407220v1", "title": "A report on Wiles' Cambridge lectures", "abstract": "In lectures at the Newton Institute in June of 1993, Andrew Wiles announced a proof of a large part of the Taniyama-Shimura Conjecture and, as a consequence, Fermat's Last Theorem. This report for nonexperts discusses the mathematics involved in Wiles' lectures, including the necessary background and the mathematical history.", "authors": "Karl Rubin, Alice Silverberg", "num_authors": 2, "published_date": "1994-07-01", "days_since_pub": 11257, "updated_date": "1994-07-01", "days_since_update": 11257, "primary_category": "math.NT", "categories": "math.NT", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9407220v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 6.0, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 46, "abstract_word_diversity": 0.7608695652173914, "abstract_avg_word_len": 5.695652173913044, "abstract_avg_sent_len": 28.5, "abstract_readability": 38.15, "abstract_sentiment": "Neutral"}
{"id": "math/9410212v1", "title": "Mean values of Dedekind sums", "abstract": "For a positive integer k and an arbitrary integer h, the Dedekind sum s(h,k) was first studied by Dedekind because of the prominent role it plays in the transformation theory of the Dedekind eta-function, which is a modular form of weight 1/2 for the full modular group SL_2(Z). There is an extensive literature about the Dedekind sums. Rademacher [8] has written an introductory book on the subject.", "authors": "J. Brian Conrey, Eric Fransen, Robert Klein, Clayton Scott", "num_authors": 4, "published_date": "1994-10-01", "days_since_pub": 11165, "updated_date": "1994-10-01", "days_since_update": 11165, "primary_category": "math.NT", "categories": "math.NT", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9410212v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 4.8, "title_avg_sent_len": 5.0, "title_sentiment": "Positive", "abstract_word_count": 60, "abstract_word_diversity": 0.7166666666666667, "abstract_avg_word_len": 5.083333333333333, "abstract_avg_sent_len": 27.333333333333332, "abstract_readability": 48.84, "abstract_sentiment": "Optimistic"}
{"id": "math/9410216v1", "title": "Zeta functions do not determine class numbers", "abstract": "We show that two number fields with the same zeta function, and even with isomorphic adele rings, do not necessarily have the same class number.", "authors": "Bart de Smit, Robert Perlis", "num_authors": 2, "published_date": "1994-10-01", "days_since_pub": 11165, "updated_date": "1994-10-01", "days_since_update": 11165, "primary_category": "math.NT", "categories": "math.NT", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9410216v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 5.571428571428571, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 25, "abstract_word_diversity": 0.84, "abstract_avg_word_len": 4.68, "abstract_avg_sent_len": 28.0, "abstract_readability": 54.56, "abstract_sentiment": "Neutral"}
{"id": "math/9411212v1", "title": "The Dimension of the Space of Cusp Forms of Weight One", "abstract": "A new upper bound is given for the dimension of the space of holomorphic cusp forms of weight one and prime level $q$: $$ \\hbox{dim}\\, S_1(q) << q^{11/12} \\log^4{q} $$ with an absolute implied constant.", "authors": "William Duke", "num_authors": 1, "published_date": "1994-11-09", "days_since_pub": 11126, "updated_date": "1994-11-09", "days_since_update": 11126, "primary_category": "math.NT", "categories": "math.NT", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9411212v1", "title_word_count": 11, "title_word_diversity": 0.7272727272727273, "title_avg_word_len": 4.0, "title_avg_sent_len": 11.0, "title_sentiment": "Neutral", "abstract_word_count": 29, "abstract_word_diversity": 0.896551724137931, "abstract_avg_word_len": 4.482758620689655, "abstract_avg_sent_len": 56.0, "abstract_readability": 64.38, "abstract_sentiment": "Neutral"}
{"id": "math/9411213v1", "title": "On Calculations of Zeros of Various L-functions", "abstract": "As we have shown several years ago [Y2], zeros of $L(s, \\Delta )$ and $L^(2)(s, \\Delta )$ can be calculated quite efficiently by a certain experimental method. Here $\\Delta$ denotes the cusp form of weight 12 with respect to SL$(2, Z)$ and $L(s, \\Delta )$ (resp. $L^(2)(s, \\Delta )$) denotes the standard (resp. symmetric square) $L$-function attached to $\\Delta$. The purpose of this paper is to show that this method can be applied to a wide class of $L$-functions so that we can obtain precise numerical values of their zeros.", "authors": "Hiroyuki Yoshida", "num_authors": 1, "published_date": "1994-11-09", "days_since_pub": 11126, "updated_date": "1994-11-09", "days_since_update": 11126, "primary_category": "math.NT", "categories": "math.NT", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9411213v1", "title_word_count": 7, "title_word_diversity": 0.8571428571428571, "title_avg_word_len": 5.571428571428571, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 77, "abstract_word_diversity": 0.6753246753246753, "abstract_avg_word_len": 4.688311688311688, "abstract_avg_sent_len": 28.8, "abstract_readability": 62.48, "abstract_sentiment": "Optimistic"}
{"id": "math/9411214v1", "title": "Conformal Characters and Theta Series", "abstract": "We describe the construction of vector valued modular forms transforming under a given congruence representation of the modular group SL$(\\bold Z)$ in terms of theta series. We apply this general setup to obtain closed and easily computable formulas for conformal characters of rational models of $W$-algebras.", "authors": "Wolgang Eholzer, Nils-Peter Skoruppa", "num_authors": 2, "published_date": "1994-11-11", "days_since_pub": 11124, "updated_date": "1994-11-11", "days_since_update": 11124, "primary_category": "math.NT", "categories": "math.NT", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9411214v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 6.6, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 45, "abstract_word_diversity": 0.8444444444444444, "abstract_avg_word_len": 5.6, "abstract_avg_sent_len": 28.0, "abstract_readability": 22.75, "abstract_sentiment": "Optimistic"}
{"id": "math/9310225v1", "title": "Coupling and Harnack inequalities for Sierpinski carpets", "abstract": "Uniform Harnack inequalities for harmonic functions on the pre- and graphical Sierpinski carpets are proved using a probabilistic coupling argument. Various results follow from this, including the construction of Brownian motion on Sierpinski carpets embedded in $\\R^d$, $d\\geq 3$, estimates on the fundamental solution of the heat equation, and Sobolev and Poincar\\'e inequalities.", "authors": "Martin T. Barlow, Richard F. Bass", "num_authors": 2, "published_date": "1993-10-01", "days_since_pub": 11530, "updated_date": "1993-10-01", "days_since_update": 11530, "primary_category": "math.PR", "categories": "math.PR", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9310225v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.142857142857143, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 50, "abstract_word_diversity": 0.78, "abstract_avg_word_len": 6.16, "abstract_avg_sent_len": 32.5, "abstract_readability": 10.74, "abstract_sentiment": "Positive"}
{"id": "math/9410222v1", "title": "A general decomposition theory for random cascades", "abstract": "This announcement describes a probabilistic approach to cascades which, in addition to providing an entirely probabilistic proof of the Kahane-Peyri\\`ere theorem for independent cascades, readily applies to general dependent cascades. Moreover, this unifies various seemingly disparate cascade decompositions, including Kahane's T-martingale decomposition and dimension disintegration.", "authors": "Edward C. Waymire, Stanley C. Williams", "num_authors": 2, "published_date": "1994-10-01", "days_since_pub": 11165, "updated_date": "1994-10-01", "days_since_update": 11165, "primary_category": "math.PR", "categories": "math.PR", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9410222v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 7.166666666666667, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 46, "abstract_word_diversity": 0.8478260869565217, "abstract_avg_word_len": 7.108695652173913, "abstract_avg_sent_len": 27.0, "abstract_readability": -19.05, "abstract_sentiment": "Neutral"}
{"id": "math/9508222v1", "title": "The dimension of the Brownian frontier is greater than 1", "abstract": "Consider a planar Brownian motion run for finite time. The frontier or ``outer boundary'' of the path is the boundary of the unbounded component of the complement. Burdzy (1989) showed that the frontier has infinite length. We improve this by showing that the Hausdorff dimension of the frontier is strictly greater than 1. (It has been conjectured that the Brownian frontier has dimension $4/3$, but this is still open.) The proof uses Jones's Traveling Salesman Theorem and a self-similar tiling of the plane by fractal tiles known as Gosper Islands.", "authors": "Christopher J. Bishop, Peter Jones, Robin Pemantle, Yuval Peres", "num_authors": 4, "published_date": "1995-08-02", "days_since_pub": 10860, "updated_date": "1995-08-02", "days_since_update": 10860, "primary_category": "math.PR", "categories": "math.PR", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9508222v1", "title_word_count": 9, "title_word_diversity": 0.8888888888888888, "title_avg_word_len": 5.111111111111111, "title_avg_sent_len": 10.0, "title_sentiment": "Positive", "abstract_word_count": 86, "abstract_word_diversity": 0.6744186046511628, "abstract_avg_word_len": 5.034883720930233, "abstract_avg_sent_len": 17.666666666666668, "abstract_readability": 64.71, "abstract_sentiment": "Positive"}
{"id": "math/9701222v1", "title": "No directed fractal percolation in zero area", "abstract": "We show that fractal (or \"Mandelbrot\") percolation in two dimensions produces a set containing no directed paths, when the set produced has zero area. This improves a similar result by the first author in the case of constant retention probabilities to the case of retention probabilities approaching 1.", "authors": "Lincoln Chayes, Robin Pemantle, Yuval Peres", "num_authors": 3, "published_date": "1997-01-23", "days_since_pub": 10320, "updated_date": "1997-01-23", "days_since_update": 10320, "primary_category": "math.PR", "categories": "math.PR", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9701222v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 5.428571428571429, "title_avg_sent_len": 7.0, "title_sentiment": "Cautious", "abstract_word_count": 45, "abstract_word_diversity": 0.8, "abstract_avg_word_len": 5.466666666666667, "abstract_avg_sent_len": 27.5, "abstract_readability": 30.2, "abstract_sentiment": "Neutral"}
{"id": "math/9701223v1", "title": "Markov chains in a field of traps", "abstract": "A general criterion is given for when a Markov chain trapped with probability p(x) in state x will be almost surely trapped. The quenched (state x is a trap forever with probability p(x)) and annealed (state x traps with probability p(x) on each visit) problems are shown to be equivalent.", "authors": "Robin Pemantle, Stanislav Volkov", "num_authors": 2, "published_date": "1997-01-23", "days_since_pub": 10320, "updated_date": "1997-01-23", "days_since_update": 10320, "primary_category": "math.PR", "categories": "math.PR", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9701223v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 4.333333333333333, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 41, "abstract_word_diversity": 0.7804878048780488, "abstract_avg_word_len": 5.2682926829268295, "abstract_avg_sent_len": 32.5, "abstract_readability": 46.1, "abstract_sentiment": "Negative"}
{"id": "math/9701224v1", "title": "Vertex-reinfoced random walk on Z visits finitely many states", "abstract": "Vertex-reinforced random walk is defined in Pemantle's (1988) thesis; it is a random walk that is biased to visit sites it has already visited a lot. We show that this reinforcement scheme, in contrast to the scheme of edge-reinforcement, causes random walk on a line to get trapped in a finite set.", "authors": "Robin Pemantle, Stanislav Volkov", "num_authors": 2, "published_date": "1997-01-23", "days_since_pub": 10320, "updated_date": "1997-01-23", "days_since_update": 10320, "primary_category": "math.PR", "categories": "math.PR", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9701224v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 5.666666666666667, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 49, "abstract_word_diversity": 0.7142857142857143, "abstract_avg_word_len": 4.673469387755102, "abstract_avg_sent_len": 30.0, "abstract_readability": 53.55, "abstract_sentiment": "Negative"}
{"id": "math/9701225v1", "title": "Sets avoided by Brownian motion", "abstract": "Any fixed cylinder is hit almost surely by a 3-dimensional Brownian motion, but is there a random cylinder that is in the complement? We answer this for cylinders, and then replacing a cylinder with a more general set.", "authors": "O. Adelman, Krzysztof Burdzy, Robin Pemantle", "num_authors": 3, "published_date": "1997-01-23", "days_since_pub": 10320, "updated_date": "1997-01-23", "days_since_update": 10320, "primary_category": "math.PR", "categories": "math.PR", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9701225v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 5.4, "title_avg_sent_len": 5.0, "title_sentiment": "Cautious", "abstract_word_count": 34, "abstract_word_diversity": 0.8823529411764706, "abstract_avg_word_len": 5.029411764705882, "abstract_avg_sent_len": 21.0, "abstract_readability": 52.19, "abstract_sentiment": "Positive"}
{"id": "math/9701226v1", "title": "First passage percolation and a model for competing spatial growth", "abstract": "We generalize Richardson's model by starting with two sites of different colors and giving each new site the color of the site that spawned it. We show that co-existence is possible.", "authors": "Olle Haggstrom, Robin Pemantle", "num_authors": 2, "published_date": "1997-01-23", "days_since_pub": 10320, "updated_date": "1997-01-23", "days_since_update": 10320, "primary_category": "math.PR", "categories": "math.PR", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9701226v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 6.222222222222222, "title_avg_sent_len": 10.0, "title_sentiment": "Positive", "abstract_word_count": 32, "abstract_word_diversity": 0.84375, "abstract_avg_word_len": 4.59375, "abstract_avg_sent_len": 17.0, "abstract_readability": 64.2, "abstract_sentiment": "Positive"}
{"id": "math/9701227v1", "title": "Paths with exponential intersection tails and oriented percolation", "abstract": "We show that oriented percolation occurs whenever a condition is satisfied called \"exponential intersection tails\". This condition says that a measure on paths exists for which the probability of two independent paths intersecting in more than k sites is exponentially small in k.", "authors": "Itai Benjamini, Robin Pemantle, Yuval Peres", "num_authors": 3, "published_date": "1997-01-23", "days_since_pub": 10320, "updated_date": "1997-01-23", "days_since_update": 10320, "primary_category": "math.PR", "categories": "math.PR", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9701227v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.375, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 39, "abstract_word_diversity": 0.8717948717948718, "abstract_avg_word_len": 5.897435897435898, "abstract_avg_sent_len": 23.5, "abstract_readability": 24.27, "abstract_sentiment": "Positive"}
{"id": "math/9701228v1", "title": "The probability that Brownian motion almost covers a line", "abstract": "Lower and upper estimates are given for the probability that the epsilon-enlargement of planar Brownian motion to time 1 (the epsilon sausage) contains a unit line segment. The estimates imply that Brownian motion to time 1 itself contains no line segment.", "authors": "Robin Pemantle", "num_authors": 1, "published_date": "1997-01-23", "days_since_pub": 10320, "updated_date": "1997-01-23", "days_since_update": 10320, "primary_category": "math.PR", "categories": "math.PR", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9701228v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 6.0, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 39, "abstract_word_diversity": 0.6666666666666666, "abstract_avg_word_len": 5.333333333333333, "abstract_avg_sent_len": 22.5, "abstract_readability": 42.21, "abstract_sentiment": "Cautious"}
{"id": "math/9503235v1", "title": "An exact analysis of stable allocation", "abstract": "Shapley and Scarf introduced a notion of stable allocation between traders and indivisible goods, when each trader has rank-ordered each of the goods. The purpose of this note is to prove that the distribution of ranks after allocation is the same as the distribution of search distances in uniform hashing, when the rank-orderings are independent and uniformly random. Therefore the average sum of final ranks is just $(n+1)H_n-n$, and the standard deviation is O(n). The proof involves a family of interesting one-to-one correspondences between permutations of a special kind.", "authors": "Donald E. Knuth", "num_authors": 1, "published_date": "1995-03-20", "days_since_pub": 10995, "updated_date": "1995-03-20", "days_since_update": 10995, "primary_category": "math.OC", "categories": "math.OC", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9503235v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 5.5, "title_avg_sent_len": 6.0, "title_sentiment": "Positive", "abstract_word_count": 88, "abstract_word_diversity": 0.6477272727272727, "abstract_avg_word_len": 5.2272727272727275, "abstract_avg_sent_len": 26.0, "abstract_readability": 40.38, "abstract_sentiment": "Optimistic"}
{"id": "math/9504228v1", "title": "Two-way rounding", "abstract": "Given $n$ real numbers $0\\leq x_1,...,x_n<1$ and a permutation~$\\sigma$ of $\\{1,...,n\\}$, we can always find $\\xbar_1,...,\\xbar_n\\in\\{0,1\\}$ so that the partial sums $\\xbar_1+... +\\xbar_k$ and $\\xbar_{\\sigma 1}+... +\\xbar_{\\sigma k}$ differ from the unrounded values $x_1+... + x_k$ and $x_{\\sigma 1}+... +x_{\\sigma k}$ by at most $n/(n+1)$, for $1\\leq k\\leq n$. The latter bound is best possible. The proof uses an elementary argument about flows in a certain network, and leads to a simple algorithm that finds an optimum way to round.", "authors": "Donald E. Knuth", "num_authors": 1, "published_date": "1995-04-01", "days_since_pub": 10983, "updated_date": "1995-04-01", "days_since_update": 10983, "primary_category": "math.OC", "categories": "math.OC", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9504228v1", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 4.666666666666667, "title_avg_sent_len": 2.0, "title_sentiment": "Neutral", "abstract_word_count": 64, "abstract_word_diversity": 0.75, "abstract_avg_word_len": 4.484375, "abstract_avg_sent_len": 50.0, "abstract_readability": 80.38, "abstract_sentiment": "Optimistic"}
{"id": "math/9901140v1", "title": "Control of nonlinear underactuated systems", "abstract": "In this paper we introduce a new method to design control laws for non-linear underactuated systems. Our method produces an infinite dimensional family of control laws, whereas most control techniques only produce a finite dimensional family. These control laws each come with a natural Lyapunov function. The inverted pendulum cart is used as an example. In addition, we construct an abstract system which is open loop unstable and cannot be stabilized using any linear control law, and demonstrate that our method produces a stabilizing control law.", "authors": "Dave Auckly, Lev Kapitanski, Warren White", "num_authors": 3, "published_date": "1999-01-29", "days_since_pub": 9584, "updated_date": "1999-01-29", "days_since_update": 9584, "primary_category": "math.OC", "categories": "math.OC", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9901140v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 7.6, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 83, "abstract_word_diversity": 0.7469879518072289, "abstract_avg_word_len": 5.457831325301205, "abstract_avg_sent_len": 19.0, "abstract_readability": 28.64, "abstract_sentiment": "Neutral"}
{"id": "math/9902023v1", "title": "Further results on controllability of recurrent neural networks", "abstract": "This paper studies controllability properties of recurrent neural networks. The new contributions are:   (1) an extension of the result in the previous paper \"Complete controllability of continuous-time recurrent neural networks\" (Sontag and Sussmann) to a slightly different model, where inputs appear in an affine form,   (2) a formulation and proof of a necessary and sufficient condition, in terms of local-local controllability, and   (3) a complete analysis of the 2-dimensional case for which the hypotheses made in previous work do not apply", "authors": "Eduardo D. Sontag, Y. Qiao", "num_authors": 2, "published_date": "1999-02-03", "days_since_pub": 9579, "updated_date": "1999-02-03", "days_since_update": 9579, "primary_category": "math.OC", "categories": "math.OC, 93B05", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9902023v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 76, "abstract_word_diversity": 0.6710526315789473, "abstract_avg_word_len": 5.7368421052631575, "abstract_avg_sent_len": 48.5, "abstract_readability": 4.99, "abstract_sentiment": "Neutral"}
{"id": "math/9902124v2", "title": "Feedback Stabilization over Commutative Rings: Further study of the coordinate-free approach", "abstract": "This paper is concerned with the coordinate-free approach to control systems. The coordinate-free approach is a factorization approach but does not require the coprime factorizations of the plant. We present two criteria for feedback stabilizability for MIMO systems in which transfer functions belong to the total rings of fractions of commutative rings. Both of them are generalizations of Sule's results in [SIAM J. Control Optim., 32-6, 1675-1695(1994)]. The first criterion is expressed in terms of modules generated from a causal plant and does not require the plant to be strictly causal. It shows that if the plant is stabilizable, the modules are projective. The other criterion is expressed in terms of ideals called generalized elementary factors. This gives the stabilizability of a causal plant in terms of the coprimeness of the generalized elementary factors. As an example, a discrete finite-time delay system is considered.", "authors": "Kazuyoshi Mori, Kenichi Abe", "num_authors": 2, "published_date": "1999-02-22", "days_since_pub": 9560, "updated_date": "1999-12-14", "days_since_update": 9265, "primary_category": "math.OC", "categories": "math.OC, 93C05 (Primary); 93D15, 93B50, 93B25 (Secondary)", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9902124v2", "title_word_count": 12, "title_word_diversity": 1.0, "title_avg_word_len": 6.666666666666667, "title_avg_sent_len": 12.0, "title_sentiment": "Neutral", "abstract_word_count": 140, "abstract_word_diversity": 0.5714285714285714, "abstract_avg_word_len": 5.364285714285714, "abstract_avg_sent_len": 16.4, "abstract_readability": 38.32, "abstract_sentiment": "Neutral"}
{"id": "math/9903022v1", "title": "A Tuner that Accelerates Parameters", "abstract": "We propose a tuner, suitable for adaptive control and (in its discrete-time version) adaptive filtering applications, that sets the second derivative of the parameter estimates rather than the first derivative as is done in the overwhelming majority of the literature. Comparative stability and performance analyses are presented.", "authors": "Felipe M. Pait, Paulo A Atkinson", "num_authors": 2, "published_date": "1999-03-02", "days_since_pub": 9552, "updated_date": "1999-03-02", "days_since_update": 9552, "primary_category": "math.OC", "categories": "math.OC", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9903022v1", "title_word_count": 4, "title_word_diversity": 1.0, "title_avg_word_len": 7.5, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 47, "abstract_word_diversity": 0.8085106382978723, "abstract_avg_word_len": 5.872340425531915, "abstract_avg_sent_len": 26.5, "abstract_readability": 5.32, "abstract_sentiment": "Neutral"}
{"id": "math/9904056v1", "title": "Extremal Optimization: Methods derived from Co-Evolution", "abstract": "We describe a general-purpose method for finding high-quality solutions to hard optimization problems, inspired by self-organized critical models of co-evolution such as the Bak-Sneppen model. The method, called Extremal Optimization, successively eliminates extremely undesirable components of sub-optimal solutions, rather than ``breeding'' better components. In contrast to Genetic Algorithms which operate on an entire ``gene-pool'' of possible solutions, Extremal Optimization improves on a single candidate solution by treating each of its components as species co-evolving according to Darwinian principles. Unlike Simulated Annealing, its non-equilibrium approach effects an algorithm requiring few parameters to tune. With only one adjustable parameter, its performance proves competitive with, and often superior to, more elaborate stochastic optimization procedures. We demonstrate it here on two classic hard optimization problems: graph partitioning and the traveling salesman problem.", "authors": "Stefan Boettcher, Allon G. Percus", "num_authors": 2, "published_date": "1999-04-13", "days_since_pub": 9510, "updated_date": "1999-04-13", "days_since_update": 9510, "primary_category": "math.OC", "categories": "math.OC", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9904056v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 7.0, "title_sentiment": "Positive", "abstract_word_count": 135, "abstract_word_diversity": 0.762962962962963, "abstract_avg_word_len": 6.192592592592592, "abstract_avg_sent_len": 24.666666666666668, "abstract_readability": -9.37, "abstract_sentiment": "Optimistic"}
{"id": "math/9906107v1", "title": "Games, predictions, interactivity", "abstract": "This short note is devoted to the unraveling of the hidden interactivity of ordinary games which is an artefact of predictions of the behaviour of other players by the fixed player and describes deviations of their real behaviour from such predictions. A method to improve the predictions is proposed. Applications to the strategical analysis of interactive games are also briefly specified.", "authors": "Denis V. Juriev", "num_authors": 1, "published_date": "1999-06-15", "days_since_pub": 9447, "updated_date": "1999-06-15", "days_since_update": 9447, "primary_category": "math.OC", "categories": "math.OC, 90D25 (Primary) 93B52 (Secondary)", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9906107v1", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 9.666666666666666, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 60, "abstract_word_diversity": 0.6833333333333333, "abstract_avg_word_len": 5.45, "abstract_avg_sent_len": 21.333333333333332, "abstract_readability": 33.95, "abstract_sentiment": "Optimistic"}
{"id": "math/9908087v2", "title": "A Parameterization of Stabilizing Controllers over Commutative Rings", "abstract": "We present a parameterization of the stabilizing controllers over commutative rings. In the classical case, that is, in the case where there exist the right-/left-coprime factorizations of the given plant, the stabilizing controllers can be parameterized by the method called ``Youla-Kucera-parameterization''. However, it is known that there exist models in which some stabilizable transfer matrices do not have their right-/left-coprime factorizations. In such models, we cannot employ the Youla-Kucera-parameterization directly. Our method of this paper can be applied to even such models.", "authors": "Kazuyoshi Mori", "num_authors": 1, "published_date": "1999-08-17", "days_since_pub": 9384, "updated_date": "1999-08-18", "days_since_update": 9383, "primary_category": "math.OC", "categories": "math.OC, 93A05;93C05;93C35;93B50;93D15", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9908087v2", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 8.571428571428571, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 89, "abstract_word_diversity": 0.6179775280898876, "abstract_avg_word_len": 5.46067415730337, "abstract_avg_sent_len": 19.0, "abstract_readability": 29.45, "abstract_sentiment": "Neutral"}
{"id": "math/9908088v1", "title": "Feedback Stabilization over Commutative Rings with no Right-/Left-Coprime Factorizations", "abstract": "Anantharam showed in 1985 the existence of a model in which some stabilizable plants do not have its right-/left-coprime factorizations. In this paper, we give a condition of the nonexistence of the right-/left-coprime factorizations of stabilizable plants as a generalization of Anantharam's result. As examples of the models which satisfy the condition, we present two models. We illustrate the construction of a stabilizing controller of stabilizable single-input single-output plants of such models.", "authors": "Kazuyoshi MORI", "num_authors": 1, "published_date": "1999-08-17", "days_since_pub": 9384, "updated_date": "1999-08-17", "days_since_update": 9384, "primary_category": "math.OC", "categories": "math.OC, 93A05;93C05;93C35;93B50;93D15", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9908088v1", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 9.0, "title_sentiment": "Cautious", "abstract_word_count": 73, "abstract_word_diversity": 0.5616438356164384, "abstract_avg_word_len": 5.589041095890411, "abstract_avg_sent_len": 19.75, "abstract_readability": 36.28, "abstract_sentiment": "Positive"}
{"id": "math/9210213v1", "title": "Piercing convex sets", "abstract": "A family of sets has the $(p,q)$ property if among any $p$ members of the family some $q$ have a nonempty intersection. It is shown that for every $p\\ge q\\ge d+1$ there is a $c=c(p,q,d)<\\infty$ such that for every family $\\scr F$ of compact, convex sets in $R^d$ that has the $(p,q)$ property there is a set of at most $c$ points in $R^d$ that intersects each member of $\\scr F$. This extends Helly's Theorem and settles an old problem of Hadwiger and Debrunner.", "authors": "Noga Alon, Daniel J. Kleitman", "num_authors": 2, "published_date": "1992-10-01", "days_since_pub": 11895, "updated_date": "1992-10-01", "days_since_update": 11895, "primary_category": "math.MG", "categories": "math.MG", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9210213v1", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 6.0, "title_avg_sent_len": 3.0, "title_sentiment": "Neutral", "abstract_word_count": 70, "abstract_word_diversity": 0.6571428571428571, "abstract_avg_word_len": 4.357142857142857, "abstract_avg_sent_len": 42.666666666666664, "abstract_readability": 59.98, "abstract_sentiment": "Cautious"}
{"id": "math/9210218v1", "title": "A characterization of convex hyperbolic polyhedra and of convex polyhedra inscribed in the sphere", "abstract": "We describe a characterization of convex polyhedra in $\\h^3$ in terms of their dihedral angles, developed by Rivin. We also describe some geometric and combinatorial consequences of that theory. One of these consequences is a combinatorial characterization of convex polyhedra in $\\E^3$ all of whose vertices lie on the unit sphere. That resolves a problem posed by Jakob Steiner in 1832.", "authors": "Craig D. Hodgson, Igor Rivin, Warren D. Smith", "num_authors": 3, "published_date": "1992-10-01", "days_since_pub": 11895, "updated_date": "1992-10-01", "days_since_update": 11895, "primary_category": "math.MG", "categories": "math.MG", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9210218v1", "title_word_count": 13, "title_word_diversity": 0.7692307692307693, "title_avg_word_len": 6.384615384615385, "title_avg_sent_len": 14.0, "title_sentiment": "Neutral", "abstract_word_count": 55, "abstract_word_diversity": 0.6909090909090909, "abstract_avg_word_len": 5.527272727272727, "abstract_avg_sent_len": 17.5, "abstract_readability": 30.57, "abstract_sentiment": "Cautious"}
{"id": "math/9404230v1", "title": "On the Busemann-Petty problem concerning central sections of centrally symmetric convex bodies", "abstract": "We present a method which shows that in $\\Eb$ the Busemann-Petty problem, concerning central sections of centrally symmetric convex bodies, has a positive answer. Together with other results, this settles the problem in each dimension.", "authors": "Richard J. Gardner", "num_authors": 1, "published_date": "1994-04-01", "days_since_pub": 11348, "updated_date": "1994-04-01", "days_since_update": 11348, "primary_category": "math.MG", "categories": "math.MG", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9404230v1", "title_word_count": 13, "title_word_diversity": 1.0, "title_avg_word_len": 6.3076923076923075, "title_avg_sent_len": 12.0, "title_sentiment": "Cautious", "abstract_word_count": 34, "abstract_word_diversity": 0.9117647058823529, "abstract_avg_word_len": 5.588235294117647, "abstract_avg_sent_len": 21.0, "abstract_readability": 36.79, "abstract_sentiment": "Cautious"}
{"id": "math/9405218v1", "title": "Average kissing numbers for non-congruent sphere packings", "abstract": "The Koebe circle packing theorem states that every finite planar graph can be realized as the nerve of a packing of (non-congruent) circles in R^3. We investigate the average kissing number of finite packings of non-congruent spheres in R^3 as a first restriction on the possible nerves of such packings. We show that the supremum k of the average kissing number for all packings satisfies   12.566 ~ 666/53 <= k < 8 + 4*sqrt(3) ~ 14.928   We obtain the upper bound by a resource exhaustion argument and the upper bound by a construction involving packings of spherical caps in S^3. Our result contradicts two naive conjectures about the average kissing number: That it is unbounded, or that it is supremized by an infinite packing of congruent spheres.", "authors": "Greg Kuperberg, Oded Schramm", "num_authors": 2, "published_date": "1994-05-13", "days_since_pub": 11306, "updated_date": "1994-05-13", "days_since_update": 11306, "primary_category": "math.MG", "categories": "math.MG", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9405218v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 6.25, "title_avg_sent_len": 7.0, "title_sentiment": "Positive", "abstract_word_count": 111, "abstract_word_diversity": 0.5945945945945946, "abstract_avg_word_len": 5.117117117117117, "abstract_avg_sent_len": 35.25, "abstract_readability": 50.87, "abstract_sentiment": "Optimistic"}
{"id": "math/9505210v1", "title": "The Construction of Self-Similar Tilings", "abstract": "We give a construction of a self-similar tiling of the plane with any prescribed expansion coefficient $\\lambda\\in\\C$ (satisfying the necessary algebraic condition of being a complex Perron number).   For any integer $m>1$ we show that there exists a self-similar tiling with $2\\pi/m$-rotational symmetry group and expansion $\\lambda$ if and only if either $\\lambda$ or $\\lambda e^{2\\pi i/m}$ is a complex Perron number for which $e^{2\\pi i/m}$ is in $\\Q[\\lambda]$, respectively $Q[\\lambda e^{2\\pi i/m}]$.", "authors": "Richard Kenyon", "num_authors": 1, "published_date": "1995-05-30", "days_since_pub": 10924, "updated_date": "1995-05-30", "days_since_update": 10924, "primary_category": "math.MG", "categories": "math.MG", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9505210v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 5.833333333333333, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 68, "abstract_word_diversity": 0.6176470588235294, "abstract_avg_word_len": 5.147058823529412, "abstract_avg_sent_len": 57.0, "abstract_readability": 17.51, "abstract_sentiment": "Positive"}
{"id": "math/9508209v3", "title": "The Number of Intersection Points Made by the Diagonals of a Regular Polygon", "abstract": "We give a formula for the number of interior intersection points made by the diagonals of a regular $n$-gon. The answer is a polynomial on each residue class modulo 2520. We also compute the number of regions formed by the diagonals, by using Euler's formula $V-E+F=2$.", "authors": "Bjorn Poonen, Michael Rubinstein", "num_authors": 2, "published_date": "1995-08-02", "days_since_pub": 10860, "updated_date": "2006-03-18", "days_since_update": 6979, "primary_category": "math.MG", "categories": "math.MG, 51M04;11R18", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9508209v3", "title_word_count": 12, "title_word_diversity": 0.8333333333333334, "title_avg_word_len": 5.25, "title_avg_sent_len": 13.0, "title_sentiment": "Neutral", "abstract_word_count": 41, "abstract_word_diversity": 0.7073170731707317, "abstract_avg_word_len": 4.829268292682927, "abstract_avg_sent_len": 18.666666666666668, "abstract_readability": 39.03, "abstract_sentiment": "Neutral"}
{"id": "math/9510217v1", "title": "Realization spaces of 4-polytopes are universal", "abstract": "Let $P\\subset\\R^d$ be a $d$-dimensional polytope. The {\\em realization space} of~$P$ is the space of all polytopes $P'\\subset\\R^d$ that are combinatorially equivalent to~$P$, modulo affine transformations. We report on work by the first author, which shows that realization spaces of \\mbox{4-dimensional} polytopes can be ``arbitrarily bad'': namely, for every primary semialgebraic set~$V$ defined over~$\\Z$, there is a $4$-polytope $P(V)$ whose realization space is ``stably equivalent'' to~$V$. This implies that the realization space of a $4$-polytope can have the homotopy type of an arbitrary finite simplicial complex, and that all algebraic numbers are needed to realize all $4$- polytopes. The proof is constructive. These results sharply contrast the $3$-dimensional case, where realization spaces are contractible and all polytopes are realizable with integral coordinates (Steinitz's Theorem). No similar universality result was previously known in any fixed dimension.", "authors": "Jürgen Richter-Gebert, Günter M. Ziegler", "num_authors": 2, "published_date": "1995-10-01", "days_since_pub": 10800, "updated_date": "1995-10-01", "days_since_update": 10800, "primary_category": "math.MG", "categories": "math.MG", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9510217v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 6.666666666666667, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 131, "abstract_word_diversity": 0.6641221374045801, "abstract_avg_word_len": 5.694656488549619, "abstract_avg_sent_len": 28.571428571428573, "abstract_readability": 26.51, "abstract_sentiment": "Cautious"}
{"id": "math/9511225v1", "title": "Highly saturated packings and reduced coverings", "abstract": "We introduce and study certain notions which might serve as substitutes for maximum density packings and minimum density coverings. A body is a compact connected set which is the closure of its interior. A packing $\\cal P$ with congruent replicas of a body $K$ is $n$-saturated if no $n-1$ members of it can be replaced with $n$ replicas of $K$, and it is completely saturated if it is $n$-saturated for each $n\\ge 1$. Similarly, a covering $\\cal C$ with congruent replicas of a body $K$ is $n$-reduced if no $n$ members of it can be replaced by $n-1$ replicas of $K$ without uncovering a portion of the space, and it is completely reduced if it is $n$-reduced for each $n\\ge 1$. We prove that every body $K$ in $d$-dimensional Euclidean or hyperbolic space admits both an $n$-saturated packing and an $n$-reduced covering with replicas of $K$. Under some assumptions on $K\\subset \\mathbb{E}^d$ (somewhat weaker than convexity), we prove the existence of completely saturated packings and completely reduced coverings, but in general, the problem of existence of completely saturated packings and completely reduced coverings remains unsolved. Also, we investigate some problems related to the the densities of $n$-saturated packings and $n$-reduced coverings. Among other things, we prove that there exists an upper bound for the density of a $d+2$-reduced covering of $\\mathbb{E}^d$ with congruent balls, and we produce some density bounds for the $n$-saturated packings and $n$-reduced coverings of the plane with congruent circles.", "authors": "Gabor Fejes Tóth, Greg Kuperberg, Włodzimierz Kuperberg", "num_authors": 3, "published_date": "1995-11-24", "days_since_pub": 10746, "updated_date": "1995-11-24", "days_since_update": 10746, "primary_category": "math.MG", "categories": "math.MG", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9511225v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 221, "abstract_word_diversity": 0.4343891402714932, "abstract_avg_word_len": 5.1855203619909505, "abstract_avg_sent_len": 42.25, "abstract_readability": 32.16, "abstract_sentiment": "Negative"}
{"id": "math/9605221v1", "title": "Uniformly distributed distances: A geometric application of Jansen's inequality", "abstract": "Let $d_1\\leq d_2\\leq\\ldots\\leq d_{n\\choose 2}$ denote the distances determined by $n$ points in the plane. It is shown that $\\min\\sum_i (d_{i+1}-d_i)^2=O(n^{-6/7})$, where the minimum is taken over all point sets with minimal distance $d_1 \\geq 1$. This bound is asymptotically tight.", "authors": "János Pach, Joel Spencer", "num_authors": 2, "published_date": "1996-05-10", "days_since_pub": 10578, "updated_date": "1996-05-10", "days_since_update": 10578, "primary_category": "math.MG", "categories": "math.MG", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9605221v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 8.375, "title_avg_sent_len": 11.0, "title_sentiment": "Neutral", "abstract_word_count": 38, "abstract_word_diversity": 0.8421052631578947, "abstract_avg_word_len": 4.605263157894737, "abstract_avg_sent_len": 23.0, "abstract_readability": 66.03, "abstract_sentiment": "Positive"}
{"id": "math/9701213v1", "title": "Metric Entropy of Homogeneous Spaces", "abstract": "For a (compact) subset $K$ of a metric space and $\\varepsilon > 0$, the {\\em covering number} $N(K , \\varepsilon )$ is defined as the smallest number of balls of radius $\\varepsilon$ whose union covers $K$. Knowledge of the {\\em metric entropy}, i.e., the asymptotic behaviour of covering numbers for (families of) metric spaces is important in many areas of mathematics (geometry, functional analysis, probability, coding theory, to name a few). In this paper we give asymptotically correct estimates for covering numbers for a large class of homogeneous spaces of unitary (or orthogonal) groups with respect to some natural metrics, most notably the one induced by the operator norm. This generalizes earlier author's results concerning covering numbers of Grassmann manifolds; the generalization is motivated by applications to noncommutative probability and operator algebras. In the process we give a characterization of geodesics in $U(n)$ (or $SO(m)$) for a class of non-Riemannian metric structures.", "authors": "Stanislaw J. Szarek", "num_authors": 1, "published_date": "1997-01-28", "days_since_pub": 10315, "updated_date": "1997-01-28", "days_since_update": 10315, "primary_category": "math.MG", "categories": "math.MG", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9701213v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 6.4, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 138, "abstract_word_diversity": 0.6304347826086957, "abstract_avg_word_len": 5.6521739130434785, "abstract_avg_sent_len": 40.6, "abstract_readability": 20.92, "abstract_sentiment": "Optimistic"}
{"id": "math/9201305v1", "title": "Alternating sign matrices and domino tilings", "abstract": "We introduce a family of planar regions, called Aztec diamonds, and study the ways in which these regions can be tiled by dominoes. Our main result is a generating function that not only gives the number of domino tilings of the Aztec diamond of order $n$ but also provides information about the orientation of the dominoes (vertical versus horizontal) and the accessibility of one tiling from another by means of local modifications. Several proofs of the formula are given. The problem turns out to have connections with the alternating sign matrices of Mills, Robbins, and Rumsey, as well as the square ice model studied by Lieb.", "authors": "Noam Elkies, Greg Kuperberg, Michael Larsen, James Propp", "num_authors": 4, "published_date": "1991-06-01", "days_since_pub": 12383, "updated_date": "1991-06-01", "days_since_update": 12383, "primary_category": "math.CO", "categories": "math.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9201305v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 6.5, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 103, "abstract_word_diversity": 0.7572815533980582, "abstract_avg_word_len": 4.961165048543689, "abstract_avg_sent_len": 29.75, "abstract_readability": 36.12, "abstract_sentiment": "Neutral"}
{"id": "math/9206203v1", "title": "A Short Proof of Jacobi's Formula for the Number of Representations of an Integer as a Sum of Four Squares", "abstract": "A short and elementary proof, and a finite-form generalization, are given of Jacobi's formula for the number of ways of writing an integer as a sum of four squares (that implies Lagrange's famous 1777 theorem.)", "authors": "George Andrews, Shalsoh B. Ekhad, Doron Zeilberger", "num_authors": 3, "published_date": "1992-06-03", "days_since_pub": 12015, "updated_date": "1992-06-03", "days_since_update": 12015, "primary_category": "math.CO", "categories": "math.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9206203v1", "title_word_count": 18, "title_word_diversity": 0.8333333333333334, "title_avg_word_len": 4.611111111111111, "title_avg_sent_len": 21.0, "title_sentiment": "Neutral", "abstract_word_count": 32, "abstract_word_diversity": 0.875, "abstract_avg_word_len": 4.96875, "abstract_avg_sent_len": 42.0, "abstract_readability": 35.95, "abstract_sentiment": "Neutral"}
{"id": "math/9301202v1", "title": "Theorems for a Price: Tomorrow's Semi-Rigorous Mathematical Culture", "abstract": "The future of mathematics is described, by using the WZ algorithmic proof theory as a parable.", "authors": "Doron Zeilberger", "num_authors": 1, "published_date": "1993-01-03", "days_since_pub": 11801, "updated_date": "1993-01-03", "days_since_update": 11801, "primary_category": "math.CO", "categories": "math.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9301202v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 6.875, "title_avg_sent_len": 10.0, "title_sentiment": "Neutral", "abstract_word_count": 15, "abstract_word_diversity": 0.9333333333333333, "abstract_avg_word_len": 5.066666666666666, "abstract_avg_sent_len": 18.0, "abstract_readability": 38.32, "abstract_sentiment": "Neutral"}
{"id": "math/9306213v1", "title": "A WZ proof of Ramanujan's Formula for Pi", "abstract": "Ramanujan's series for Pi, that appeared in his famous letter to Hardy, is given a one-line WZ proof.", "authors": "Shalosh B. Ekhad, Doron Zeilberger", "num_authors": 2, "published_date": "1993-06-03", "days_since_pub": 11650, "updated_date": "1993-06-03", "days_since_update": 11650, "primary_category": "math.CO", "categories": "math.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9306213v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 4.285714285714286, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 18, "abstract_word_diversity": 1.0, "abstract_avg_word_len": 4.277777777777778, "abstract_avg_sent_len": 22.0, "abstract_readability": 61.67, "abstract_sentiment": "Positive"}
{"id": "math/9307202v1", "title": "Chu's 1303 Identity Implies Bombieri's 1990 Norm-Inequality [via an Identity of Beauzamy and Dégot]", "abstract": "The Vandermonde-Chu Binomial Coefficients Identity is shown to imply Bombieri's deep norm inequalities, via identities of Beauzamy-D\\'egot, and Reznick.", "authors": "Doron Zeilberger", "num_authors": 1, "published_date": "1993-07-02", "days_since_pub": 11621, "updated_date": "1993-07-02", "days_since_update": 11621, "primary_category": "math.CO", "categories": "math.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9307202v1", "title_word_count": 12, "title_word_diversity": 0.9166666666666666, "title_avg_word_len": 5.5, "title_avg_sent_len": 18.0, "title_sentiment": "Neutral", "abstract_word_count": 21, "abstract_word_diversity": 1.0, "abstract_avg_word_len": 5.904761904761905, "abstract_avg_sent_len": 23.0, "abstract_readability": -7.04, "abstract_sentiment": "Neutral"}
{"id": "math/9309212v1", "title": "Combinatorial Proofs of Capelli's and Turnbull's Identities from Classical Invariant Theory", "abstract": "Capelli's and Turnbull's classical identities are given elegant combinatorial proofs.", "authors": "Dominique Foata, Doron Zeilberger", "num_authors": 2, "published_date": "1993-09-21", "days_since_pub": 11540, "updated_date": "1993-09-21", "days_since_update": 11540, "primary_category": "math.CO", "categories": "math.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9309212v1", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 13.0, "title_sentiment": "Neutral", "abstract_word_count": 10, "abstract_word_diversity": 1.0, "abstract_avg_word_len": 7.1, "abstract_avg_sent_len": 13.0, "abstract_readability": -14.82, "abstract_sentiment": "Positive"}
{"id": "math/9310232v1", "title": "The Dinitz problem solved for rectangles", "abstract": "The Dinitz conjecture states that, for each $n$ and for every collection of $n$-element sets $S_{ij}$, an $n\\times n$ partial latin square can be found with the $(i,j)$\\<th entry taken from $S_{ij}$. The analogous statement for $(n-1)\\times n$ rectangles is proven here. The proof uses a recent result by Alon and Tarsi and is given in terms of even and odd orientations of graphs.", "authors": "Jeannette C. M. Janssen", "num_authors": 1, "published_date": "1993-10-01", "days_since_pub": 11530, "updated_date": "1993-10-01", "days_since_update": 11530, "primary_category": "math.CO", "categories": "math.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9310232v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 5.833333333333333, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 60, "abstract_word_diversity": 0.7833333333333333, "abstract_avg_word_len": 4.5, "abstract_avg_sent_len": 33.333333333333336, "abstract_readability": 58.32, "abstract_sentiment": "Cautious"}
{"id": "math/9312214v1", "title": "The sandwich theorem", "abstract": "This report contains expository notes about a function $\\vartheta(G)$ that is popularly known as the Lov\\'asz number of a graph~$G$. There are many ways to define $\\vartheta(G)$, and the surprising variety of different characterizations indicates in itself that $\\vartheta(G)$ should be interesting. But the most interesting property of $\\vartheta(G)$ is probably the fact that it can be computed efficiently, although it lies ``sandwiched'' between other classic graph numbers whose computation is NP-hard. I~have tried to make these notes self-contained so that they might serve as an elementary introduction to the growing literature on Lov\\'asz's fascinating function.", "authors": "Donald E. Knuth", "num_authors": 1, "published_date": "1993-12-06", "days_since_pub": 11464, "updated_date": "1993-12-06", "days_since_update": 11464, "primary_category": "math.CO", "categories": "math.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9312214v1", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 6.0, "title_avg_sent_len": 3.0, "title_sentiment": "Neutral", "abstract_word_count": 98, "abstract_word_diversity": 0.7448979591836735, "abstract_avg_word_len": 5.377551020408164, "abstract_avg_sent_len": 32.0, "abstract_readability": 30.2, "abstract_sentiment": "Optimistic"}
{"id": "math/9405212v1", "title": "How Joe Gillis Discovered Combinatorial Special Function Theory", "abstract": "How Enumerative Combinatorics met Special Functions, thanks to Joe Gillis", "authors": "Doron Zeilberger", "num_authors": 1, "published_date": "1994-05-20", "days_since_pub": 11299, "updated_date": "1994-05-20", "days_since_update": 11299, "primary_category": "math.CO", "categories": "math.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9405212v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 8.0, "title_sentiment": "Positive", "abstract_word_count": 10, "abstract_word_diversity": 1.0, "abstract_avg_word_len": 6.3, "abstract_avg_sent_len": 11.0, "abstract_readability": 35.95, "abstract_sentiment": "Optimistic"}
{"id": "math/9406220v1", "title": "The Graphical Major Index", "abstract": "A generalization of the classical statistics ``maj'' and ``inv'' (the major index and number of inversions) on words is introduced, parameterized by arbitrary graphs on the underlying alphabet. The question of characterizing those graphs that lead to equi-distributed \"inv\" and \"maj\" is posed and answered.", "authors": "Dominique Foata, Doron Zeilberger", "num_authors": 2, "published_date": "1994-06-23", "days_since_pub": 11265, "updated_date": "1994-06-23", "days_since_update": 11265, "primary_category": "math.CO", "categories": "math.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9406220v1", "title_word_count": 4, "title_word_diversity": 1.0, "title_avg_word_len": 5.5, "title_avg_sent_len": 4.0, "title_sentiment": "Neutral", "abstract_word_count": 45, "abstract_word_diversity": 0.7111111111111111, "abstract_avg_word_len": 5.4, "abstract_avg_sent_len": 29.0, "abstract_readability": 31.72, "abstract_sentiment": "Neutral"}
{"id": "math/9201262v1", "title": "Editors' remarks (on two complexity theory surveys in the Bulletin)", "abstract": "The authors discuss the role of controversy in mathematics as a preface to two opposing articles on computational complexity theory: \"Some basic information on information-based complexity theory\" by Beresford Parlett [math.NA/9201266] and \"Perspectives on information-based complexity\" by J. F. Traub and Henryk Wo\\'zniakowski [math.NA/9201269].", "authors": "Morris W. Hirsch, Richard S. Palais", "num_authors": 2, "published_date": "1992-01-01", "days_since_pub": 12169, "updated_date": "1992-01-01", "days_since_update": 12169, "primary_category": "math.HO", "categories": "math.HO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9201262v1", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 5.5, "title_avg_sent_len": 13.0, "title_sentiment": "Neutral", "abstract_word_count": 46, "abstract_word_diversity": 0.717391304347826, "abstract_avg_word_len": 5.782608695652174, "abstract_avg_sent_len": 54.0, "abstract_readability": 14.25, "abstract_sentiment": "Neutral"}
{"id": "math/9205211v1", "title": "Two notes on notation", "abstract": "The author advocates two specific mathematical notations from his popular course and joint textbook, \"Concrete Mathematics\". The first of these, extending an idea of Iverson, is the notation \"[P]\" for the function which is 1 when the Boolean condition P is true and 0 otherwise. This notation can encourage and clarify the use of characteristic functions and Kronecker deltas in sums and integrals.   The second notation puts Stirling numbers on the same footing as binomial coefficients. Since binomial coefficients are written on two lines in parentheses and read \"n choose k\", Stirling numbers of the first kind should be written on two lines in brackets and read \"n cycle k\", while Stirling numbers of the second kind should be written in braces and read \"n subset k\". (I might say \"n partition k\".) The written form was first suggested by Imanuel Marx. The virtues of this notation are that Stirling partition numbers frequently appear in combinatorics, and that it more clearly presents functional relations similar to those satisfied by binomial coefficients.", "authors": "Donald E. Knuth", "num_authors": 1, "published_date": "1992-05-01", "days_since_pub": 12048, "updated_date": "1992-05-01", "days_since_update": 12048, "primary_category": "math.HO", "categories": "math.HO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9205211v1", "title_word_count": 4, "title_word_diversity": 1.0, "title_avg_word_len": 4.5, "title_avg_sent_len": 4.0, "title_sentiment": "Neutral", "abstract_word_count": 158, "abstract_word_diversity": 0.5949367088607594, "abstract_avg_word_len": 5.386075949367089, "abstract_avg_sent_len": 25.125, "abstract_readability": 41.29, "abstract_sentiment": "Optimistic"}
{"id": "math/9307227v1", "title": "``Theoretical mathematics'': Toward a cultural synthesis of mathematics and theoretical physics", "abstract": "Is speculative mathematics dangerous? Recent interactions between physics and mathematics pose the question with some force: traditional mathematical norms discourage speculation, but it is the fabric of theoretical physics. In practice there can be benefits, but there can also be unpleasant and destructive consequences. Serious caution is required, and the issue should be considered before, rather than after, obvious damage occurs. With the hazards carefully in mind, we propose a framework that should allow a healthy and positive role for speculation.", "authors": "Arthur Jaffe, Frank Quinn", "num_authors": 2, "published_date": "1993-07-01", "days_since_pub": 11622, "updated_date": "1993-07-01", "days_since_update": 11622, "primary_category": "math.HO", "categories": "math.HO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9307227v1", "title_word_count": 10, "title_word_diversity": 0.8, "title_avg_word_len": 7.9, "title_avg_sent_len": 14.0, "title_sentiment": "Neutral", "abstract_word_count": 79, "abstract_word_diversity": 0.759493670886076, "abstract_avg_word_len": 5.8734177215189876, "abstract_avg_sent_len": 18.6, "abstract_readability": 29.65, "abstract_sentiment": "Cautious"}
{"id": "math/9404229v1", "title": "Responses to ``Theoretical Mathematics: Toward a cultural synthesis of mathematics and theoretical physics'', by A. Jaffe and F. Quinn", "abstract": "This article is a collection of letters solicited by the editors of the Bulletin in response to a previous article by Jaffe and Quinn [math.HO/9307227]. The authors discuss the role of rigor in mathematics and the relation between mathematics and theoretical physics.", "authors": "Michael Atiyah, Armand Borel, G. J. Chaitin, Daniel Friedan, James Glimm, Jeremy J. Gray, Morris W. Hirsch, Saunder MacLane, Benoit B. Mandelbrot, David Ruelle, Albert Schwarz, Karen Uhlenbeck, René Thom, Edward Witten, Christopher Zeeman", "num_authors": 15, "published_date": "1994-04-01", "days_since_pub": 11348, "updated_date": "1994-04-01", "days_since_update": 11348, "primary_category": "math.HO", "categories": "math.HO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9404229v1", "title_word_count": 16, "title_word_diversity": 0.8125, "title_avg_word_len": 6.5625, "title_avg_sent_len": 23.0, "title_sentiment": "Neutral", "abstract_word_count": 41, "abstract_word_diversity": 0.7073170731707317, "abstract_avg_word_len": 5.146341463414634, "abstract_avg_sent_len": 23.0, "abstract_readability": 24.78, "abstract_sentiment": "Neutral"}
{"id": "math/9404231v1", "title": "Response to comments on ``Theoretical mathematics''", "abstract": "The authors discuss various objections and rejoinders in the collected responses [math.HO/9404229,math.HO/9404236] to their original article on the relationship between mathematics and theoretical physics [math.HO/9307227].", "authors": "Arthur Jaffe, Frank Quinn", "num_authors": 2, "published_date": "1994-04-01", "days_since_pub": 11348, "updated_date": "1994-04-01", "days_since_update": 11348, "primary_category": "math.HO", "categories": "math.HO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9404231v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 29, "abstract_word_diversity": 0.7586206896551724, "abstract_avg_word_len": 5.724137931034483, "abstract_avg_sent_len": 32.0, "abstract_readability": -0.44, "abstract_sentiment": "Positive"}
{"id": "math/9404233v1", "title": "Editor's column (on an article by Jaffe and Quinn)", "abstract": "This note is a preface to various responses [math.HO/9404229,math.HO/9404236] to an opinion piece by Jaffe and Quinn [math.HO/9307227] on the relationship between mathematics and theoretical physics.", "authors": "Richard S. Palais", "num_authors": 1, "published_date": "1994-04-01", "days_since_pub": 11348, "updated_date": "1994-04-01", "days_since_update": 11348, "primary_category": "math.HO", "categories": "math.HO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9404233v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 4.222222222222222, "title_avg_sent_len": 12.0, "title_sentiment": "Neutral", "abstract_word_count": 29, "abstract_word_diversity": 0.7931034482758621, "abstract_avg_word_len": 4.827586206896552, "abstract_avg_sent_len": 33.0, "abstract_readability": 37.26, "abstract_sentiment": "Neutral"}
{"id": "math/9404236v1", "title": "On proof and progress in mathematics", "abstract": "In response to Jaffe and Quinn [math.HO/9307227], the author discusses forms of progress in mathematics that are not captured by formal proofs of theorems, especially in his own work in the theory of foliations and geometrization of 3-manifolds and dynamical systems.", "authors": "William P. Thurston", "num_authors": 1, "published_date": "1994-04-01", "days_since_pub": 11348, "updated_date": "1994-04-01", "days_since_update": 11348, "primary_category": "math.HO", "categories": "math.HO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9404236v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 5.166666666666667, "title_avg_sent_len": 6.0, "title_sentiment": "Positive", "abstract_word_count": 42, "abstract_word_diversity": 0.7857142857142857, "abstract_avg_word_len": 5.023809523809524, "abstract_avg_sent_len": 46.0, "abstract_readability": 42.21, "abstract_sentiment": "Optimistic"}
{"id": "math/9708203v1", "title": "Electronic Mathematics Journals", "abstract": "In the Forum section of the November, 1993 Notices of the American Mathematical Society, John Franks discussed the electronic journal of the future. Since then, the New York Journal of Mathematics, the first electronic general mathematics journal, has begun publication. In this article, we explore the issues of electronic journal publishing in the context of this new project. We also discuss future developments.", "authors": "Mark Steinberger", "num_authors": 1, "published_date": "1997-08-26", "days_since_pub": 10105, "updated_date": "1997-08-26", "days_since_update": 10105, "primary_category": "math.HO", "categories": "math.HO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9708203v1", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 9.666666666666666, "title_avg_sent_len": 3.0, "title_sentiment": "Neutral", "abstract_word_count": 62, "abstract_word_diversity": 0.5967741935483871, "abstract_avg_word_len": 5.467741935483871, "abstract_avg_sent_len": 18.25, "abstract_readability": 30.06, "abstract_sentiment": "Neutral"}
{"id": "math/9801013v1", "title": "Mathematics Journals Should Be Electronic and Free", "abstract": "Many important journal functions would be lost if the mathematical community replaced all paper journals with electronic media. Electronic media are useful for some purposes, but they will not be the basis for a publishing revolution in the near future.", "authors": "Steven G. Krantz", "num_authors": 1, "published_date": "1998-01-05", "days_since_pub": 9973, "updated_date": "1998-01-05", "days_since_update": 9973, "primary_category": "math.HO", "categories": "math.HO, 68U15", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9801013v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 6.285714285714286, "title_avg_sent_len": 7.0, "title_sentiment": "Positive", "abstract_word_count": 39, "abstract_word_diversity": 0.8461538461538461, "abstract_avg_word_len": 5.384615384615385, "abstract_avg_sent_len": 21.5, "abstract_readability": 25.8, "abstract_sentiment": "Neutral"}
{"id": "math/9903001v1", "title": "Interactive games, dialogues and the verbalization", "abstract": "The note is devoted to an interactive game theoretic formalization of dialogues as psycholinguistic phenomena and the unraveling of a hidden dialogue structure of 2-person differential interactive games. In the field-theoretic description of interactive games the dialogues are defined naively as interactive games of discrete time with intention fields of continuous time; the correct mathematical formulation is proposed. The states and the controls of a dialogue correspond to the speech whereas the intention fields describe the understanding. In the case of dialogues the main inverse problem is to describe geometrical and algebraical properties of the understanding. On the other hand, a precise mathematical definition of dialogues allows to formulate a problem of the unraveling of a hidden dialogue structure of any 2-person differential interactive game. Such procedure is called the verbalization. It means that the states of a differential interactive game are interpreted as intention fields of a hidden dialogue and the problem is to describe such dialogue completely. If a 2-person differential interactive game is verbalizable one is able to consider many linguistic (e.g. the formal grammar of a related hidden dialogue) or psycholinguistic (e.g. the dynamical correlation of various implications) aspects of it.", "authors": "Denis V. Juriev", "num_authors": 1, "published_date": "1999-02-27", "days_since_pub": 9555, "updated_date": "1999-02-27", "days_since_update": 9555, "primary_category": "math.HO", "categories": "math.HO, 90D25 (Primary) 90D05, 49N55, 34H05, 93C41, 93B52 (Secondary)", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9903001v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 7.333333333333333, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 185, "abstract_word_diversity": 0.4648648648648649, "abstract_avg_word_len": 5.935135135135135, "abstract_avg_sent_len": 21.1, "abstract_readability": 17.84, "abstract_sentiment": "Neutral"}
{"id": "math/9808044v1", "title": "Simple proofing of Jordan's theorem", "abstract": "Here is present short proofing of Jordan's theorem about dividing of flat on two disjoint subsets by one closed curve.", "authors": "Oleg V. Goodyckov", "num_authors": 1, "published_date": "1998-08-11", "days_since_pub": 9755, "updated_date": "1998-08-11", "days_since_update": 9755, "primary_category": "math.GM", "categories": "math.GM, 54A35; 54B99; 55N99", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9808044v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 5.8, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 20, "abstract_word_diversity": 0.95, "abstract_avg_word_len": 4.8, "abstract_avg_sent_len": 22.0, "abstract_readability": 59.64, "abstract_sentiment": "Neutral"}
{"id": "math/9810027v5", "title": "A Concise and Direct Proof of \"Fermat's Last Theorem\"", "abstract": "The recently developed proof of Fermat's Last Theorem is very lengthy and difficult, so much so as to be beyond all but a small body of specialists. While certainly of value in the developments that resulted, that proof could not be, nor was offered as being, possibly the proof Fermat had in mind. The present proof being brief, direct and concise is a candidate for being what Fermat had in mind. It is also completely accessible to any one trained in common algebra. That critical suggestions offered by significant mathematics authorities have been unable to invalidate this concise and direct proof would tend to be major confirmation that: The proof stands, valid and not validly challenged.", "authors": "Roger Ellman", "num_authors": 1, "published_date": "1998-10-05", "days_since_pub": 9700, "updated_date": "1999-09-02", "days_since_update": 9368, "primary_category": "math.GM", "categories": "math.GM", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9810027v5", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 5.0, "title_avg_sent_len": 12.0, "title_sentiment": "Neutral", "abstract_word_count": 114, "abstract_word_diversity": 0.6578947368421053, "abstract_avg_word_len": 4.964912280701754, "abstract_avg_sent_len": 25.8, "abstract_readability": 47.93, "abstract_sentiment": "Optimistic"}
{"id": "math/9903081v12", "title": "The Theory of Ultralogics Part I", "abstract": "As of the date of this version, this monograph (parts I and II) contains all of the known technical results relative to the Robinson-styled nonstandard modeling of natural languages and certain associated linguistic processes such as deduction via consequence operators among other concepts. These results have direct application to the construction of the GGU-model, the GID-model, the GD-model, the MA-model and also apply to philosophy, psychology, properton theory and other aspects of the Nonstandard Physical World (NSP-world).", "authors": "Robert A. Herrmann", "num_authors": 1, "published_date": "1999-03-13", "days_since_pub": 9541, "updated_date": "2012-12-26", "days_since_update": 4504, "primary_category": "math.GM", "categories": "math.GM, 03H10, 83F05", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9903081v12", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 5.2, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 82, "abstract_word_diversity": 0.6707317073170732, "abstract_avg_word_len": 5.341463414634147, "abstract_avg_sent_len": 44.5, "abstract_readability": 7.02, "abstract_sentiment": "Positive"}
{"id": "math/9903082v11", "title": "The Theory of Ultralogics Part II", "abstract": "As of this date of this version, this monograph (part I and II) contains most of the technical results relative to the Robinson-styled nonstandard modeling of natural languages and certain associated linguistic processes such as deduction via consequence operators among other concepts. These results have direct application to the construction of the GGU-model, GID-model, D-world model, MA-model and also apply to philosophy, psychology, properton theory and other aspects of the Nonstandard Physical World (NSP-world).", "authors": "Robert A. Herrmann", "num_authors": 1, "published_date": "1999-03-13", "days_since_pub": 9541, "updated_date": "2012-10-18", "days_since_update": 4573, "primary_category": "math.GM", "categories": "math.GM, 03H10, 83F05", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9903082v11", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 4.666666666666667, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 78, "abstract_word_diversity": 0.6794871794871795, "abstract_avg_word_len": 5.487179487179487, "abstract_avg_sent_len": 43.0, "abstract_readability": 8.54, "abstract_sentiment": "Positive"}
{"id": "math/9909153v1", "title": "Riemann Hypothesis", "abstract": "Through an equivalent condition on the Farey series set forth by Franel and Landau, we prove Riemann Hypothesis for the Riemann zeta-function and the Dirichlet L-function.", "authors": "Chengyan Liu", "num_authors": 1, "published_date": "1999-09-25", "days_since_pub": 9345, "updated_date": "1999-09-25", "days_since_update": 9345, "primary_category": "math.GM", "categories": "math.GM, 11M26, 11B57 (Primary), 11R42 (Secondary)", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9909153v1", "title_word_count": 2, "title_word_diversity": 1.0, "title_avg_word_len": 8.5, "title_avg_sent_len": 2.0, "title_sentiment": "Neutral", "abstract_word_count": 27, "abstract_word_diversity": 0.8148148148148148, "abstract_avg_word_len": 5.222222222222222, "abstract_avg_sent_len": 28.0, "abstract_readability": 45.09, "abstract_sentiment": "Neutral"}
{"id": "math/9909154v1", "title": "Sieve Method and Landau Problem", "abstract": "We solve Landau's four unattackable problems, including Goldbach Conjecture and Twin Prime Conjecture through sieve method.", "authors": "Chengyan Liu", "num_authors": 1, "published_date": "1999-09-25", "days_since_pub": 9345, "updated_date": "1999-09-25", "days_since_update": 9345, "primary_category": "math.GM", "categories": "math.GM, 11N35, 11P32", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9909154v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 5.4, "title_avg_sent_len": 5.0, "title_sentiment": "Cautious", "abstract_word_count": 16, "abstract_word_diversity": 0.9375, "abstract_avg_word_len": 6.5, "abstract_avg_sent_len": 19.0, "abstract_readability": 46.78, "abstract_sentiment": "Cautious"}
{"id": "math/9911147v1", "title": "Tactical games & behavioral self-organization", "abstract": "The interactive game theoretical approach to tactics and behavioral self-organization is developed. Though it uses the interactive game theoretical formalization of dialogues as psycholinguistic phenomena, the crucial role is played by the essentially new concept of a tactical game. Applications to the perception processes and related subjects (memory, recollection, image understanding, imagination) are discussed together with relations to the computer vision and pattern recognition (the dynamical formation of patterns and perception models during perception as a result of its self-organization) and computer games (modelling of the tactical behavior and self-organization, tactical RPG and elaboration of new tactical game techniques). The appendix is devoted to the operative computer games and the user programming of operative units in a multi-user online operative computer game.", "authors": "Denis V. Juriev", "num_authors": 1, "published_date": "1999-11-19", "days_since_pub": 9290, "updated_date": "1999-11-19", "days_since_update": 9290, "primary_category": "math.GM", "categories": "math.GM, 90D25 (Primary) 93B52, 93C41, 90D12, 90D20, 49N55, 90D80, 93C95\n  (Secondary)", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/math/9911147v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 7.8, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 123, "abstract_word_diversity": 0.5772357723577236, "abstract_avg_word_len": 6.08130081300813, "abstract_avg_sent_len": 34.25, "abstract_readability": -10.25, "abstract_sentiment": "Optimistic"}
{"id": "math/9912090v1", "title": "A counting method for finding rational approximates to arbitrary order roots of integers", "abstract": "It is shown that for finding rational approximates to m'th root of any integer to any accuracy one only needs the ability to count and to distinguish between m different classes of objects. To every integer N can be associated a 'replacement rule' that generates a word W* from another word W consisting of symbols belonging to a finite 'alphabet' of size m. This rule applied iteratively on almost any initial word W0, yields a sequence of words {Wi} such that the relative frequency of different symbols in the word Wi approaches powers of the m'th root of N as i tends to infinity", "authors": "Ashok Kumar Gupta, Ashok Kumar Mittal", "num_authors": 2, "published_date": "1999-12-11", "days_since_pub": 9268, "updated_date": "1999-12-11", "days_since_update": 9268, "primary_category": "math.GM", "categories": "math.GM", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9912090v1", "title_word_count": 12, "title_word_diversity": 1.0, "title_avg_word_len": 6.25, "title_avg_sent_len": 13.0, "title_sentiment": "Neutral", "abstract_word_count": 92, "abstract_word_diversity": 0.6739130434782609, "abstract_avg_word_len": 4.923913043478261, "abstract_avg_sent_len": 55.5, "abstract_readability": 27.79, "abstract_sentiment": "Positive"}
{"id": "math/9912230v1", "title": "A `replacement sequence' method for finding the largest real root of an integer monic polynomial", "abstract": "To every integer monic polynomial of degree m can be associated a `replacement rule' that generates a word W* from another word W consisting of symbols belonging to a finite `alphabet' of size 2m. This rule applied iteratively on almost any initial word Wo, yields a sequence of words {Wi}.   From acount of different symbols in the word Wi, one can obtain a rational approximate to the largest real root of the polynomial.", "authors": "A. K. Gupta, A. K. Mittal", "num_authors": 2, "published_date": "1999-12-30", "days_since_pub": 9249, "updated_date": "1999-12-30", "days_since_update": 9249, "primary_category": "math.GM", "categories": "math.GM", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/9912230v1", "title_word_count": 14, "title_word_diversity": 1.0, "title_avg_word_len": 5.642857142857143, "title_avg_sent_len": 17.0, "title_sentiment": "Neutral", "abstract_word_count": 64, "abstract_word_diversity": 0.71875, "abstract_avg_word_len": 5.109375, "abstract_avg_sent_len": 28.333333333333332, "abstract_readability": 29.89, "abstract_sentiment": "Neutral"}
{"id": "math/0001012v1", "title": "Simple Divisibility Rules for the 1st 1000 Prime Numbers", "abstract": "Simple divisibility rules are given for the 1st 1000 prime numbers.", "authors": "C. C. Briggs", "num_authors": 1, "published_date": "2000-01-04", "days_since_pub": 9244, "updated_date": "2000-01-04", "days_since_update": 9244, "primary_category": "math.GM", "categories": "math.GM", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/math/0001012v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 5.857142857142857, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 9, "abstract_word_diversity": 1.0, "abstract_avg_word_len": 5.444444444444445, "abstract_avg_sent_len": 12.0, "abstract_readability": 51.85, "abstract_sentiment": "Neutral"}
{"id": "0705.2363v1", "title": "Lasso type classifiers with a reject option", "abstract": "We consider the problem of binary classification where one can, for a particular cost, choose not to classify an observation. We present a simple proof for the oracle inequality for the excess risk of structural risk minimizers using a lasso type penalty.", "authors": "Marten Wegkamp", "num_authors": 1, "published_date": "2007-05-16", "days_since_pub": 6555, "updated_date": "2007-05-16", "days_since_update": 6555, "primary_category": "stat.ML", "categories": "stat.ML, 62C05 (Primary) 62G05, 62G08 (Secondary)", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/0705.2363v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 6.0, "title_avg_sent_len": 7.0, "title_sentiment": "Cautious", "abstract_word_count": 39, "abstract_word_diversity": 0.8205128205128205, "abstract_avg_word_len": 5.3076923076923075, "abstract_avg_sent_len": 23.0, "abstract_readability": 33.24, "abstract_sentiment": "Negative"}
{"id": "0706.3499v1", "title": "Metric Embedding for Nearest Neighbor Classification", "abstract": "The distance metric plays an important role in nearest neighbor (NN) classification. Usually the Euclidean distance metric is assumed or a Mahalanobis distance metric is optimized to improve the NN performance. In this paper, we study the problem of embedding arbitrary metric spaces into a Euclidean space with the goal to improve the accuracy of the NN classifier. We propose a solution by appealing to the framework of regularization in a reproducing kernel Hilbert space and prove a representer-like theorem for NN classification. The embedding function is then determined by solving a semidefinite program which has an interesting connection to the soft-margin linear binary support vector machine classifier. Although the main focus of this paper is to present a general, theoretical framework for metric embedding in a NN setting, we demonstrate the performance of the proposed method on some benchmark datasets and show that it performs better than the Mahalanobis metric learning algorithm in terms of leave-one-out and generalization errors.", "authors": "Bharath K. Sriperumbudur, Gert R. G. Lanckriet", "num_authors": 2, "published_date": "2007-06-24", "days_since_pub": 6516, "updated_date": "2007-06-24", "days_since_update": 6516, "primary_category": "stat.ML", "categories": "stat.ML", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0706.3499v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 7.833333333333333, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 156, "abstract_word_diversity": 0.6217948717948718, "abstract_avg_word_len": 5.57051282051282, "abstract_avg_sent_len": 28.5, "abstract_readability": 18.99, "abstract_sentiment": "Optimistic"}
{"id": "0707.3536v1", "title": "Degenerating families of dendrograms", "abstract": "Dendrograms used in data analysis are ultrametric spaces, hence objects of nonarchimedean geometry. It is known that there exist $p$-adic representation of dendrograms. Completed by a point at infinity, they can be viewed as subtrees of the Bruhat-Tits tree associated to the $p$-adic projective line. The implications are that certain moduli spaces known in algebraic geometry are $p$-adic parameter spaces of (families of) dendrograms, and stochastic classification can also be handled within this framework. At the end, we calculate the topology of the hidden part of a dendrogram.", "authors": "Patrick Erik Bradley", "num_authors": 1, "published_date": "2007-07-24", "days_since_pub": 6486, "updated_date": "2007-07-24", "days_since_update": 6486, "primary_category": "stat.ML", "categories": "stat.ML", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0707.3536v1", "title_word_count": 4, "title_word_diversity": 1.0, "title_avg_word_len": 8.25, "title_avg_sent_len": 4.0, "title_sentiment": "Neutral", "abstract_word_count": 87, "abstract_word_diversity": 0.7011494252873564, "abstract_avg_word_len": 5.413793103448276, "abstract_avg_sent_len": 21.6, "abstract_readability": 36.69, "abstract_sentiment": "Positive"}
{"id": "0707.4072v1", "title": "Families of dendrograms", "abstract": "A conceptual framework for cluster analysis from the viewpoint of p-adic geometry is introduced by describing the space of all dendrograms for n datapoints and relating it to the moduli space of p-adic Riemannian spheres with punctures using a method recently applied by Murtagh (2004b). This method embeds a dendrogram as a subtree into the Bruhat-Tits tree associated to the p-adic numbers, and goes back to Cornelissen et al. (2001) in p-adic geometry. After explaining the definitions, the concept of classifiers is discussed in the context of moduli spaces, and upper bounds for the number of hidden vertices in dendrograms are given.", "authors": "Patrick Erik Bradley", "num_authors": 1, "published_date": "2007-07-27", "days_since_pub": 6483, "updated_date": "2007-07-27", "days_since_update": 6483, "primary_category": "stat.ML", "categories": "stat.ML", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0707.4072v1", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 3.0, "title_sentiment": "Neutral", "abstract_word_count": 96, "abstract_word_diversity": 0.6770833333333334, "abstract_avg_word_len": 5.25, "abstract_avg_sent_len": 28.25, "abstract_readability": 37.13, "abstract_sentiment": "Neutral"}
{"id": "0708.2377v1", "title": "Online Learning in Discrete Hidden Markov Models", "abstract": "We present and analyse three online algorithms for learning in discrete Hidden Markov Models (HMMs) and compare them with the Baldi-Chauvin Algorithm. Using the Kullback-Leibler divergence as a measure of generalisation error we draw learning curves in simplified situations. The performance for learning drifting concepts of one of the presented algorithms is analysed and compared with the Baldi-Chauvin algorithm in the same situations. A brief discussion about learning and symmetry breaking based on our results is also presented.", "authors": "Roberto C. Alamino, Nestor Caticha", "num_authors": 2, "published_date": "2007-08-17", "days_since_pub": 6462, "updated_date": "2007-08-17", "days_since_update": 6462, "primary_category": "stat.ML", "categories": "stat.ML", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0708.2377v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 6.0, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 79, "abstract_word_diversity": 0.6835443037974683, "abstract_avg_word_len": 5.658227848101266, "abstract_avg_sent_len": 21.0, "abstract_readability": 26.3, "abstract_sentiment": "Cautious"}
{"id": "0709.2760v3", "title": "Supervised Machine Learning with a Novel Kernel Density Estimator", "abstract": "In recent years, kernel density estimation has been exploited by computer scientists to model machine learning problems. The kernel density estimation based approaches are of interest due to the low time complexity of either O(n) or O(n*log(n)) for constructing a classifier, where n is the number of sampling instances. Concerning design of kernel density estimators, one essential issue is how fast the pointwise mean square error (MSE) and/or the integrated mean square error (IMSE) diminish as the number of sampling instances increases. In this article, it is shown that with the proposed kernel function it is feasible to make the pointwise MSE of the density estimator converge at O(n^-2/3) regardless of the dimension of the vector space, provided that the probability density function at the point of interest meets certain conditions.", "authors": "Yen-Jen Oyang, Darby Tien-Hao Chang, Yu-Yen Ou, Hao-Geng Hung, Chih-Peng Wu, Chien-Yu Chen", "num_authors": 6, "published_date": "2007-09-18", "days_since_pub": 6430, "updated_date": "2007-10-16", "days_since_update": 6402, "primary_category": "stat.ML", "categories": "stat.ML", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0709.2760v3", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 9.0, "title_sentiment": "Positive", "abstract_word_count": 128, "abstract_word_diversity": 0.625, "abstract_avg_word_len": 5.2890625, "abstract_avg_sent_len": 39.5, "abstract_readability": 21.26, "abstract_sentiment": "Cautious"}
{"id": "0709.2936v1", "title": "Bayesian Classification and Regression with High Dimensional Features", "abstract": "This thesis responds to the challenges of using a large number, such as thousands, of features in regression and classification problems.   There are two situations where such high dimensional features arise. One is when high dimensional measurements are available, for example, gene expression data produced by microarray techniques. For computational or other reasons, people may select only a small subset of features when modelling such data, by looking at how relevant the features are to predicting the response, based on some measure such as correlation with the response in the training data. Although it is used very commonly, this procedure will make the response appear more predictable than it actually is. In Chapter 2, we propose a Bayesian method to avoid this selection bias, with application to naive Bayes models and mixture models.   High dimensional features also arise when we consider high-order interactions. The number of parameters will increase exponentially with the order considered. In Chapter 3, we propose a method for compressing a group of parameters into a single one, by exploiting the fact that many predictor variables derived from high-order interactions have the same values for all the training cases. The number of compressed parameters may have converged before considering the highest possible order. We apply this compression method to logistic sequence prediction models and logistic classification models.   We use both simulated data and real data to test our methods in both chapters.", "authors": "Longhai Li", "num_authors": 1, "published_date": "2007-09-18", "days_since_pub": 6430, "updated_date": "2007-09-18", "days_since_update": 6430, "primary_category": "stat.ML", "categories": "stat.ML", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0709.2936v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.75, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 229, "abstract_word_diversity": 0.5895196506550219, "abstract_avg_word_len": 5.493449781659389, "abstract_avg_sent_len": 21.583333333333332, "abstract_readability": 34.66, "abstract_sentiment": "Cautious"}
{"id": "0709.2989v1", "title": "Simulated Annealing: Rigorous finite-time guarantees for optimization on continuous domains", "abstract": "Simulated annealing is a popular method for approaching the solution of a global optimization problem. Existing results on its performance apply to discrete combinatorial optimization where the optimization variables can assume only a finite set of possible values. We introduce a new general formulation of simulated annealing which allows one to guarantee finite-time performance in the optimization of functions of continuous variables. The results hold universally for any optimization problem on a bounded domain and establish a connection between simulated annealing and up-to-date theory of convergence of Markov chain Monte Carlo methods on continuous domains. This work is inspired by the concept of finite-time learning with known accuracy and confidence developed in statistical learning theory.", "authors": "A. Lecchini-Visintini, J. Lygeros, J. Maciejowski", "num_authors": 3, "published_date": "2007-09-19", "days_since_pub": 6429, "updated_date": "2007-09-19", "days_since_update": 6429, "primary_category": "stat.ML", "categories": "stat.ML", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0709.2989v1", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 7.2727272727272725, "title_avg_sent_len": 11.0, "title_sentiment": "Neutral", "abstract_word_count": 113, "abstract_word_diversity": 0.6637168141592921, "abstract_avg_word_len": 5.991150442477876, "abstract_avg_sent_len": 24.0, "abstract_readability": 5.83, "abstract_sentiment": "Optimistic"}
{"id": "0710.0845v3", "title": "The nested Chinese restaurant process and Bayesian nonparametric inference of topic hierarchies", "abstract": "We present the nested Chinese restaurant process (nCRP), a stochastic process which assigns probability distributions to infinitely-deep, infinitely-branching trees. We show how this stochastic process can be used as a prior distribution in a Bayesian nonparametric model of document collections. Specifically, we present an application to information retrieval in which documents are modeled as paths down a random tree, and the preferential attachment dynamics of the nCRP leads to clustering of documents according to sharing of topics at multiple levels of abstraction. Given a corpus of documents, a posterior inference algorithm finds an approximation to a posterior distribution over trees, topics and allocations of words to levels of the tree. We demonstrate this algorithm on collections of scientific abstracts from several journals. This model exemplifies a recent trend in statistical machine learning--the use of Bayesian nonparametric methods to infer distributions on flexible data structures.", "authors": "David M. Blei, Thomas L. Griffiths, Michael I. Jordan", "num_authors": 3, "published_date": "2007-10-03", "days_since_pub": 6415, "updated_date": "2009-08-27", "days_since_update": 5721, "primary_category": "stat.ML", "categories": "stat.ML", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0710.0845v3", "title_word_count": 12, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 12.0, "title_sentiment": "Neutral", "abstract_word_count": 139, "abstract_word_diversity": 0.6330935251798561, "abstract_avg_word_len": 6.043165467625899, "abstract_avg_sent_len": 26.666666666666668, "abstract_readability": 13.28, "abstract_sentiment": "Optimistic"}
{"id": "0710.3183v1", "title": "Probabilistic coherence and proper scoring rules", "abstract": "We provide self-contained proof of a theorem relating probabilistic coherence of forecasts to their non-domination by rival forecasts with respect to any proper scoring rule. The theorem appears to be new but is closely related to results achieved by other investigators.", "authors": "Joel Predd, Robert Seiringer, Elliott H. Lieb, Daniel Osherson, Vincent Poor, Sanjeev Kulkarni", "num_authors": 6, "published_date": "2007-10-16", "days_since_pub": 6402, "updated_date": "2007-10-16", "days_since_update": 6402, "primary_category": "stat.ML", "categories": "stat.ML", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0710.3183v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 7.166666666666667, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 42, "abstract_word_diversity": 0.8333333333333334, "abstract_avg_word_len": 5.380952380952381, "abstract_avg_sent_len": 21.5, "abstract_readability": 25.29, "abstract_sentiment": "Positive"}
{"id": "math/0107135v2", "title": "Nonparametric Volatility Density Estimation", "abstract": "We consider two kinds of stochastic volatility models. Both kinds of models contain a stationary volatility process, the density of which, at a fixed instant in time, we aim to estimate.   We discuss discrete time models where for instance a log price process is modeled as the product of a volatility process and i.i.d. noise. We also consider samples of certain continuous time diffusion processes. The sampled time instants will be be equidistant with vanishing distance.   A Fourier type deconvolution kernel density estimator based on the logarithm of the squared processes is proposed to estimate the volatility density. Expansions of the bias and bounds on the variances are derived.", "authors": "Bert van Es, Peter Spreij, Harry van Zanten", "num_authors": 3, "published_date": "2001-07-19", "days_since_pub": 8682, "updated_date": "2002-06-16", "days_since_update": 8350, "primary_category": "math.ST", "categories": "math.ST, stat.TH, 62G07, 62M07, 62P20", "n_categories": 3, "pdf_url": "http://arxiv.org/pdf/math/0107135v2", "title_word_count": 4, "title_word_diversity": 1.0, "title_avg_word_len": 10.0, "title_avg_sent_len": 4.0, "title_sentiment": "Neutral", "abstract_word_count": 103, "abstract_word_diversity": 0.6407766990291263, "abstract_avg_word_len": 5.407766990291262, "abstract_avg_sent_len": 15.0, "abstract_readability": 38.72, "abstract_sentiment": "Neutral"}
{"id": "math/0109002v1", "title": "Asymptotic accuracy of the jackknife variance estimator for certain smooth statistics", "abstract": "We show that that the jackknife variance estimator $v_{jack}$ and the the infinitesimal jackknife variance estimator are asymptotically equivalent if the functional of interest is a smooth function of the mean or a smooth trimmed L-statistic. We calculate the asymptotic variance of $v_{jack}$ for these functionals.", "authors": "Alex D Gottlieb", "num_authors": 1, "published_date": "2001-09-01", "days_since_pub": 8638, "updated_date": "2001-09-01", "days_since_update": 8638, "primary_category": "math.ST", "categories": "math.ST, stat.TH, 62G09; 62G20", "n_categories": 3, "pdf_url": "http://arxiv.org/pdf/math/0109002v1", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 6.818181818181818, "title_avg_sent_len": 11.0, "title_sentiment": "Positive", "abstract_word_count": 44, "abstract_word_diversity": 0.6590909090909091, "abstract_avg_word_len": 5.75, "abstract_avg_sent_len": 29.0, "abstract_readability": 22.75, "abstract_sentiment": "Positive"}
{"id": "math/0111152v1", "title": "Approximating distribution functions by iterated function systems", "abstract": "In this paper an iterated function system on the space of distribution functions is built. The inverse problem is introduced and studied by convex optimization problems. Some applications of this method to approximation of distribution functions and to estimation theory are given.", "authors": "Stefano M. Iacus, Davide La Torre", "num_authors": 2, "published_date": "2001-11-13", "days_since_pub": 8565, "updated_date": "2001-11-13", "days_since_update": 8565, "primary_category": "math.ST", "categories": "math.ST, stat.TH, 62E17; 62H10; 37H", "n_categories": 3, "pdf_url": "http://arxiv.org/pdf/math/0111152v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 8.428571428571429, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 42, "abstract_word_diversity": 0.7857142857142857, "abstract_avg_word_len": 5.642857142857143, "abstract_avg_sent_len": 15.0, "abstract_readability": 31.89, "abstract_sentiment": "Cautious"}
{"id": "math/0111153v1", "title": "Statistical analysis of stochastic resonance with ergodic diffusion noise", "abstract": "A subthreshold signal is transmitted through a channel and may be detected when some noise -- with known structure and proportional to some level -- is added to the data. There is an optimal noise level, called stochastic resonance, that corresponds to the highest Fisher information in the problem of estimation of the signal. As noise we consider an ergodic diffusion process and the asymptotic is considered as time goes to infinity. We propose consistent estimators of the subthreshold signal and we solve further a problem of hypotheses testing. We also discuss evidence of stochastic resonance for both estimation and hypotheses testing problems via examples.", "authors": "Stefano M. Iacus", "num_authors": 1, "published_date": "2001-11-13", "days_since_pub": 8565, "updated_date": "2001-11-13", "days_since_update": 8565, "primary_category": "math.ST", "categories": "math.ST, stat.TH, 93E10; 62M99", "n_categories": 3, "pdf_url": "http://arxiv.org/pdf/math/0111153v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 7.222222222222222, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 100, "abstract_word_diversity": 0.63, "abstract_avg_word_len": 5.47, "abstract_avg_sent_len": 22.4, "abstract_readability": 33.65, "abstract_sentiment": "Cautious"}
{"id": "math/0112032v1", "title": "Asymptotic normality of kernel type deconvolution estimators", "abstract": "We derive asymptotic normality of kernel type deconvolution estimators of the density, the distribution function at a fixed point, and of the probability of an interval. We consider the so called super smooth case where the characteristic function of the known distribution decreases exponentially.   It turns out that the limit behavior of the pointwise estimators of the density and distribution function is relatively straightforward while the asymptotics of the estimator of the probability of an interval depends in a complicated way on the sequence of bandwidths.", "authors": "A. J. van Es, H. -W. Uh", "num_authors": 2, "published_date": "2001-12-04", "days_since_pub": 8544, "updated_date": "2001-12-04", "days_since_update": 8544, "primary_category": "math.ST", "categories": "math.ST, stat.TH, 62G05; 62E20", "n_categories": 3, "pdf_url": "http://arxiv.org/pdf/math/0112032v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.714285714285714, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 84, "abstract_word_diversity": 0.6071428571428571, "abstract_avg_word_len": 5.654761904761905, "abstract_avg_sent_len": 30.333333333333332, "abstract_readability": 16.96, "abstract_sentiment": "Optimistic"}
{"id": "math/0112298v1", "title": "Annuities under random rates of interest - revisited", "abstract": "In the article we consider accumulated values of annuities-certain with yearly payments with independent random interest rates. We focus on annuities with payments varying in arithmetic and geometric progression which are important basic varying annuities (see Kellison, 1991). They appear to be a generalization of the types studied recently by Zaks (2001). We derive, via recursive relationships, mean and variance formulae of the final values of the annuities. As a consequence, we obtain moments related to the already discussed cases, which leads to a correction of main results from Zaks (2001).", "authors": "K. Burnecki, A. Marciniuk, A. Weron", "num_authors": 3, "published_date": "2001-12-28", "days_since_pub": 8520, "updated_date": "2001-12-28", "days_since_update": 8520, "primary_category": "math.ST", "categories": "math.ST, stat.TH, 91B02; 62P05; 62P20", "n_categories": 3, "pdf_url": "http://arxiv.org/pdf/math/0112298v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 6.285714285714286, "title_avg_sent_len": 8.0, "title_sentiment": "Positive", "abstract_word_count": 86, "abstract_word_diversity": 0.7093023255813954, "abstract_avg_word_len": 5.569767441860465, "abstract_avg_sent_len": 21.4, "abstract_readability": 27.62, "abstract_sentiment": "Optimistic"}
{"id": "math/0202274v1", "title": "Estimation of Weibull Shape Parameter by Shrinkage Towards an Interval Under Failure Censored Sampling", "abstract": "This paper is speculated to propose a class of shrinkage estimators for shape parameter beta in failure censored samples from two-parameter Weibull distribution when some 'apriori' or guessed interval containing the parameter beta is available in addition to sample information and analyses their properties. Some estimators are generated from the proposed class and compared with the minimum mean squared error (MMSE) estimator. Numerical computations in terms of percent relative efficiency and absolute relative bias indicate that certain of these estimators substantially improve the MMSE estimator in some guessed interval of the parameter space of beta, especially for censored samples with small sizes. Subsequently, a modified class of shrinkage estimators is proposed with its properties.", "authors": "Housila P. Singh, Sharad Saxena, Jack Allen, Sarjinder Singh, Florentin Smarandache", "num_authors": 5, "published_date": "2002-02-26", "days_since_pub": 8460, "updated_date": "2002-02-26", "days_since_update": 8460, "primary_category": "math.ST", "categories": "math.ST, stat.TH, 62E17", "n_categories": 3, "pdf_url": "http://arxiv.org/pdf/math/0202274v1", "title_word_count": 14, "title_word_diversity": 1.0, "title_avg_word_len": 6.357142857142857, "title_avg_sent_len": 14.0, "title_sentiment": "Cautious", "abstract_word_count": 113, "abstract_word_diversity": 0.6194690265486725, "abstract_avg_word_len": 5.938053097345133, "abstract_avg_sent_len": 30.75, "abstract_readability": 8.71, "abstract_sentiment": "Cautious"}
{"id": "math/0203080v2", "title": "Estimating a structural distribution function by grouping", "abstract": "By the method of Poissonization we confirm some existing results concerning consistent estimation of the structural distribution function in the situation of a large number of rare events. Inconsistency of the so called natural estimator is proved. The method of grouping in cells of equal size is investigated and its consistency derived. A bound on the mean squared error is derived.", "authors": "Bert van Es, Stamatis Kolios", "num_authors": 2, "published_date": "2002-03-08", "days_since_pub": 8450, "updated_date": "2002-03-11", "days_since_update": 8447, "primary_category": "math.ST", "categories": "math.ST, stat.TH, 62G05; 62G20", "n_categories": 3, "pdf_url": "http://arxiv.org/pdf/math/0203080v2", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 8.333333333333334, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 59, "abstract_word_diversity": 0.7288135593220338, "abstract_avg_word_len": 5.406779661016949, "abstract_avg_sent_len": 16.25, "abstract_readability": 39.03, "abstract_sentiment": "Neutral"}
{"id": "math/0206006v2", "title": "An Illuminating Counterexample", "abstract": "We give a visually appealing counterexample to the proposition that unbiased estimators are better than biased estimators.", "authors": "Michael Hardy", "num_authors": 1, "published_date": "2002-06-03", "days_since_pub": 8363, "updated_date": "2002-08-03", "days_since_update": 8302, "primary_category": "math.ST", "categories": "math.ST, stat.TH, 62F10, 62F15", "n_categories": 3, "pdf_url": "http://arxiv.org/pdf/math/0206006v2", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 9.333333333333334, "title_avg_sent_len": 3.0, "title_sentiment": "Neutral", "abstract_word_count": 16, "abstract_word_diversity": 0.9375, "abstract_avg_word_len": 6.5, "abstract_avg_sent_len": 18.0, "abstract_readability": 3.46, "abstract_sentiment": "Neutral"}
{"id": "math/0206142v1", "title": "Nonparametric volatility density estimation for discrete time models", "abstract": "We consider discrete time models for asset prices with a stationary volatility process. We aim at estimating the multivariate density of this process at a set of consecutive time instants. A Fourier type deconvolution kernel density estimator based on the logarithm of the squared process is proposed to estimate the volatility density. Expansions of the bias and bounds on the variance are derived.", "authors": "Bert van Es, Peter Spreij, Harry van Zanten", "num_authors": 3, "published_date": "2002-06-14", "days_since_pub": 8352, "updated_date": "2002-06-14", "days_since_update": 8352, "primary_category": "math.ST", "categories": "math.ST, stat.TH, 62G07, 62M07, 62P20", "n_categories": 3, "pdf_url": "http://arxiv.org/pdf/math/0206142v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.625, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 60, "abstract_word_diversity": 0.7166666666666667, "abstract_avg_word_len": 5.5, "abstract_avg_sent_len": 16.75, "abstract_readability": 30.06, "abstract_sentiment": "Positive"}
{"id": "0704.1711v2", "title": "Dynamical Equilibrium, trajectories study in an economical system. The case of the labor market", "abstract": "The paper deals with the study of labor market dynamics, and aims to characterize its equilibriums and possible trajectories. The theoretical background is the theory of the segmented labor market. The main idea is that this theory is well adapted to interpret the observed trajectories, due to the heterogeneity of the work situations.", "authors": "Patrick Letrémy, Marie Cottrell, Patrice Gaubert, Joseph Rynkiewicz", "num_authors": 4, "published_date": "2007-04-13", "days_since_pub": 6588, "updated_date": "2007-07-09", "days_since_update": 6501, "primary_category": "stat.AP", "categories": "stat.AP", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0704.1711v2", "title_word_count": 14, "title_word_diversity": 0.9285714285714286, "title_avg_word_len": 5.714285714285714, "title_avg_sent_len": 8.0, "title_sentiment": "Positive", "abstract_word_count": 53, "abstract_word_diversity": 0.6415094339622641, "abstract_avg_word_len": 5.264150943396227, "abstract_avg_sent_len": 19.333333333333332, "abstract_readability": 28.13, "abstract_sentiment": "Positive"}
{"id": "0704.3474v1", "title": "Missing Data: A Comparison of Neural Network and Expectation Maximisation Techniques", "abstract": "The estimation of missing input vector elements in real time processing applications requires a system that possesses the knowledge of certain characteristics such as correlations between variables, which are inherent in the input space. Computational intelligence techniques and maximum likelihood techniques do possess such characteristics and as a result are important for imputation of missing data. This paper compares two approaches to the problem of missing data estimation. The first technique is based on the current state of the art approach to this problem, that being the use of Maximum Likelihood (ML) and Expectation Maximisation (EM. The second approach is the use of a system based on auto-associative neural networks and the Genetic Algorithm as discussed by Adbella and Marwala3. The estimation ability of both of these techniques is compared, based on three datasets and conclusions are made.", "authors": "Fulufhelo V. Nelwamondo, Shakir Mohamed, Tshilidzi Marwala", "num_authors": 3, "published_date": "2007-04-26", "days_since_pub": 6575, "updated_date": "2007-04-26", "days_since_update": 6575, "primary_category": "stat.AP", "categories": "stat.AP", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0704.3474v1", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 7.2, "title_avg_sent_len": 12.0, "title_sentiment": "Cautious", "abstract_word_count": 135, "abstract_word_diversity": 0.6, "abstract_avg_word_len": 5.555555555555555, "abstract_avg_sent_len": 25.0, "abstract_readability": 31.21, "abstract_sentiment": "Cautious"}
{"id": "0704.3862v1", "title": "An Integrated Human-Computer System for Controlling Interstate Disputes", "abstract": "In this paper we develop a scientific approach to control inter-country conflict. This system makes use of a neural network and a feedback control approach. It was found that by controlling the four controllable inputs: Democracy, Dependency, Allies and Capability simultaneously, all the predicted dispute outcomes could be avoided. Furthermore, it was observed that controlling a single input Dependency or Capability also avoids all the predicted conflicts. When the influence of each input variable on conflict is assessed, Dependency, Capability, and Democracy emerge as key variables that influence conflict.", "authors": "Tshilidzi Marwala, Monica Lagazio, Thando Tettey", "num_authors": 3, "published_date": "2007-04-29", "days_since_pub": 6572, "updated_date": "2007-04-29", "days_since_update": 6572, "primary_category": "stat.AP", "categories": "stat.AP", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0704.3862v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 8.0, "title_sentiment": "Cautious", "abstract_word_count": 86, "abstract_word_diversity": 0.7093023255813954, "abstract_avg_word_len": 5.906976744186046, "abstract_avg_sent_len": 20.4, "abstract_readability": 19.57, "abstract_sentiment": "Negative"}
{"id": "0705.0569v1", "title": "Mixed models for longitudinal left-censored repeated measures", "abstract": "Longitudinal studies could be complicated by left-censored repeated measures. For example, in Human Immunodeficiency Virus infection, there is a detection limit of the assay used to quantify the plasma viral load. Simple imputation of the limit of the detection or of half of this limit for left-censored measures biases estimations and their standard errors. In this paper, we review two likelihood-based methods proposed to handle left-censoring of the outcome in linear mixed model. We show how to fit these models using SAS Proc NLMIXED and we compare this tool with other programs. Indications and limitations of the programs are discussed and an example in the field of HIV infection is shown.", "authors": "Rodolphe Thiébaut, Hélène Jacqmin-Gadda", "num_authors": 2, "published_date": "2007-05-04", "days_since_pub": 6567, "updated_date": "2007-05-04", "days_since_update": 6567, "primary_category": "stat.AP", "categories": "stat.AP", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0705.0569v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 6.75, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 114, "abstract_word_diversity": 0.6754385964912281, "abstract_avg_word_len": 5.043859649122807, "abstract_avg_sent_len": 20.0, "abstract_readability": 35.78, "abstract_sentiment": "Neutral"}
{"id": "0705.2515v1", "title": "Finite Element Model Updating Using Bayesian Approach", "abstract": "This paper compares the Maximum-likelihood method and Bayesian method for finite element model updating. The Maximum-likelihood method was implemented using genetic algorithm while the Bayesian method was implemented using the Markov Chain Monte Carlo. These methods were tested on a simple beam and an unsymmetrical H-shaped structure. The results show that the Bayesian method gave updated finite element models that predicted more accurate modal properties than the updated finite element models obtained through the use of the Maximum-likelihood method. Furthermore, both these methods were found to require the same levels of computational loads.", "authors": "Tshilidzi Marwala, Lungile Mdlazi, Sibusiso Sibisi", "num_authors": 3, "published_date": "2007-05-17", "days_since_pub": 6554, "updated_date": "2007-05-17", "days_since_update": 6554, "primary_category": "stat.AP", "categories": "stat.AP", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0705.2515v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 6.714285714285714, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 95, "abstract_word_diversity": 0.631578947368421, "abstract_avg_word_len": 5.757894736842105, "abstract_avg_sent_len": 19.8, "abstract_readability": 27.22, "abstract_sentiment": "Neutral"}
{"id": "0705.3257v2", "title": "Evaluating Throwing Ability in Baseball", "abstract": "We present a quantitative analysis of throwing ability for major league outfielders and catchers. We use detailed game event data to tabulate success and failure events in outfielder and catcher throwing opportunities. We attribute a run contribution to each success or failure which are tabulated for each player in each season. We use four seasons of data to estimate the overall throwing ability of each player using a Bayesian hierarchical model. This model allows us to shrink individual player estimates towards an overall population mean depending on the number of opportunities for each player. We use the posterior distribution of player abilities from this model to identify players with significant positive and negative throwing contributions.", "authors": "Matthew Carruth, Shane T. Jensen", "num_authors": 2, "published_date": "2007-05-22", "days_since_pub": 6549, "updated_date": "2007-06-01", "days_since_update": 6539, "primary_category": "stat.AP", "categories": "stat.AP", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0705.3257v2", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 5.0, "title_sentiment": "Positive", "abstract_word_count": 112, "abstract_word_diversity": 0.625, "abstract_avg_word_len": 5.642857142857143, "abstract_avg_sent_len": 20.166666666666668, "abstract_readability": 26.61, "abstract_sentiment": "Optimistic"}
{"id": "0706.0073v1", "title": "Modeling Hourly Ozone Concentration Fields", "abstract": "This paper presents a dynamic linear model for modeling hourly ozone concentrations over the eastern United States. That model, which is developed within an Bayesian hierarchical framework, inherits the important feature of such models that its coefficients, treated as states of the process, can change with time. Thus the model includes a time--varying site invariant mean field as well as time varying coefficients for 24 and 12 diurnal cycle components. This cost of this model's great flexibility comes at the cost of computational complexity, forcing us to use an MCMC approach and to restrict application of our model domain to a small number of monitoring sites. We critically assess this model and discover some of its weaknesses in this type of application.", "authors": "Yiping Dou, Nhu D Le, James V Zidek", "num_authors": 3, "published_date": "2007-06-01", "days_since_pub": 6539, "updated_date": "2007-06-01", "days_since_update": 6539, "primary_category": "stat.AP", "categories": "stat.AP", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0706.0073v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 7.6, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 118, "abstract_word_diversity": 0.6864406779661016, "abstract_avg_word_len": 5.296610169491525, "abstract_avg_sent_len": 27.0, "abstract_readability": 38.25, "abstract_sentiment": "Optimistic"}
{"id": "0706.1401v1", "title": "Controlling for individual heterogeneity in longitudinal models, with applications to student achievement", "abstract": "Longitudinal data tracking repeated measurements on individuals are highly valued for research because they offer controls for unmeasured individual heterogeneity that might otherwise bias results. Random effects or mixed models approaches, which treat individual heterogeneity as part of the model error term and use generalized least squares to estimate model parameters, are often criticized because correlation between unobserved individual effects and other model variables can lead to biased and inconsistent parameter estimates. Starting with an examination of the relationship between random effects and fixed effects estimators in the standard unobserved effects model, this article demonstrates through analysis and simulation that the mixed model approach has a ``bias compression'' property under a general model for individual heterogeneity that can mitigate bias due to uncontrolled differences among individuals. The general model is motivated by the complexities of longitudinal student achievement measures, but the results have broad applicability to longitudinal modeling.", "authors": "J. R. Lockwood, Daniel F. McCaffrey", "num_authors": 2, "published_date": "2007-06-11", "days_since_pub": 6529, "updated_date": "2007-06-11", "days_since_update": 6529, "primary_category": "stat.AP", "categories": "stat.AP", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0706.1401v1", "title_word_count": 12, "title_word_diversity": 1.0, "title_avg_word_len": 7.75, "title_avg_sent_len": 13.0, "title_sentiment": "Neutral", "abstract_word_count": 146, "abstract_word_diversity": 0.6712328767123288, "abstract_avg_word_len": 6.36986301369863, "abstract_avg_sent_len": 39.5, "abstract_readability": -16.85, "abstract_sentiment": "Neutral"}
{"id": "0707.0462v1", "title": "M-estimation of Boolean models for particle flow experiments", "abstract": "Probability models are proposed for passage time data collected in experiments with a device designed to measure particle flow during aerial application of fertilizer. Maximum likelihood estimation of flow intensity is reviewed for the simple linear Boolean model, which arises with the assumption that each particle requires the same known passage time. M-estimation is developed for a generalization of the model in which passage times behave as a random sample from a distribution with a known mean. The generalized model improves fit in these experiments. An estimator of total particle flow is constructed by conditioning on lengths of multi-particle clumps.", "authors": "Jason A. Osborne, Tony E. Grift", "num_authors": 2, "published_date": "2007-07-03", "days_since_pub": 6507, "updated_date": "2007-07-03", "days_since_update": 6507, "primary_category": "stat.AP", "categories": "stat.AP", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0707.0462v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 6.375, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 96, "abstract_word_diversity": 0.6875, "abstract_avg_word_len": 5.729166666666667, "abstract_avg_sent_len": 21.2, "abstract_readability": 25.8, "abstract_sentiment": "Optimistic"}
{"id": "0707.0600v1", "title": "Does heterosexual transmission drive the HIV/AIDS epidemic in Sub-Saharan Africa (or elsewhere)?", "abstract": "A two-sex Basic Reproduction Number (BRN) is used to investigate the conditions under which the Human Immunodeficiency Virus (HIV) may spread through heterosexual contacts in Sub-Saharan Africa. (The BRN is the expected number of new infections generated by one infected individual; the disease spreads if the BRN is larger than 1). A simple analytical expression for the BRN is derived on the basis of recent data on survival rates, transmission probabilities, and levels of sexual activity. Baseline results show that in the population at large (characterized by equal numbers of men and women) the BRN is larger than 1 if every year each person has 82 sexual contacts with different partners. the BRN is also larger than 1 for commercial sex workers (CSWs) and their clients (two populations of different sizes) if each CSW has about 256 clients per year and each client visits one CSW every two weeks. A sensitivity analysis explores the effect on the BRN of a doubling (or a halving) of the transmission probabilities. Implications and extensions are discussed.", "authors": "Marc Artzrouni, Vivient Kamla", "num_authors": 2, "published_date": "2007-07-04", "days_since_pub": 6506, "updated_date": "2007-07-04", "days_since_update": 6506, "primary_category": "stat.AP", "categories": "stat.AP, 92Bxx; 62P10", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/0707.0600v1", "title_word_count": 14, "title_word_diversity": 1.0, "title_avg_word_len": 5.714285714285714, "title_avg_sent_len": 15.0, "title_sentiment": "Neutral", "abstract_word_count": 165, "abstract_word_diversity": 0.6242424242424243, "abstract_avg_word_len": 5.181818181818182, "abstract_avg_sent_len": 28.142857142857142, "abstract_readability": 29.48, "abstract_sentiment": "Cautious"}
{"id": "0706.0787v2", "title": "Construction of Bayesian Deformable Models via Stochastic Approximation Algorithm: A Convergence Study", "abstract": "The problem of the definition and the estimation of generative models based on deformable templates from raw data is of particular importance for modelling non aligned data affected by various types of geometrical variability. This is especially true in shape modelling in the computer vision community or in probabilistic atlas building for Computational Anatomy (CA). A first coherent statistical framework modelling the geometrical variability as hidden variables has been given by Allassonni\\`ere, Amit and Trouv\\'e (JRSS 2006). Setting the problem in a Bayesian context they proved the consistency of the MAP estimator and provided a simple iterative deterministic algorithm with an EM flavour leading to some reasonable approximations of the MAP estimator under low noise conditions. In this paper we present a stochastic algorithm for approximating the MAP estimator in the spirit of the SAEM algorithm. We prove its convergence to a critical point of the observed likelihood with an illustration on images of handwritten digits.", "authors": "Stéphanie Allassonnière, Estelle Kuhn, Alain Trouvé", "num_authors": 3, "published_date": "2007-06-06", "days_since_pub": 6534, "updated_date": "2009-01-16", "days_since_update": 5944, "primary_category": "stat.CO", "categories": "stat.CO, 60J22, 62F10, 62F15, 62M40.", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/0706.0787v2", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 8.090909090909092, "title_avg_sent_len": 13.0, "title_sentiment": "Neutral", "abstract_word_count": 151, "abstract_word_diversity": 0.6754966887417219, "abstract_avg_word_len": 5.66887417218543, "abstract_avg_sent_len": 28.5, "abstract_readability": 11.25, "abstract_sentiment": "Cautious"}
{"id": "0707.0167v1", "title": "The random Tukey depth", "abstract": "The computation of the Tukey depth, also called halfspace depth, is very demanding, even in low dimensional spaces, because it requires the consideration of all possible one-dimensional projections. In this paper we propose a random depth which approximates the Tukey depth. It only takes into account a finite number of one-dimensional projections which are chosen at random. Thus, this random depth requires a very small computation time even in high dimensional spaces. Moreover, it is easily extended to cover the functional framework.   We present some simulations indicating how many projections should be considered depending on the sample size and on the dimension of the sample space. We also compare this depth with some others proposed in the literature. It is noteworthy that the random depth, based on a very low number of projections, obtains results very similar to those obtained with other depths.", "authors": "J. A. Cuesta-Albertos, A. Nieto-Reyes", "num_authors": 2, "published_date": "2007-07-02", "days_since_pub": 6508, "updated_date": "2007-07-02", "days_since_update": 6508, "primary_category": "stat.CO", "categories": "stat.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0707.0167v1", "title_word_count": 4, "title_word_diversity": 1.0, "title_avg_word_len": 4.75, "title_avg_sent_len": 4.0, "title_sentiment": "Neutral", "abstract_word_count": 141, "abstract_word_diversity": 0.5815602836879432, "abstract_avg_word_len": 5.304964539007092, "abstract_avg_sent_len": 19.875, "abstract_readability": 36.39, "abstract_sentiment": "Cautious"}
{"id": "0708.1051v1", "title": "Deconvolution by simulation", "abstract": "Given samples (x_1,...,x_m) and (z_1,...,z_n) which we believe are independent realizations of random variables X and Z respectively, where we further believe that Z=X+Y with Y independent of X, the problem is to estimate the distribution of Y. We present a new method for doing this, involving simulation. Experiments suggest that the method provides useful estimates.", "authors": "Colin Mallows", "num_authors": 1, "published_date": "2007-08-08", "days_since_pub": 6471, "updated_date": "2007-08-08", "days_since_update": 6471, "primary_category": "stat.CO", "categories": "stat.CO, 60J10, 62G05, 94C99 (Primary)", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/0708.1051v1", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 8.333333333333334, "title_avg_sent_len": 3.0, "title_sentiment": "Neutral", "abstract_word_count": 47, "abstract_word_diversity": 0.7659574468085106, "abstract_avg_word_len": 5.76595744680851, "abstract_avg_sent_len": 24.666666666666668, "abstract_readability": 43.19, "abstract_sentiment": "Positive"}
{"id": "0709.1721v1", "title": "Parallel marginalization Monte Carlo with applications to conditional path sampling", "abstract": "Monte Carlo sampling methods often suffer from long correlation times. Consequently, these methods must be run for many steps to generate an independent sample. In this paper a method is proposed to overcome this difficulty. The method utilizes information from rapidly equilibrating coarse Markov chains that sample marginal distributions of the full system. This is accomplished through exchanges between the full chain and the auxiliary coarse chains. Results of numerical tests on the bridge sampling and filtering/smoothing problems for a stochastic differential equation are presented.", "authors": "Jonathan Weare", "num_authors": 1, "published_date": "2007-09-11", "days_since_pub": 6437, "updated_date": "2007-09-11", "days_since_update": 6437, "primary_category": "stat.CO", "categories": "stat.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0709.1721v1", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 7.4, "title_avg_sent_len": 10.0, "title_sentiment": "Neutral", "abstract_word_count": 84, "abstract_word_diversity": 0.7738095238095238, "abstract_avg_word_len": 5.916666666666667, "abstract_avg_sent_len": 15.333333333333334, "abstract_readability": 31.68, "abstract_sentiment": "Negative"}
{"id": "0709.3560v7", "title": "On The Density Estimation by Super-Parametric Method", "abstract": "The super-parametric density estimators and its related algorism were suggested by Y. -S. Tsai et al [7]. The number of parameters is unlimited in the super- parametric estimators and it is a general theory in sense of unifying or connecting nonparametric and parametric estimators. Before applying to numerical examples, we can not give any comment of the estimators. In this paper, we will focus on the implementation, the computer programming, of the algorism and strategies of choosing window functions. B-splines, Bezier splines and covering windows are studied as well. According to the criterion of the convergence conditions for Parzen window, the number of the window functions shall be, roughly, proportional to the number of samples and so is the number of the variables. Since the algorism is designed for solving the optimization of likelihood function, there will be a set of nonlinear equations with a large number of variables. The results show that algorism suggested by Y. -S. Tsai is very powerful and effective in the sense of mathematics, that is, the iteration procedures converge and the rates of convergence are very fast. Also, the numerical results of different window functions show that the approach of super-parametric density estimators has ushered a new era of statistics.", "authors": "Yeong-Shyeong Tsai, Ying-Lin Hsu, Mung-Chung Shung", "num_authors": 3, "published_date": "2007-09-24", "days_since_pub": 6424, "updated_date": "2008-11-07", "days_since_update": 6014, "primary_category": "stat.CO", "categories": "stat.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0709.3560v7", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 5.625, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 199, "abstract_word_diversity": 0.5276381909547738, "abstract_avg_word_len": 5.301507537688442, "abstract_avg_sent_len": 21.0, "abstract_readability": 35.57, "abstract_sentiment": "Optimistic"}
{"id": "0710.4242v4", "title": "Adaptive Importance Sampling in General Mixture Classes", "abstract": "In this paper, we propose an adaptive algorithm that iteratively updates both the weights and component parameters of a mixture importance sampling density so as to optimise the importance sampling performances, as measured by an entropy criterion. The method is shown to be applicable to a wide class of importance sampling densities, which includes in particular mixtures of multivariate Student t distributions. The performances of the proposed scheme are studied on both artificial and real examples, highlighting in particular the benefit of a novel Rao-Blackwellisation device which can be easily incorporated in the updating scheme.", "authors": "Olivier Cappé, Randal Douc, Arnaud Guillin, Jean-Michel Marin, Christian P. Robert", "num_authors": 5, "published_date": "2007-10-23", "days_since_pub": 6395, "updated_date": "2008-05-30", "days_since_update": 6175, "primary_category": "stat.CO", "categories": "stat.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0710.4242v4", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 7.0, "title_sentiment": "Positive", "abstract_word_count": 92, "abstract_word_diversity": 0.6956521739130435, "abstract_avg_word_len": 5.793478260869565, "abstract_avg_sent_len": 34.0, "abstract_readability": 13.92, "abstract_sentiment": "Optimistic"}
{"id": "0710.5098v1", "title": "Particle Filters for Multiscale Diffusions", "abstract": "We consider multiscale stochastic systems that are partially observed at discrete points of the slow time scale. We introduce a particle filter that takes advantage of the multiscale structure of the system to efficiently approximate the optimal filter.", "authors": "Anastasia Papavasiliou", "num_authors": 1, "published_date": "2007-10-26", "days_since_pub": 6392, "updated_date": "2007-10-26", "days_since_update": 6392, "primary_category": "stat.CO", "categories": "stat.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0710.5098v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 7.6, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 37, "abstract_word_diversity": 0.7567567567567568, "abstract_avg_word_len": 5.756756756756757, "abstract_avg_sent_len": 20.0, "abstract_readability": 35.27, "abstract_sentiment": "Optimistic"}
{"id": "0710.5670v2", "title": "An Elegant Method for Generating Multivariate Poisson Random Variable", "abstract": "Generating multivariate Poisson data is essential in many applications. Current simulation methods suffer from limitations ranging from computational complexity to restrictions on the structure of the correlation matrix. We propose a computationally efficient and conceptually appealing method for generating multivariate Poisson data. The method is based on simulating multivariate Normal data and converting them to achieve a specific correlation matrix and Poisson rate vector. This allows for generating data that have positive or negative correlations as well as different rates.", "authors": "Inbal Yahav, Galit Shmueli", "num_authors": 2, "published_date": "2007-10-30", "days_since_pub": 6388, "updated_date": "2008-03-12", "days_since_update": 6254, "primary_category": "stat.CO", "categories": "stat.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0710.5670v2", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 6.777777777777778, "title_avg_sent_len": 9.0, "title_sentiment": "Positive", "abstract_word_count": 78, "abstract_word_diversity": 0.717948717948718, "abstract_avg_word_len": 6.384615384615385, "abstract_avg_sent_len": 17.0, "abstract_readability": 4.47, "abstract_sentiment": "Neutral"}
{"id": "0711.0186v1", "title": "Population-Based Reversible Jump Markov Chain Monte Carlo", "abstract": "In this paper we present an extension of population-based Markov chain Monte Carlo (MCMC) to the trans-dimensional case. One of the main challenges in MCMC-based inference is that of simulating from high and trans-dimensional target measures. In such cases, MCMC methods may not adequately traverse the support of the target; the simulation results will be unreliable. We develop population methods to deal with such problems, and give a result proving the uniform ergodicity of these population algorithms, under mild assumptions. This result is used to demonstrate the superiority, in terms of convergence rate, of a population transition kernel over a reversible jump sampler for a Bayesian variable selection problem. We also give an example of a population algorithm for a Bayesian multivariate mixture model with an unknown number of components. This is applied to gene expression data of 1000 data points in six dimensions and it is demonstrated that our algorithm out performs some competing Markov chain samplers.", "authors": "Ajay Jasra, David A. Stephens, Chris C. Holmes", "num_authors": 3, "published_date": "2007-11-01", "days_since_pub": 6386, "updated_date": "2007-11-01", "days_since_update": 6386, "primary_category": "stat.CO", "categories": "stat.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0711.0186v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 6.25, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 155, "abstract_word_diversity": 0.6451612903225806, "abstract_avg_word_len": 5.393548387096774, "abstract_avg_sent_len": 24.714285714285715, "abstract_readability": 23.16, "abstract_sentiment": "Neutral"}
{"id": "0801.3552v3", "title": "A statistical analysis of probabilistic counting algorithms", "abstract": "This paper considers the problem of cardinality estimation in data stream applications. We present a statistical analysis of probabilistic counting algorithms, focusing on two techniques that use pseudo-random variates to form low-dimensional data sketches. We apply conventional statistical methods to compare probabilistic algorithms based on storing either selected order statistics, or random projections. We derive estimators of the cardinality in both cases, and show that the maximal-term estimator is recursively computable and has exponentially decreasing error bounds. Furthermore, we show that the estimators have comparable asymptotic efficiency, and explain this result by demonstrating an unexpected connection between the two approaches.", "authors": "Peter Clifford, Ioana A. Cosma", "num_authors": 2, "published_date": "2008-01-23", "days_since_pub": 6303, "updated_date": "2010-11-07", "days_since_update": 5284, "primary_category": "stat.CO", "categories": "stat.CO", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0801.3552v3", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 8.666666666666666, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 102, "abstract_word_diversity": 0.7450980392156863, "abstract_avg_word_len": 6.264705882352941, "abstract_avg_sent_len": 22.0, "abstract_readability": 0.42, "abstract_sentiment": "Cautious"}
{"id": "0705.0700v3", "title": "Inflated Beta Distributions", "abstract": "This paper considers the issue of modeling fractional data observed in the interval [0,1), (0,1] or [0,1]. Mixed continuous-discrete distributions are proposed. The beta distribution is used to describe the continuous component of the model since its density can have quite diferent shapes depending on the values of the two parameters that index the distribution. Properties of the proposed distributions are examined. Also, maximum likelihood and method of moments estimation is discussed. Finally, practical applications that employ real data are presented.", "authors": "Raydonal Ospina, Silvia L. P. Ferrari", "num_authors": 2, "published_date": "2007-05-04", "days_since_pub": 6567, "updated_date": "2007-11-11", "days_since_update": 6376, "primary_category": "stat.ME", "categories": "stat.ME", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0705.0700v3", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 8.333333333333334, "title_avg_sent_len": 3.0, "title_sentiment": "Neutral", "abstract_word_count": 79, "abstract_word_diversity": 0.7341772151898734, "abstract_avg_word_len": 5.7594936708860756, "abstract_avg_sent_len": 16.0, "abstract_readability": 32.39, "abstract_sentiment": "Positive"}
{"id": "0705.2938v1", "title": "Codage arithmetique pour la description d'une distribution", "abstract": "Using predictive adaptive arithmetic coding and the Minimum Description Length principle, we derive an efficient tool for model selection problems : the RIC information criterion. We then present an extension of these coding techniques to non-parametrical estimation of a distribution and illustrate it on the gray scales histogram of an image.   Key-words : Information criteria, MDL, model selection, non-parametrical estimation, histograms.", "authors": "Guilhem Coq, Olivier Alata, Marc Arnaudon, Christian Olivier", "num_authors": 4, "published_date": "2007-05-21", "days_since_pub": 6550, "updated_date": "2007-05-21", "days_since_update": 6550, "primary_category": "stat.ME", "categories": "stat.ME", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0705.2938v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.142857142857143, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 61, "abstract_word_diversity": 0.7540983606557377, "abstract_avg_word_len": 6.016393442622951, "abstract_avg_sent_len": 23.0, "abstract_readability": 9.18, "abstract_sentiment": "Neutral"}
{"id": "0705.4588v1", "title": "Variable Selection Incorporating Prior Constraint Information into Lasso", "abstract": "We propose the variable selection procedure incorporating prior constraint information into lasso. The proposed procedure combines the sample and prior information, and selects significant variables for responses in a narrower region where the true parameters lie. It increases the efficiency to choose the true model correctly. The proposed procedure can be executed by many constrained quadratic programming methods and the initial estimator can be found by least square or Monte Carlo method. The proposed procedure also enjoys good theoretical properties. Moreover, the proposed procedure is not only used for linear models but also can be used for generalized linear models({\\sl GLM}), Cox models, quantile regression models and many others with the help of Wang and Leng (2007)'s LSA, which changes these models as the approximation of linear models. The idea of combining sample and prior constraint information can be also used for other modified lasso procedures. Some examples are used for illustration of the idea of incorporating prior constraint information in variable selection procedures.", "authors": "Shurong Zheng, Guodong Song, Ning-Zhong Shi", "num_authors": 3, "published_date": "2007-05-31", "days_since_pub": 6540, "updated_date": "2007-05-31", "days_since_update": 6540, "primary_category": "stat.ME", "categories": "stat.ME", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0705.4588v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 8.125, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 163, "abstract_word_diversity": 0.5705521472392638, "abstract_avg_word_len": 5.607361963190184, "abstract_avg_sent_len": 23.125, "abstract_readability": 25.29, "abstract_sentiment": "Optimistic"}
{"id": "0706.1287v1", "title": "Bayesian Covariance Matrix Estimation using a Mixture of Decomposable Graphical Models", "abstract": "A Bayesian approach is used to estimate the covariance matrix of Gaussian data. Ideas from Gaussian graphical models and model selection are used to construct a prior for the covariance matrix that is a mixture over all decomposable graphs. For this prior the probability of each graph size is specified by the user and graphs of equal size are assigned equal probability. Most previous approaches assume that all graphs are equally probable. We show empirically that the prior that assigns equal probability over graph sizes outperforms the prior that assigns equal probability over all graphs, both in identifying the correct decomposable graph and in more efficiently estimating the covariance matrix.", "authors": "Helen Armstrong, Christopher K. Carter, Kevin F. Wong, Robert Kohn", "num_authors": 4, "published_date": "2007-06-09", "days_since_pub": 6531, "updated_date": "2007-06-09", "days_since_update": 6531, "primary_category": "stat.ME", "categories": "stat.ME", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0706.1287v1", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 7.5, "title_avg_sent_len": 11.0, "title_sentiment": "Neutral", "abstract_word_count": 107, "abstract_word_diversity": 0.5420560747663551, "abstract_avg_word_len": 5.4766355140186915, "abstract_avg_sent_len": 23.2, "abstract_readability": 23.77, "abstract_sentiment": "Positive"}
{"id": "0706.1408v1", "title": "Sensitivity of principal Hessian direction analysis", "abstract": "We provide sensitivity comparisons for two competing versions of the dimension reduction method principal Hessian directions (pHd). These comparisons consider the effects of small perturbations on the estimation of the dimension reduction subspace via the influence function. We show that the two versions of pHd can behave completely differently in the presence of certain observational types. Our results also provide evidence that outliers in the traditional sense may or may not be highly influential in practice. Since influential observations may lurk within otherwise typical data, we consider the influence function in the empirical setting for the efficient detection of influential observations in practice.", "authors": "Luke A. Prendergast, Jodie A. Smith", "num_authors": 2, "published_date": "2007-06-11", "days_since_pub": 6529, "updated_date": "2007-06-11", "days_since_update": 6529, "primary_category": "stat.ME", "categories": "stat.ME, 62F35 (Primary) 62H12 (Secondary)", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/0706.1408v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 7.666666666666667, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 103, "abstract_word_diversity": 0.6213592233009708, "abstract_avg_word_len": 5.893203883495145, "abstract_avg_sent_len": 22.2, "abstract_readability": 16.73, "abstract_sentiment": "Cautious"}
{"id": "0706.2912v1", "title": "Statistical testing procedure for the interaction effects of several controllable factors in two-valued input-output systems", "abstract": "Suppose several two-valued input-output systems are designed by setting the levels of several controllable factors. For this situation, Taguchi method has proposed to assign the controllable factors to the orthogonal array and use ANOVA model for the standardized SN ratio, which is a natural measure for evaluating the performance of each input-output system. Though this procedure is simple and useful in application indeed, the result can be unreliable when the estimated standard errors of the standardized SN ratios are unbalanced. In this paper, we treat the data arising from the full factorial or fractional factorial designs of several controllable factors as the frequencies of high-dimensional contingency tables, and propose a general testing procedure for the main effects or the interaction effects of the controllable factors.", "authors": "Satoshi Aoki, Masami Miyakawa", "num_authors": 2, "published_date": "2007-06-20", "days_since_pub": 6520, "updated_date": "2007-06-20", "days_since_update": 6520, "primary_category": "stat.ME", "categories": "stat.ME", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0706.2912v1", "title_word_count": 17, "title_word_diversity": 1.0, "title_avg_word_len": 6.352941176470588, "title_avg_sent_len": 15.0, "title_sentiment": "Neutral", "abstract_word_count": 127, "abstract_word_diversity": 0.6456692913385826, "abstract_avg_word_len": 5.52755905511811, "abstract_avg_sent_len": 33.5, "abstract_readability": 14.33, "abstract_sentiment": "Optimistic"}
{"id": "0706.3435v1", "title": "Undercomplete Blind Subspace Deconvolution via Linear Prediction", "abstract": "We present a novel solution technique for the blind subspace deconvolution (BSSD) problem, where temporal convolution of multidimensional hidden independent components is observed and the task is to uncover the hidden components using the observation only. We carry out this task for the undercomplete case (uBSSD): we reduce the original uBSSD task via linear prediction to independent subspace analysis (ISA), which we can solve. As it has been shown recently, applying temporal concatenation can also reduce uBSSD to ISA, but the associated ISA problem can easily become `high dimensional' [1]. The new reduction method circumvents this dimensionality problem. We perform detailed studies on the efficiency of the proposed technique by means of numerical simulations. We have found several advantages: our method can achieve high quality estimations for smaller number of samples and it can cope with deeper temporal convolutions.", "authors": "Zoltan Szabo, Barnabas Poczos, Andras Lorincz", "num_authors": 3, "published_date": "2007-06-23", "days_since_pub": 6517, "updated_date": "2007-06-23", "days_since_update": 6517, "primary_category": "stat.ME", "categories": "stat.ME", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0706.3435v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 8.285714285714286, "title_avg_sent_len": 7.0, "title_sentiment": "Cautious", "abstract_word_count": 137, "abstract_word_diversity": 0.656934306569343, "abstract_avg_word_len": 5.627737226277373, "abstract_avg_sent_len": 26.833333333333332, "abstract_readability": 14.09, "abstract_sentiment": "Positive"}
{"id": "0706.4190v1", "title": "SiZer for time series: A new approach to the analysis of trends", "abstract": "Smoothing methods and SiZer are a useful statistical tool for discovering statistically significant structure in data. Based on scale space ideas originally developed in the computer vision literature, SiZer (SIgnificant ZERo crossing of the derivatives) is a graphical device to assess which observed features are `really there' and which are just spurious sampling artifacts. In this paper, we develop SiZer like ideas in time series analysis to address the important issue of significance of trends. This is not a straightforward extension, since one data set does not contain the information needed to distinguish `trend' from `dependence'. A new visualization is proposed, which shows the statistician the range of trade-offs that are available. Simulation and real data results illustrate the effectiveness of the method.", "authors": "Vitaliana Rondonotti, J. S. Marron, Cheolwoo Park", "num_authors": 3, "published_date": "2007-06-28", "days_since_pub": 6512, "updated_date": "2007-06-28", "days_since_update": 6512, "primary_category": "stat.ME", "categories": "stat.ME, 62G08 (Primary) 62-09 (Secondary)", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/0706.4190v1", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 4.545454545454546, "title_avg_sent_len": 13.0, "title_sentiment": "Neutral", "abstract_word_count": 120, "abstract_word_diversity": 0.725, "abstract_avg_word_len": 5.683333333333334, "abstract_avg_sent_len": 23.5, "abstract_readability": 25.29, "abstract_sentiment": "Optimistic"}
{"id": "0707.0143v1", "title": "On semiparametric regression with O'Sullivan penalised splines", "abstract": "This is an expos\\'e on the use of O'Sullivan penalised splines in contemporary semiparametric regression, including mixed model and Bayesian formulations. O'Sullivan penalised splines are similar to P-splines, but have an advantage of being a direct generalisation of smoothing splines. Exact expressions for the O'Sullivan penalty matrix are obtained. Comparisons between the two reveals that O'Sullivan penalised splines more closely mimic the natural boundary behaviour of smoothing splines. Implementation in modern computing environments such as Matlab, R and BUGS is discussed.", "authors": "M. P. Wand, J. T. Ormerod", "num_authors": 2, "published_date": "2007-07-02", "days_since_pub": 6508, "updated_date": "2007-07-02", "days_since_update": 6508, "primary_category": "stat.ME", "categories": "stat.ME", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/0707.0143v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.714285714285714, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 79, "abstract_word_diversity": 0.7215189873417721, "abstract_avg_word_len": 6.075949367088608, "abstract_avg_sent_len": 18.2, "abstract_readability": 21.19, "abstract_sentiment": "Neutral"}
{"id": "0707.0246v1", "title": "A new graphical tool of outliers detection in regression models based on recursive estimation", "abstract": "We present in this paper a new tool for outliers detection in the context of multiple regression models. This graphical tool is based on recursive estimation of the parameters. Simulations were carried out to illustrate the performance of this graphical procedure. As a conclusion, this tool is applied to real data containing outliers according to the classical available tools.", "authors": "Christian Paroissin", "num_authors": 1, "published_date": "2007-07-02", "days_since_pub": 6508, "updated_date": "2007-07-02", "days_since_update": 6508, "primary_category": "stat.ME", "categories": "stat.ME, 62J02,62J20,62L1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/0707.0246v1", "title_word_count": 13, "title_word_diversity": 1.0, "title_avg_word_len": 6.076923076923077, "title_avg_sent_len": 14.0, "title_sentiment": "Neutral", "abstract_word_count": 57, "abstract_word_diversity": 0.7192982456140351, "abstract_avg_word_len": 5.508771929824562, "abstract_avg_sent_len": 16.0, "abstract_readability": 39.53, "abstract_sentiment": "Neutral"}
{"id": "cs/9308101v1", "title": "Dynamic Backtracking", "abstract": "Because of their occasional need to return to shallow points in a search tree, existing backtracking methods can sometimes erase meaningful progress toward solving a search problem. In this paper, we present a method by which backtrack points can be moved deeper in the search space, thereby avoiding this difficulty. The technique developed is a variant of dependency-directed backtracking that uses only polynomial space while still providing useful control information and retaining the completeness guarantees provided by earlier approaches.", "authors": "M. L. Ginsberg", "num_authors": 1, "published_date": "1993-08-01", "days_since_pub": 11591, "updated_date": "1993-08-01", "days_since_update": 11591, "primary_category": "cs.AI", "categories": "cs.AI", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/cs/9308101v1", "title_word_count": 2, "title_word_diversity": 1.0, "title_avg_word_len": 9.5, "title_avg_sent_len": 2.0, "title_sentiment": "Positive", "abstract_word_count": 76, "abstract_word_diversity": 0.8157894736842105, "abstract_avg_word_len": 6.0, "abstract_avg_sent_len": 28.333333333333332, "abstract_readability": 19.4, "abstract_sentiment": "Positive"}
{"id": "cs/9308102v1", "title": "A Market-Oriented Programming Environment and its Application to Distributed Multicommodity Flow Problems", "abstract": "Market price systems constitute a well-understood class of mechanisms that under certain conditions provide effective decentralization of decision making with minimal communication overhead. In a market-oriented programming approach to distributed problem solving, we derive the activities and resource allocations for a set of computational agents by computing the competitive equilibrium of an artificial economy. WALRAS provides basic constructs for defining computational market structures, and protocols for deriving their corresponding price equilibria. In a particular realization of this approach for a form of multicommodity flow problem, we see that careful construction of the decision process according to economic principles can lead to efficient distributed resource allocation, and that the behavior of the system can be meaningfully analyzed in economic terms.", "authors": "M. P. Wellman", "num_authors": 1, "published_date": "1993-08-01", "days_since_pub": 11591, "updated_date": "1993-08-01", "days_since_update": 11591, "primary_category": "cs.AI", "categories": "cs.AI", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/cs/9308102v1", "title_word_count": 12, "title_word_diversity": 1.0, "title_avg_word_len": 7.666666666666667, "title_avg_sent_len": 12.0, "title_sentiment": "Cautious", "abstract_word_count": 116, "abstract_word_diversity": 0.7068965517241379, "abstract_avg_word_len": 6.405172413793103, "abstract_avg_sent_len": 31.75, "abstract_readability": -9.54, "abstract_sentiment": "Optimistic"}
{"id": "cs/9309101v1", "title": "An Empirical Analysis of Search in GSAT", "abstract": "We describe an extensive study of search in GSAT, an approximation procedure for propositional satisfiability. GSAT performs greedy hill-climbing on the number of satisfied clauses in a truth assignment. Our experiments provide a more complete picture of GSAT's search than previous accounts. We describe in detail the two phases of search: rapid hill-climbing followed by a long plateau search. We demonstrate that when applied to randomly generated 3SAT problems, there is a very simple scaling with problem size for both the mean number of satisfied clauses and the mean branching rate. Our results allow us to make detailed numerical conjectures about the length of the hill-climbing phase, the average gradient of this phase, and to conjecture that both the average score and average branching rate decay exponentially during plateau search. We end by showing how these results can be used to direct future theoretical analysis. This work provides a case study of how computer experiments can be used to improve understanding of the theoretical properties of algorithms.", "authors": "I. P. Gent, T. Walsh", "num_authors": 2, "published_date": "1993-09-01", "days_since_pub": 11560, "updated_date": "1993-09-01", "days_since_update": 11560, "primary_category": "cs.AI", "categories": "cs.AI", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/cs/9309101v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 4.714285714285714, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 164, "abstract_word_diversity": 0.6097560975609756, "abstract_avg_word_len": 5.378048780487805, "abstract_avg_sent_len": 22.625, "abstract_readability": 33.34, "abstract_sentiment": "Positive"}
{"id": "cs/9311101v1", "title": "The Difficulties of Learning Logic Programs with Cut", "abstract": "As real logic programmers normally use cut (!), an effective learning procedure for logic programs should be able to deal with it. Because the cut predicate has only a procedural meaning, clauses containing cut cannot be learned using an extensional evaluation method, as is done in most learning systems. On the other hand, searching a space of possible programs (instead of a space of independent clauses) is unfeasible. An alternative solution is to generate first a candidate base program which covers the positive examples, and then make it consistent by inserting cut where appropriate. The problem of learning programs with cut has not been investigated before and this seems to be a natural and reasonable approach. We generalize this scheme and investigate the difficulties that arise. Some of the major shortcomings are actually caused, in general, by the need for intensional evaluation. As a conclusion, the analysis of this paper suggests, on precise and technical grounds, that learning cut is difficult, and current induction techniques should probably be restricted to purely declarative logic languages.", "authors": "F. Bergadano, D. Gunetti, U. Trinchero", "num_authors": 3, "published_date": "1993-11-01", "days_since_pub": 11499, "updated_date": "1993-11-01", "days_since_update": 11499, "primary_category": "cs.AI", "categories": "cs.AI", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/cs/9311101v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 5.625, "title_avg_sent_len": 8.0, "title_sentiment": "Cautious", "abstract_word_count": 167, "abstract_word_diversity": 0.6646706586826348, "abstract_avg_word_len": 5.491017964071856, "abstract_avg_sent_len": 22.0, "abstract_readability": 35.07, "abstract_sentiment": "Negative"}
{"id": "cs/9311102v1", "title": "Software Agents: Completing Patterns and Constructing User Interfaces", "abstract": "To support the goal of allowing users to record and retrieve information, this paper describes an interactive note-taking system for pen-based computers with two distinctive features. First, it actively predicts what the user is going to write. Second, it automatically constructs a custom, button-box user interface on request. The system is an example of a learning-apprentice software- agent. A machine learning component characterizes the syntax and semantics of the user's information. A performance system uses this learned information to generate completion strings and construct a user interface. Description of Online Appendix: People like to record information. Doing this on paper is initially efficient, but lacks flexibility. Recording information on a computer is less efficient but more powerful. In our new note taking softwre, the user records information directly on a computer. Behind the interface, an agent acts for the user. To help, it provides defaults and constructs a custom user interface. The demonstration is a QuickTime movie of the note taking agent in action. The file is a binhexed self-extracting archive. Macintosh utilities for binhex are available from mac.archive.umich.edu. QuickTime is available from ftp.apple.com in the dts/mac/sys.soft/quicktime.", "authors": "J. C. Schlimmer, L. A. Hermens", "num_authors": 2, "published_date": "1993-11-01", "days_since_pub": 11499, "updated_date": "1993-11-01", "days_since_update": 11499, "primary_category": "cs.AI", "categories": "cs.AI", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/cs/9311102v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.625, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 191, "abstract_word_diversity": 0.5916230366492147, "abstract_avg_word_len": 5.50261780104712, "abstract_avg_sent_len": 13.3125, "abstract_readability": 34.93, "abstract_sentiment": "Optimistic"}
{"id": "cs/9312101v1", "title": "Decidable Reasoning in Terminological Knowledge Representation Systems", "abstract": "Terminological knowledge representation systems (TKRSs) are tools for designing and using knowledge bases that make use of terminological languages (or concept languages). We analyze from a theoretical point of view a TKRS whose capabilities go beyond the ones of presently available TKRSs. The new features studied, often required in practical applications, can be summarized in three main points. First, we consider a highly expressive terminological language, called ALCNR, including general complements of concepts, number restrictions and role conjunction. Second, we allow to express inclusion statements between general concepts, and terminological cycles as a particular case. Third, we prove the decidability of a number of desirable TKRS-deduction services (like satisfiability, subsumption and instance checking) through a sound, complete and terminating calculus for reasoning in ALCNR-knowledge bases. Our calculus extends the general technique of constraint systems. As a byproduct of the proof, we get also the result that inclusion statements in ALCNR can be simulated by terminological cycles, if descriptive semantics is adopted.", "authors": "M. Buchheit, F. M. Donini, A. Schaerf", "num_authors": 3, "published_date": "1993-12-01", "days_since_pub": 11469, "updated_date": "1993-12-01", "days_since_update": 11469, "primary_category": "cs.AI", "categories": "cs.AI", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/cs/9312101v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 9.142857142857142, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 156, "abstract_word_diversity": 0.6858974358974359, "abstract_avg_word_len": 6.096153846153846, "abstract_avg_sent_len": 23.5, "abstract_readability": 17.23, "abstract_sentiment": "Optimistic"}
{"id": "cs/9401101v1", "title": "Teleo-Reactive Programs for Agent Control", "abstract": "A formalism is presented for computing and organizing actions for autonomous agents in dynamic environments. We introduce the notion of teleo-reactive (T-R) programs whose execution entails the construction of circuitry for the continuous computation of the parameters and conditions on which agent action is based. In addition to continuous feedback, T-R programs support parameter binding and recursion. A primary difference between T-R programs and many other circuit-based systems is that the circuitry of T-R programs is more compact; it is constructed at run time and thus does not have to anticipate all the contingencies that might arise over all possible runs. In addition, T-R programs are intuitive and easy to write and are written in a form that is compatible with automatic planning and learning methods. We briefly describe some experimental applications of T-R programs in the control of simulated and actual mobile robots.", "authors": "N. Nilsson", "num_authors": 1, "published_date": "1994-01-01", "days_since_pub": 11438, "updated_date": "1994-01-01", "days_since_update": 11438, "primary_category": "cs.AI", "categories": "cs.AI", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/cs/9401101v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 6.0, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 137, "abstract_word_diversity": 0.6642335766423357, "abstract_avg_word_len": 5.562043795620438, "abstract_avg_sent_len": 25.833333333333332, "abstract_readability": 21.74, "abstract_sentiment": "Optimistic"}
{"id": "cs/9402101v1", "title": "Learning the Past Tense of English Verbs: The Symbolic Pattern Associator vs. Connectionist Models", "abstract": "Learning the past tense of English verbs - a seemingly minor aspect of language acquisition - has generated heated debates since 1986, and has become a landmark task for testing the adequacy of cognitive modeling. Several artificial neural networks (ANNs) have been implemented, and a challenge for better symbolic models has been posed. In this paper, we present a general-purpose Symbolic Pattern Associator (SPA) based upon the decision-tree learning algorithm ID3. We conduct extensive head-to-head comparisons on the generalization ability between ANN models and the SPA under different representations. We conclude that the SPA generalizes the past tense of unseen verbs better than ANN models by a wide margin, and we offer insights as to why this should be the case. We also discuss a new default strategy for decision-tree learning algorithms.", "authors": "C. X. Ling", "num_authors": 1, "published_date": "1994-02-01", "days_since_pub": 11407, "updated_date": "1994-02-01", "days_since_update": 11407, "primary_category": "cs.AI", "categories": "cs.AI", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/cs/9402101v1", "title_word_count": 14, "title_word_diversity": 0.9285714285714286, "title_avg_word_len": 5.928571428571429, "title_avg_sent_len": 15.0, "title_sentiment": "Cautious", "abstract_word_count": 127, "abstract_word_diversity": 0.6929133858267716, "abstract_avg_word_len": 5.409448818897638, "abstract_avg_sent_len": 24.333333333333332, "abstract_readability": 32.53, "abstract_sentiment": "Positive"}
{"id": "cs/9402102v1", "title": "Substructure Discovery Using Minimum Description Length and Background Knowledge", "abstract": "The ability to identify interesting and repetitive substructures is an essential component to discovering knowledge in structural data. We describe a new version of our SUBDUE substructure discovery system based on the minimum description length principle. The SUBDUE system discovers substructures that compress the original data and represent structural concepts in the data. By replacing previously-discovered substructures in the data, multiple passes of SUBDUE produce a hierarchical description of the structural regularities in the data. SUBDUE uses a computationally-bounded inexact graph match that identifies similar, but not identical, instances of a substructure and finds an approximate measure of closeness of two substructures when under computational constraints. In addition to the minimum description length principle, other background knowledge can be used by SUBDUE to guide the search towards more appropriate substructures. Experiments in a variety of domains demonstrate SUBDUE's ability to find substructures capable of compressing the original data and to discover structural concepts important to the domain. Description of Online Appendix: This is a compressed tar file containing the SUBDUE discovery system, written in C. The program accepts as input databases represented in graph form, and will output discovered substructures with their corresponding value.", "authors": "D. J. Cook, L. B. Holder", "num_authors": 2, "published_date": "1994-02-01", "days_since_pub": 11407, "updated_date": "1994-02-01", "days_since_update": 11407, "primary_category": "cs.AI", "categories": "cs.AI", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/cs/9402102v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 8.0, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 189, "abstract_word_diversity": 0.5873015873015873, "abstract_avg_word_len": 6.185185185185185, "abstract_avg_sent_len": 26.25, "abstract_readability": 15.71, "abstract_sentiment": "Optimistic"}
{"id": "cs/9402103v1", "title": "Bias-Driven Revision of Logical Domain Theories", "abstract": "The theory revision problem is the problem of how best to go about revising a deficient domain theory using information contained in examples that expose inaccuracies. In this paper we present our approach to the theory revision problem for propositional domain theories. The approach described here, called PTR, uses probabilities associated with domain theory elements to numerically track the ``flow'' of proof through the theory. This allows us to measure the precise role of a clause or literal in allowing or preventing a (desired or undesired) derivation for a given example. This information is used to efficiently locate and repair flawed elements of the theory. PTR is proved to converge to a theory which correctly classifies all examples, and shown experimentally to be fast and accurate even for deep theories.", "authors": "M. Koppel, R. Feldman, A. M. Segre", "num_authors": 3, "published_date": "1994-02-01", "days_since_pub": 11407, "updated_date": "1994-02-01", "days_since_update": 11407, "primary_category": "cs.AI", "categories": "cs.AI", "n_categories": 1, "pdf_url": "http://arxiv.org/pdf/cs/9402103v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 5.857142857142857, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 125, "abstract_word_diversity": 0.632, "abstract_avg_word_len": 5.392, "abstract_avg_sent_len": 23.833333333333332, "abstract_readability": 32.53, "abstract_sentiment": "Cautious"}
{"id": "cs/9905014v1", "title": "Hierarchical Reinforcement Learning with the MAXQ Value Function Decomposition", "abstract": "This paper presents the MAXQ approach to hierarchical reinforcement learning based on decomposing the target Markov decision process (MDP) into a hierarchy of smaller MDPs and decomposing the value function of the target MDP into an additive combination of the value functions of the smaller MDPs. The paper defines the MAXQ hierarchy, proves formal results on its representational power, and establishes five conditions for the safe use of state abstractions. The paper presents an online model-free learning algorithm, MAXQ-Q, and proves that it converges wih probability 1 to a kind of locally-optimal policy known as a recursively optimal policy, even in the presence of the five kinds of state abstraction. The paper evaluates the MAXQ representation and MAXQ-Q through a series of experiments in three domains and shows experimentally that MAXQ-Q (with state abstractions) converges to a recursively optimal policy much faster than flat Q learning. The fact that MAXQ learns a representation of the value function has an important benefit: it makes it possible to compute and execute an improved, non-hierarchical policy via a procedure similar to the policy improvement step of policy iteration. The paper demonstrates the effectiveness of this non-hierarchical execution experimentally. Finally, the paper concludes with a comparison to related work and a discussion of the design tradeoffs in hierarchical reinforcement learning.", "authors": "Thomas G. Dietterich", "num_authors": 1, "published_date": "1999-05-21", "days_since_pub": 9472, "updated_date": "1999-05-21", "days_since_update": 9472, "primary_category": "cs.LG", "categories": "cs.LG, I.2.6", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9905014v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 7.777777777777778, "title_avg_sent_len": 9.0, "title_sentiment": "Positive", "abstract_word_count": 209, "abstract_word_diversity": 0.5167464114832536, "abstract_avg_word_len": 5.660287081339713, "abstract_avg_sent_len": 33.57142857142857, "abstract_readability": 14.73, "abstract_sentiment": "Optimistic"}
{"id": "cs/9905015v1", "title": "State Abstraction in MAXQ Hierarchical Reinforcement Learning", "abstract": "Many researchers have explored methods for hierarchical reinforcement learning (RL) with temporal abstractions, in which abstract actions are defined that can perform many primitive actions before terminating. However, little is known about learning with state abstractions, in which aspects of the state space are ignored. In previous work, we developed the MAXQ method for hierarchical RL. In this paper, we define five conditions under which state abstraction can be combined with the MAXQ value function decomposition. We prove that the MAXQ-Q learning algorithm converges under these conditions and show experimentally that state abstraction is important for the successful application of MAXQ-Q learning.", "authors": "Thomas G. Dietterich", "num_authors": 1, "published_date": "1999-05-21", "days_since_pub": 9472, "updated_date": "1999-05-21", "days_since_update": 9472, "primary_category": "cs.LG", "categories": "cs.LG, I.2.6", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9905015v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.857142857142857, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 102, "abstract_word_diversity": 0.6274509803921569, "abstract_avg_word_len": 5.813725490196078, "abstract_avg_sent_len": 22.8, "abstract_readability": 33.85, "abstract_sentiment": "Optimistic"}
{"id": "cs/0001004v1", "title": "Multiplicative Algorithm for Orthgonal Groups and Independent Component Analysis", "abstract": "The multiplicative Newton-like method developed by the author et al. is extended to the situation where the dynamics is restricted to the orthogonal group. A general framework is constructed without specifying the cost function. Though the restriction to the orthogonal groups makes the problem somewhat complicated, an explicit expression for the amount of individual jumps is obtained. This algorithm is exactly second-order-convergent. The global instability inherent in the Newton method is remedied by a Levenberg-Marquardt-type variation. The method thus constructed can readily be applied to the independent component analysis. Its remarkable performance is illustrated by a numerical simulation.", "authors": "Toshinao Akuzawa", "num_authors": 1, "published_date": "2000-01-07", "days_since_pub": 9241, "updated_date": "2000-01-07", "days_since_update": 9241, "primary_category": "cs.LG", "categories": "cs.LG, G.1.6", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0001004v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 8.0, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 100, "abstract_word_diversity": 0.71, "abstract_avg_word_len": 5.89, "abstract_avg_sent_len": 13.375, "abstract_readability": 16.69, "abstract_sentiment": "Neutral"}
{"id": "cs/0002006v1", "title": "Multiplicative Nonholonomic/Newton -like Algorithm", "abstract": "We construct new algorithms from scratch, which use the fourth order cumulant of stochastic variables for the cost function. The multiplicative updating rule here constructed is natural from the homogeneous nature of the Lie group and has numerous merits for the rigorous treatment of the dynamics. As one consequence, the second order convergence is shown. For the cost function, functions invariant under the componentwise scaling are choosen. By identifying points which can be transformed to each other by the scaling, we assume that the dynamics is in a coset space. In our method, a point can move toward any direction in this coset. Thus, no prewhitening is required.", "authors": "Toshinao Akuzawa, Noboru Murata", "num_authors": 2, "published_date": "2000-02-09", "days_since_pub": 9208, "updated_date": "2000-02-09", "days_since_update": 9208, "primary_category": "cs.LG", "categories": "cs.LG, G.1.6", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0002006v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 9.0, "title_avg_sent_len": 4.0, "title_sentiment": "Positive", "abstract_word_count": 106, "abstract_word_diversity": 0.7075471698113207, "abstract_avg_word_len": 5.2075471698113205, "abstract_avg_sent_len": 17.285714285714285, "abstract_readability": 55.84, "abstract_sentiment": "Optimistic"}
{"id": "cs/0009001v3", "title": "Complexity analysis for algorithmically simple strings", "abstract": "Given a reference computer, Kolmogorov complexity is a well defined function on all binary strings. In the standard approach, however, only the asymptotic properties of such functions are considered because they do not depend on the reference computer. We argue that this approach can be more useful if it is refined to include an important practical case of simple binary strings. Kolmogorov complexity calculus may be developed for this case if we restrict the class of available reference computers. The interesting problem is to define a class of computers which is restricted in a {\\it natural} way modeling the real-life situation where only a limited class of computers is physically available to us. We give an example of what such a natural restriction might look like mathematically, and show that under such restrictions some error terms, even logarithmic in complexity, can disappear from the standard complexity calculus.   Keywords: Kolmogorov complexity; Algorithmic information theory.", "authors": "Andrei N. Soklakov", "num_authors": 1, "published_date": "2000-09-05", "days_since_pub": 8999, "updated_date": "2002-02-26", "days_since_update": 8460, "primary_category": "cs.LG", "categories": "cs.LG, E.4; F.2; I.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0009001v3", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 8.166666666666666, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 148, "abstract_word_diversity": 0.6418918918918919, "abstract_avg_word_len": 5.554054054054054, "abstract_avg_sent_len": 24.285714285714285, "abstract_readability": 23.87, "abstract_sentiment": "Cautious"}
{"id": "cs/0009007v1", "title": "Robust Classification for Imprecise Environments", "abstract": "In real-world environments it usually is difficult to specify target operating conditions precisely, for example, target misclassification costs. This uncertainty makes building robust classification systems problematic. We show that it is possible to build a hybrid classifier that will perform at least as well as the best available classifier for any target conditions. In some cases, the performance of the hybrid actually can surpass that of the best known classifier. This robust performance extends across a wide variety of comparison frameworks, including the optimization of metrics such as accuracy, expected cost, lift, precision, recall, and workforce utilization. The hybrid also is efficient to build, to store, and to update. The hybrid is based on a method for the comparison of classifier performance that is robust to imprecise class distributions and misclassification costs. The ROC convex hull (ROCCH) method combines techniques from ROC analysis, decision analysis and computational geometry, and adapts them to the particulars of analyzing learned classifiers. The method is efficient and incremental, minimizes the management of classifier performance data, and allows for clear visual comparisons and sensitivity analyses. Finally, we point to empirical evidence that a robust hybrid classifier indeed is needed for many real-world problems.", "authors": "Foster Provost, Tom Fawcett", "num_authors": 2, "published_date": "2000-09-13", "days_since_pub": 8991, "updated_date": "2000-09-13", "days_since_update": 8991, "primary_category": "cs.LG", "categories": "cs.LG, I.2.6", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0009007v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 8.8, "title_avg_sent_len": 5.0, "title_sentiment": "Positive", "abstract_word_count": 196, "abstract_word_diversity": 0.5867346938775511, "abstract_avg_word_len": 5.790816326530612, "abstract_avg_sent_len": 22.6, "abstract_readability": 17.54, "abstract_sentiment": "Optimistic"}
{"id": "cs/0011032v1", "title": "Top-down induction of clustering trees", "abstract": "An approach to clustering is presented that adapts the basic top-down induction of decision trees method towards clustering. To this aim, it employs the principles of instance based learning. The resulting methodology is implemented in the TIC (Top down Induction of Clustering trees) system for first order clustering. The TIC system employs the first order logical decision tree representation of the inductive logic programming system Tilde. Various experiments with TIC are presented, in both propositional and relational domains.", "authors": "Hendrik Blockeel, Luc De Raedt, Jan Ramon", "num_authors": 3, "published_date": "2000-11-21", "days_since_pub": 8922, "updated_date": "2000-11-21", "days_since_update": 8922, "primary_category": "cs.LG", "categories": "cs.LG, I.2.6", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0011032v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 5.5, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 79, "abstract_word_diversity": 0.6455696202531646, "abstract_avg_word_len": 5.658227848101266, "abstract_avg_sent_len": 17.4, "abstract_readability": 30.26, "abstract_sentiment": "Neutral"}
{"id": "cs/0011044v1", "title": "Scaling Up Inductive Logic Programming by Learning from Interpretations", "abstract": "When comparing inductive logic programming (ILP) and attribute-value learning techniques, there is a trade-off between expressive power and efficiency. Inductive logic programming techniques are typically more expressive but also less efficient. Therefore, the data sets handled by current inductive logic programming systems are small according to general standards within the data mining community. The main source of inefficiency lies in the assumption that several examples may be related to each other, so they cannot be handled independently.   Within the learning from interpretations framework for inductive logic programming this assumption is unnecessary, which allows to scale up existing ILP algorithms. In this paper we explain this learning setting in the context of relational databases. We relate the setting to propositional data mining and to the classical ILP setting, and show that learning from interpretations corresponds to learning from multiple relations and thus extends the expressiveness of propositional learning, while maintaining its efficiency to a large extent (which is not the case in the classical ILP setting).   As a case study, we present two alternative implementations of the ILP system Tilde (Top-down Induction of Logical DEcision trees): Tilde-classic, which loads all data in main memory, and Tilde-LDS, which loads the examples one by one. We experimentally compare the implementations, showing Tilde-LDS can handle large data sets (in the order of 100,000 examples or 100 MB) and indeed scales up linearly in the number of examples.", "authors": "Hendrik Blockeel, Luc De Raedt, Nico Jacobs, Bart Demoen", "num_authors": 4, "published_date": "2000-11-29", "days_since_pub": 8914, "updated_date": "2000-11-29", "days_since_update": 8914, "primary_category": "cs.LG", "categories": "cs.LG, I.2.6 ; I.2.3", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0011044v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 234, "abstract_word_diversity": 0.5512820512820513, "abstract_avg_word_len": 5.534188034188034, "abstract_avg_sent_len": 29.22222222222222, "abstract_readability": 28.27, "abstract_sentiment": "Optimistic"}
{"id": "cs/0103003v1", "title": "Learning Policies with External Memory", "abstract": "In order for an agent to perform well in partially observable domains, it is usually necessary for actions to depend on the history of observations. In this paper, we explore a {\\it stigmergic} approach, in which the agent's actions include the ability to set and clear bits in an external memory, and the external memory is included as part of the input to the agent. In this case, we need to learn a reactive policy in a highly non-Markovian domain. We explore two algorithms: SARSA(\\lambda), which has had empirical success in partially observable domains, and VAPS, a new algorithm due to Baird and Moore, with convergence guarantees in partially observable domains. We compare the performance of these two algorithms on benchmark problems.", "authors": "Leonid Peshkin, Nicolas Meuleau, Leslie Kaelbling", "num_authors": 3, "published_date": "2001-03-02", "days_since_pub": 8821, "updated_date": "2001-03-02", "days_since_update": 8821, "primary_category": "cs.LG", "categories": "cs.LG, I.2.8;I.2.6;I.2.11;I.2;I.2.3", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0103003v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 6.8, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 120, "abstract_word_diversity": 0.6, "abstract_avg_word_len": 4.958333333333333, "abstract_avg_sent_len": 28.6, "abstract_readability": 38.25, "abstract_sentiment": "Optimistic"}
{"id": "cs/0110036v1", "title": "Efficient algorithms for decision tree cross-validation", "abstract": "Cross-validation is a useful and generally applicable technique often employed in machine learning, including decision tree induction. An important disadvantage of straightforward implementation of the technique is its computational overhead. In this paper we show that, for decision trees, the computational overhead of cross-validation can be reduced significantly by integrating the cross-validation with the normal decision tree induction process. We discuss how existing decision tree algorithms can be adapted to this aim, and provide an analysis of the speedups these adaptations may yield. The analysis is supported by experimental results.", "authors": "Hendrik Blockeel, Jan Struyf", "num_authors": 2, "published_date": "2001-10-17", "days_since_pub": 8592, "updated_date": "2001-10-17", "days_since_update": 8592, "primary_category": "cs.LG", "categories": "cs.LG, I.2.6", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0110036v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 6.0, "title_sentiment": "Positive", "abstract_word_count": 92, "abstract_word_diversity": 0.6521739130434783, "abstract_avg_word_len": 5.934782608695652, "abstract_avg_sent_len": 19.8, "abstract_readability": 10.91, "abstract_sentiment": "Positive"}
{"id": "cs/9808008v1", "title": "Computational Geometry Column 34", "abstract": "Problems presented at the open-problem session of the 14th Annual ACM Symposium on Computational Geometry are listed.", "authors": "Pankaj K. Agarwal, Joseph O'Rourke", "num_authors": 2, "published_date": "1998-08-31", "days_since_pub": 9735, "updated_date": "1998-08-31", "days_since_update": 9735, "primary_category": "cs.CG", "categories": "cs.CG, F.2.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9808008v1", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 9.0, "title_avg_sent_len": 4.0, "title_sentiment": "Neutral", "abstract_word_count": 17, "abstract_word_diversity": 0.9411764705882353, "abstract_avg_word_len": 5.588235294117647, "abstract_avg_sent_len": 18.0, "abstract_readability": 3.46, "abstract_sentiment": "Cautious"}
{"id": "cs/9809038v2", "title": "Incremental and Decremental Maintenance of Planar Width", "abstract": "We present an algorithm for maintaining the width of a planar point set dynamically, as points are inserted or deleted. Our algorithm takes time O(kn^epsilon) per update, where k is the amount of change the update causes in the convex hull, n is the number of points in the set, and epsilon is any arbitrarily small constant. For incremental or decremental update sequences, the amortized time per update is O(n^epsilon).", "authors": "David Eppstein", "num_authors": 1, "published_date": "1998-09-21", "days_since_pub": 9714, "updated_date": "2000-05-04", "days_since_update": 9123, "primary_category": "cs.CG", "categories": "cs.CG, F.2.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809038v2", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.0, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 68, "abstract_word_diversity": 0.6470588235294118, "abstract_avg_word_len": 4.882352941176471, "abstract_avg_sent_len": 28.0, "abstract_readability": 47.83, "abstract_sentiment": "Positive"}
{"id": "cs/9809081v1", "title": "Optimal Point Placement for Mesh Smoothing", "abstract": "We study the problem of moving a vertex in an unstructured mesh of triangular, quadrilateral, or tetrahedral elements to optimize the shapes of adjacent elements. We show that many such problems can be solved in linear time using generalized linear programming. We also give efficient algorithms for some mesh smoothing problems that do not fit into the generalized linear programming paradigm.", "authors": "Nina Amenta, Marshall Bern, David Eppstein", "num_authors": 3, "published_date": "1998-09-24", "days_since_pub": 9711, "updated_date": "1998-09-24", "days_since_update": 9711, "primary_category": "cs.CG", "categories": "cs.CG, F.2.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809081v1", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 6.166666666666667, "title_avg_sent_len": 6.0, "title_sentiment": "Positive", "abstract_word_count": 60, "abstract_word_diversity": 0.75, "abstract_avg_word_len": 5.466666666666667, "abstract_avg_sent_len": 22.0, "abstract_readability": 25.49, "abstract_sentiment": "Cautious"}
{"id": "cs/9809109v1", "title": "Linear Complexity Hexahedral Mesh Generation", "abstract": "We show that any polyhedron forming a topological ball with an even number of quadrilateral sides can be partitioned into O(n) topological cubes, meeting face to face. The result generalizes to non-simply-connected polyhedra satisfying an additional bipartiteness condition. The same techniques can also be used to reduce the geometric version of the hexahedral mesh generation problem to a finite case analysis amenable to machine solution.", "authors": "David Eppstein", "num_authors": 1, "published_date": "1998-09-26", "days_since_pub": 9709, "updated_date": "1998-09-26", "days_since_update": 9709, "primary_category": "cs.CG", "categories": "cs.CG, F.2.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809109v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 8.0, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 64, "abstract_word_diversity": 0.796875, "abstract_avg_word_len": 5.703125, "abstract_avg_sent_len": 24.0, "abstract_readability": 15.61, "abstract_sentiment": "Positive"}
{"id": "cs/9810007v2", "title": "Randomization yields simple O(n log star n) algorithms for difficult Omega(n) problems", "abstract": "We use here the results on the influence graph by Boissonnat et al. to adapt them for particular cases where additional information is available. In some cases, it is possible to improve the expected randomized complexity of algorithms from O(n log n) to O(n log star n).   This technique applies in the following applications: triangulation of a simple polygon, skeleton of a simple polygon, Delaunay triangulation of points knowing the EMST (euclidean minimum spanning tree).", "authors": "Olivier Devillers", "num_authors": 1, "published_date": "1998-10-07", "days_since_pub": 9698, "updated_date": "1998-10-08", "days_since_update": 9697, "primary_category": "cs.CG", "categories": "cs.CG, F.2.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9810007v2", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 6.7, "title_avg_sent_len": 18.0, "title_sentiment": "Negative", "abstract_word_count": 69, "abstract_word_diversity": 0.7681159420289855, "abstract_avg_word_len": 5.492753623188406, "abstract_avg_sent_len": 22.75, "abstract_readability": 35.47, "abstract_sentiment": "Positive"}
{"id": "cs/9901013v1", "title": "Analysis of approximate nearest neighbor searching with clustered point sets", "abstract": "We present an empirical analysis of data structures for approximate nearest neighbor searching. We compare the well-known optimized kd-tree splitting method against two alternative splitting methods. The first, called the sliding-midpoint method, which attempts to balance the goals of producing subdivision cells of bounded aspect ratio, while not producing any empty cells. The second, called the minimum-ambiguity method is a query-based approach. In addition to the data points, it is also given a training set of query points for preprocessing. It employs a simple greedy algorithm to select the splitting plane that minimizes the average amount of ambiguity in the choice of the nearest neighbor for the training points. We provide an empirical analysis comparing these two methods against the optimized kd-tree construction for a number of synthetically generated data and query sets. We demonstrate that for clustered data and query sets, these algorithms can provide significant improvements over the standard kd-tree construction for approximate nearest neighbor searching.", "authors": "Songrit Maneewongvatana, David M. Mount", "num_authors": 2, "published_date": "1999-01-26", "days_since_pub": 9587, "updated_date": "1999-01-26", "days_since_update": 9587, "primary_category": "cs.CG", "categories": "cs.CG, E.1; F.2.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9901013v1", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 6.7, "title_avg_sent_len": 10.0, "title_sentiment": "Neutral", "abstract_word_count": 161, "abstract_word_diversity": 0.5527950310559007, "abstract_avg_word_len": 5.596273291925466, "abstract_avg_sent_len": 21.5, "abstract_readability": 26.0, "abstract_sentiment": "Optimistic"}
{"id": "cs/9906023v1", "title": "Computational Geometry Column 35", "abstract": "The subquadratic algorithm of Kapoor for finding shortest paths on a polyhedron is described.", "authors": "Joseph O'Rourke", "num_authors": 1, "published_date": "1999-06-22", "days_since_pub": 9440, "updated_date": "1999-06-22", "days_since_update": 9440, "primary_category": "cs.CG", "categories": "cs.CG, F.2.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9906023v1", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 9.0, "title_avg_sent_len": 4.0, "title_sentiment": "Neutral", "abstract_word_count": 13, "abstract_word_diversity": 1.0, "abstract_avg_word_len": 6.0, "abstract_avg_sent_len": 15.0, "abstract_readability": 31.89, "abstract_sentiment": "Neutral"}
{"id": "cs/9907023v1", "title": "On Deletion in Delaunay Triangulation", "abstract": "This paper presents how the space of spheres and shelling may be used to delete a point from a $d$-dimensional triangulation efficiently. In dimension two, if k is the degree of the deleted vertex, the complexity is O(k log k), but we notice that this number only applies to low cost operations, while time consuming computations are only done a linear number of times.   This algorithm may be viewed as a variation of Heller's algorithm, which is popular in the geographic information system community. Unfortunately, Heller algorithm is false, as explained in this paper.", "authors": "Olivier Devillers", "num_authors": 1, "published_date": "1999-07-16", "days_since_pub": 9416, "updated_date": "1999-07-16", "days_since_update": 9416, "primary_category": "cs.CG", "categories": "cs.CG, F.2.2; I.3.5", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9907023v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 6.6, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 87, "abstract_word_diversity": 0.7126436781609196, "abstract_avg_word_len": 5.183908045977011, "abstract_avg_sent_len": 28.0, "abstract_readability": 30.7, "abstract_sentiment": "Positive"}
{"id": "cs/9907024v1", "title": "Improved Incremental Randomized Delaunay Triangulation", "abstract": "We propose a new data structure to compute the Delaunay triangulation of a set of points in the plane. It combines good worst case complexity, fast behavior on real data, and small memory occupation.   The location structure is organized into several levels. The lowest level just consists of the triangulation, then each level contains the triangulation of a small sample of the levels below. Point location is done by marching in a triangulation to determine the nearest neighbor of the query at that level, then the march restarts from that neighbor at the level below. Using a small sample (3%) allows a small memory occupation; the march and the use of the nearest neighbor to change levels quickly locate the query.", "authors": "Olivier Devillers", "num_authors": 1, "published_date": "1999-07-16", "days_since_pub": 9416, "updated_date": "1999-07-16", "days_since_update": 9416, "primary_category": "cs.CG", "categories": "cs.CG, F.2.2; I.3.5", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9907024v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 10.0, "title_avg_sent_len": 5.0, "title_sentiment": "Positive", "abstract_word_count": 114, "abstract_word_diversity": 0.5526315789473685, "abstract_avg_word_len": 5.0701754385964914, "abstract_avg_sent_len": 22.5, "abstract_readability": 50.97, "abstract_sentiment": "Cautious"}
{"id": "cs/9907025v1", "title": "The union of unit balls has quadratic complexity, even if they all contain the origin", "abstract": "We provide a lower bound construction showing that the union of unit balls in three-dimensional space has quadratic complexity, even if they all contain the origin. This settles a conjecture of Sharir.", "authors": "Herve Bronnimann, Olivier Devillers", "num_authors": 2, "published_date": "1999-07-16", "days_since_pub": 9416, "updated_date": "1999-07-16", "days_since_update": 9416, "primary_category": "cs.CG", "categories": "cs.CG, F.2.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9907025v1", "title_word_count": 15, "title_word_diversity": 0.9333333333333333, "title_avg_word_len": 4.666666666666667, "title_avg_sent_len": 16.0, "title_sentiment": "Neutral", "abstract_word_count": 31, "abstract_word_diversity": 0.9354838709677419, "abstract_avg_word_len": 5.290322580645161, "abstract_avg_sent_len": 17.5, "abstract_readability": 38.32, "abstract_sentiment": "Cautious"}
{"id": "cs/9809020v1", "title": "Linear Segmentation and Segment Significance", "abstract": "We present a new method for discovering a segmental discourse structure of a document while categorizing segment function. We demonstrate how retrieval of noun phrases and pronominal forms, along with a zero-sum weighting scheme, determines topicalized segmentation. Futhermore, we use term distribution to aid in identifying the role that the segment performs in the document. Finally, we present results of evaluation in terms of precision and recall which surpass earlier approaches.", "authors": "Min-Yen Kan, Judith L. Klavans, Kathleen R. McKeown", "num_authors": 3, "published_date": "1998-09-15", "days_since_pub": 9720, "updated_date": "1998-09-15", "days_since_update": 9720, "primary_category": "cs.CL", "categories": "cs.CL, I.2.7", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809020v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 8.0, "title_avg_sent_len": 5.0, "title_sentiment": "Positive", "abstract_word_count": 68, "abstract_word_diversity": 0.7941176470588235, "abstract_avg_word_len": 5.926470588235294, "abstract_avg_sent_len": 19.75, "abstract_readability": 28.03, "abstract_sentiment": "Neutral"}
{"id": "cs/9809022v1", "title": "Modelling Users, Intentions, and Structure in Spoken Dialog", "abstract": "We outline how utterances in dialogs can be interpreted using a partial first order logic. We exploit the capability of this logic to talk about the truth status of formulae to define a notion of coherence between utterances and explain how this coherence relation can serve for the construction of AND/OR trees that represent the segmentation of the dialog. In a BDI model we formalize basic assumptions about dialog and cooperative behaviour of participants. These assumptions provide a basis for inferring speech acts from coherence relations between utterances and attitudes of dialog participants. Speech acts prove to be useful for determining dialog segments defined on the notion of completing expectations of dialog participants. Finally, we sketch how explicit segmentation signalled by cue phrases and performatives is covered by our dialog model.", "authors": "Bernd Ludwig, Guenther Goerz, Heinrich Niemann", "num_authors": 3, "published_date": "1998-09-17", "days_since_pub": 9718, "updated_date": "1998-09-17", "days_since_update": 9718, "primary_category": "cs.CL", "categories": "cs.CL, H.5.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809022v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 6.25, "title_avg_sent_len": 10.0, "title_sentiment": "Neutral", "abstract_word_count": 128, "abstract_word_diversity": 0.6015625, "abstract_avg_word_len": 5.59375, "abstract_avg_sent_len": 23.0, "abstract_readability": 23.97, "abstract_sentiment": "Positive"}
{"id": "cs/9809024v2", "title": "A Lexicalized Tree Adjoining Grammar for English", "abstract": "This document describes a sizable grammar of English written in the TAG formalism and implemented for use with the XTAG system. This report and the grammar described herein supersedes the TAG grammar described in an earlier 1995 XTAG technical report. The English grammar described in this report is based on the TAG formalism which has been extended to include lexicalization, and unification-based feature structures. The range of syntactic phenomena that can be handled is large and includes auxiliaries (including inversion), copula, raising and small clause constructions, topicalization, relative clauses, infinitives, gerunds, passives, adjuncts, it-clefts, wh-clefts, PRO constructions, noun-noun modifications, extraposition, determiner sequences, genitives, negation, noun-verb contractions, sentential adjuncts and imperatives. This technical report corresponds to the XTAG Release 8/31/98. The XTAG grammar is continuously updated with the addition of new analyses and modification of old ones, and an online version of this report can be found at the XTAG web page at http://www.cis.upenn.edu/~xtag/", "authors": "XTAG Research Group", "num_authors": 1, "published_date": "1998-09-18", "days_since_pub": 9717, "updated_date": "1998-09-18", "days_since_update": 9717, "primary_category": "cs.CL", "categories": "cs.CL, I.2.7; D.3.1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809024v2", "title_word_count": 6, "title_word_diversity": 1.0, "title_avg_word_len": 6.833333333333333, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 160, "abstract_word_diversity": 0.61875, "abstract_avg_word_len": 5.66875, "abstract_avg_sent_len": 30.333333333333332, "abstract_readability": 20.21, "abstract_sentiment": "Neutral"}
{"id": "cs/9809026v1", "title": "Prefix Probabilities from Stochastic Tree Adjoining Grammars", "abstract": "Language models for speech recognition typically use a probability model of the form Pr(a_n | a_1, a_2, ..., a_{n-1}). Stochastic grammars, on the other hand, are typically used to assign structure to utterances. A language model of the above form is constructed from such grammars by computing the prefix probability Sum_{w in Sigma*} Pr(a_1 ... a_n w), where w represents all possible terminations of the prefix a_1 ... a_n. The main result in this paper is an algorithm to compute such prefix probabilities given a stochastic Tree Adjoining Grammar (TAG). The algorithm achieves the required computation in O(n^6) time. The probability of subderivations that do not derive any words in the prefix, but contribute structurally to its derivation, are precomputed to achieve termination. This algorithm enables existing corpus-based estimation techniques for stochastic TAGs to be used for language modelling.", "authors": "Mark-Jan Nederhof, Anoop Sarkar, Giorgio Satta", "num_authors": 3, "published_date": "1998-09-18", "days_since_pub": 9717, "updated_date": "1998-09-18", "days_since_update": 9717, "primary_category": "cs.CL", "categories": "cs.CL, I.2.7; D.3.1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809026v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.714285714285714, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 123, "abstract_word_diversity": 0.6504065040650406, "abstract_avg_word_len": 5.626016260162602, "abstract_avg_sent_len": 24.571428571428573, "abstract_readability": 28.94, "abstract_sentiment": "Positive"}
{"id": "cs/9809027v1", "title": "Conditions on Consistency of Probabilistic Tree Adjoining Grammars", "abstract": "Much of the power of probabilistic methods in modelling language comes from their ability to compare several derivations for the same string in the language. An important starting point for the study of such cross-derivational properties is the notion of _consistency_. The probability model defined by a probabilistic grammar is said to be _consistent_ if the probabilities assigned to all the strings in the language sum to one. From the literature on probabilistic context-free grammars (CFGs), we know precisely the conditions which ensure that consistency is true for a given CFG. This paper derives the conditions under which a given probabilistic Tree Adjoining Grammar (TAG) can be shown to be consistent. It gives a simple algorithm for checking consistency and gives the formal justification for its correctness. The conditions derived here can be used to ensure that probability models that use TAGs can be checked for _deficiency_ (i.e. whether any probability mass is assigned to strings that cannot be generated).", "authors": "Anoop Sarkar", "num_authors": 1, "published_date": "1998-09-18", "days_since_pub": 9717, "updated_date": "1998-09-18", "days_since_update": 9717, "primary_category": "cs.CL", "categories": "cs.CL, I.2.7; D.3.1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809027v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.375, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 154, "abstract_word_diversity": 0.6103896103896104, "abstract_avg_word_len": 5.240259740259741, "abstract_avg_sent_len": 22.0, "abstract_readability": 34.26, "abstract_sentiment": "Optimistic"}
{"id": "cs/9809028v1", "title": "Separating Dependency from Constituency in a Tree Rewriting System", "abstract": "In this paper we present a new tree-rewriting formalism called Link-Sharing Tree Adjoining Grammar (LSTAG) which is a variant of synchronous TAGs. Using LSTAG we define an approach towards coordination where linguistic dependency is distinguished from the notion of constituency. Such an approach towards coordination that explicitly distinguishes dependencies from constituency gives a better formal understanding of its representation when compared to previous approaches that use tree-rewriting systems which conflate the two issues.", "authors": "Anoop Sarkar", "num_authors": 1, "published_date": "1998-09-18", "days_since_pub": 9717, "updated_date": "1998-09-18", "days_since_update": 9717, "primary_category": "cs.CL", "categories": "cs.CL, I.2.7; D.3.1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809028v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.125, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 73, "abstract_word_diversity": 0.7671232876712328, "abstract_avg_word_len": 6.205479452054795, "abstract_avg_sent_len": 26.0, "abstract_readability": 12.97, "abstract_sentiment": "Positive"}
{"id": "cs/9809029v1", "title": "Incremental Parser Generation for Tree Adjoining Grammars", "abstract": "This paper describes the incremental generation of parse tables for the LR-type parsing of Tree Adjoining Languages (TALs). The algorithm presented handles modifications to the input grammar by updating the parser generated so far. In this paper, a lazy generation of LR-type parsers for TALs is defined in which parse tables are created by need while parsing. We then describe an incremental parser generator for TALs which responds to modification of the input grammar by updating parse tables built so far.", "authors": "Anoop Sarkar", "num_authors": 1, "published_date": "1998-09-18", "days_since_pub": 9717, "updated_date": "1998-09-18", "days_since_update": 9717, "primary_category": "cs.CL", "categories": "cs.CL, I.2.7; D.3.1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809029v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 7.285714285714286, "title_avg_sent_len": 7.0, "title_sentiment": "Neutral", "abstract_word_count": 82, "abstract_word_diversity": 0.5853658536585366, "abstract_avg_word_len": 5.109756097560975, "abstract_avg_sent_len": 22.0, "abstract_readability": 33.95, "abstract_sentiment": "Neutral"}
{"id": "cs/9809050v1", "title": "A Freely Available Morphological Analyzer, Disambiguator and Context Sensitive Lemmatizer for German", "abstract": "In this paper we present Morphy, an integrated tool for German morphology, part-of-speech tagging and context-sensitive lemmatization. Its large lexicon of more than 320,000 word forms plus its ability to process German compound nouns guarantee a wide morphological coverage. Syntactic ambiguities can be resolved with a standard statistical part-of-speech tagger. By using the output of the tagger, the lemmatizer can determine the correct root even for ambiguous word forms. The complete package is freely available and can be downloaded from the World Wide Web.", "authors": "Wolfgang Lezius, Reinhard Rapp, Manfred Wettler", "num_authors": 3, "published_date": "1998-09-23", "days_since_pub": 9712, "updated_date": "1998-09-23", "days_since_update": 9712, "primary_category": "cs.CL", "categories": "cs.CL, H.3.4", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809050v1", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 7.909090909090909, "title_avg_sent_len": 13.0, "title_sentiment": "Positive", "abstract_word_count": 86, "abstract_word_diversity": 0.7558139534883721, "abstract_avg_word_len": 5.337209302325581, "abstract_avg_sent_len": 18.4, "abstract_readability": 37.5, "abstract_sentiment": "Optimistic"}
{"id": "cs/9809106v1", "title": "Processing Unknown Words in HPSG", "abstract": "The lexical acquisition system presented in this paper incrementally updates linguistic properties of unknown words inferred from their surrounding context by parsing sentences with an HPSG grammar for German. We employ a gradual, information-based concept of ``unknownness'' providing a uniform treatment for the range of completely known to maximally unknown lexical entries. ``Unknown'' information is viewed as revisable information, which is either generalizable or specializable. Updating takes place after parsing, which only requires a modified lexical lookup. Revisable pieces of information are identified by grammar-specified declarations which provide access paths into the parse feature structure. The updating mechanism revises the corresponding places in the lexical feature structures iff the context actually provides new information. For revising generalizable information, type union is required. A worked-out example demonstrates the inferential capacity of our implemented system.", "authors": "Petra Barg, Markus Walther", "num_authors": 2, "published_date": "1998-09-25", "days_since_pub": 9710, "updated_date": "1998-09-25", "days_since_update": 9710, "primary_category": "cs.CL", "categories": "cs.CL, I.2.7", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809106v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 5.6, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 132, "abstract_word_diversity": 0.7196969696969697, "abstract_avg_word_len": 6.378787878787879, "abstract_avg_sent_len": 18.625, "abstract_readability": 3.87, "abstract_sentiment": "Neutral"}
{"id": "cs/9809107v1", "title": "Computing Declarative Prosodic Morphology", "abstract": "This paper describes a computational, declarative approach to prosodic morphology that uses inviolable constraints to denote small finite candidate sets which are filtered by a restrictive incremental optimization mechanism. The new approach is illustrated with an implemented fragment of Modern Hebrew verbs couched in MicroCUF, an expressive constraint logic formalism. For generation and parsing of word forms, I propose a novel off-line technique to eliminate run-time optimization. It produces a finite-state oracle that efficiently restricts the constraint interpreter's search space. As a byproduct, unknown words can be analyzed without special mechanisms. Unlike pure finite-state transducer approaches, this hybrid setup allows for more expressivity in constraints to specify e.g. token identity for reduplication or arithmetic constraints for phonetics.", "authors": "Markus Walther", "num_authors": 1, "published_date": "1998-09-25", "days_since_pub": 9710, "updated_date": "1998-09-25", "days_since_update": 9710, "primary_category": "cs.CL", "categories": "cs.CL, I.2.7", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809107v1", "title_word_count": 4, "title_word_diversity": 1.0, "title_avg_word_len": 9.5, "title_avg_sent_len": 4.0, "title_sentiment": "Neutral", "abstract_word_count": 114, "abstract_word_diversity": 0.8245614035087719, "abstract_avg_word_len": 6.324561403508772, "abstract_avg_sent_len": 18.571428571428573, "abstract_readability": 12.22, "abstract_sentiment": "Optimistic"}
{"id": "cs/9811026v2", "title": "Designing an interface to optimize reading with small display windows", "abstract": "The electronic presentation of text in small display windows is mushrooming. In the present paper, four ways of presenting text in a small display window were examined and compared to a Normal Page condition: rapid serial visual presentation (RSVP), RSVP with a Completion Meter, Sentence-by-Sentence presentation, and Sentence-by-Sentence presentation with a Completion Meter. Dependent measures were reading efficiency - speed and comprehension - and preference. For designers of hardware or software with small display windows, the results suggest the following: (1) Though RSVP is disliked by readers, the present methods of allowing self-pacing and regressions in RSVP, unlike earlier tested methods, are efficient and feasible. (2) Slower reading in RSVP should be achieved by increasing pauses between sentences or by repeating sentences, not by decreasing the within-sentence rate. (3) Completion meters do not interfere with performance, and are usually preferred. (4) The space-saving Sentence-by-Sentence format is as efficient and as preferred as the Normal Page format.", "authors": "Tarjin Rahman, Paul Muter", "num_authors": 2, "published_date": "1998-11-16", "days_since_pub": 9658, "updated_date": "1999-09-08", "days_since_update": 9362, "primary_category": "cs.HC", "categories": "cs.HC, H.1.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9811026v2", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 6.0, "title_avg_sent_len": 10.0, "title_sentiment": "Positive", "abstract_word_count": 155, "abstract_word_diversity": 0.5548387096774193, "abstract_avg_word_len": 5.670967741935484, "abstract_avg_sent_len": 26.428571428571427, "abstract_readability": 15.31, "abstract_sentiment": "Optimistic"}
{"id": "cs/9812023v1", "title": "Virtual Kathakali : Gesture Driven Metamorphosis", "abstract": "Training in motor skills such as athletics, dance, or gymnastics is not possible today except in the direct presence of the coach/instructor. This paper describes a computer vision based gesture recognition system which is used to metamorphose the user into a Virtual person, e.g. as a Kathakali dancer, which is graphically recreated at a near or diatant location. Thus this can be seen by an off-site coach using low-bandwidth joint-motion data which permits real time animation. The metamorphosis involves altering the appearance and identity of the user and also creating a specific environment possibly in interaction with other virtual creatures.   A robust vision module is used to identify the user, based on very simple binary image processing in real time which also manages to resolve self-occlusion, correct for clothing/colour and other variations among users. Gestures are identified by locating key points at the shoulder, elbow and wrist joint, which are then recreated in an articulated humanoid model, which in this instance, representes a Kathakali dancer in elaborate traditional dress. Unlike glove based or other and movement tracking systems, this application requires the user to wear no hardwire devices and is aimed at making gesture tracking simpler, cheaper, and more user friendly.", "authors": "Soumyadeep Paul, Sudipta N. Sinha, Amitabha Mukerjee", "num_authors": 3, "published_date": "1998-12-29", "days_since_pub": 9615, "updated_date": "1998-12-29", "days_since_update": 9615, "primary_category": "cs.HC", "categories": "cs.HC, K.3.1; I.3.7; H.5.2; H.5.1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9812023v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 8.4, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 199, "abstract_word_diversity": 0.6733668341708543, "abstract_avg_word_len": 5.381909547738694, "abstract_avg_sent_len": 27.75, "abstract_readability": 29.08, "abstract_sentiment": "Optimistic"}
{"id": "cs/9903019v2", "title": "Workflow Automation with Lotus Notes for the Governmental Administrative Information System", "abstract": "The paper presents an introductory overview of the workflow automation area, outlining the main types, basic technologies, the essential features of workflow applications. Two sorts of process models for the definition of workflows (according to the conversation-based and activity-based methodologies) are sketched. Later on, the nature of Lotus Notes and its capabilities (as an environment for workflow management systems development) are indicated. Concluding, the experience of automating administrative workflows (developing a Subsystem of Inter-institutional Document Management of the VADIS project) is briefly outlined.", "authors": "Saulius Maskeliunas", "num_authors": 1, "published_date": "1999-03-30", "days_since_pub": 9524, "updated_date": "1999-03-31", "days_since_update": 9523, "primary_category": "cs.HC", "categories": "cs.HC, H.4.1; H.5.3; J.1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9903019v2", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 7.363636363636363, "title_avg_sent_len": 11.0, "title_sentiment": "Neutral", "abstract_word_count": 85, "abstract_word_diversity": 0.7176470588235294, "abstract_avg_word_len": 6.2, "abstract_avg_sent_len": 24.5, "abstract_readability": -0.41, "abstract_sentiment": "Neutral"}
{"id": "cs/0101029v1", "title": "Tap Tips: Lightweight Discovery of Touchscreen Targets", "abstract": "We describe tap tips, a technique for providing touch-screen target location hints. Tap tips are lightweight in that they are non-modal, appear only when needed, require a minimal number of user gestures, and do not add to the standard touchscreen gesture vocabulary. We discuss our implementation of tap tips in an electronic guidebook system and some usability test results.", "authors": "Paul M. Aoki, Amy Hurst, Allison Woodruff", "num_authors": 3, "published_date": "2001-01-26", "days_since_pub": 8856, "updated_date": "2001-01-26", "days_since_update": 8856, "primary_category": "cs.HC", "categories": "cs.HC, H.5.2; H.5.4; I.3.6", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0101029v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 6.714285714285714, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 59, "abstract_word_diversity": 0.847457627118644, "abstract_avg_word_len": 5.203389830508475, "abstract_avg_sent_len": 22.0, "abstract_readability": 43.02, "abstract_sentiment": "Neutral"}
{"id": "cs/0101035v2", "title": "The Guidebook, the Friend, and the Room: Visitor Experience in a Historic House", "abstract": "In this paper, we describe an electronic guidebook prototype and report on a study of its use in a historic house. Supported by mechanisms in the guidebook, visitors constructed experiences that had a high degree of interaction with three entities: the guidebook, their companions, and the house and its contents. For example, we found that most visitors played audio descriptions played through speakers (rather than using headphones or reading textual descriptions) to facilitate communication with their companions.", "authors": "Allison Woodruff, Paul M. Aoki, Amy Hurst, Margaret H. Szymanski", "num_authors": 4, "published_date": "2001-01-28", "days_since_pub": 8854, "updated_date": "2001-02-02", "days_since_update": 8849, "primary_category": "cs.HC", "categories": "cs.HC, H.5.1; H.5.2; J.5", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0101035v2", "title_word_count": 12, "title_word_diversity": 0.8333333333333334, "title_avg_word_len": 5.25, "title_avg_sent_len": 16.0, "title_sentiment": "Positive", "abstract_word_count": 74, "abstract_word_diversity": 0.7432432432432432, "abstract_avg_word_len": 5.783783783783784, "abstract_avg_sent_len": 29.333333333333332, "abstract_readability": 28.47, "abstract_sentiment": "Optimistic"}
{"id": "cs/0110006v1", "title": "Electronic Commerce, Consumer Search and Retailing Cost Reduction", "abstract": "This paper explains four things in a unified way. First, how e-commerce can generate price equilibria where physical shops either compete with virtual shops for consumers with Internet access, or alternatively, sell only to consumers with no Internet access. Second, how these price equilibria might involve price dispersion on-line. Third, why prices may be higher on-line. Fourth, why established firms can, but need not, be more reluctant than newly created firm to adopt e-commerce. For this purpose we develop a model where e-commerce reduces consumers' search costs, involves trade-offs for consumers, and reduces retailing costs.", "authors": "Pedro Pereira, Cristina Mazón", "num_authors": 2, "published_date": "2001-10-02", "days_since_pub": 8607, "updated_date": "2001-10-02", "days_since_update": 8607, "primary_category": "cs.HC", "categories": "cs.HC, K.4.m Miscellaneous", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0110006v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.125, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 96, "abstract_word_diversity": 0.7291666666666666, "abstract_avg_word_len": 5.354166666666667, "abstract_avg_sent_len": 18.666666666666668, "abstract_readability": 46.98, "abstract_sentiment": "Optimistic"}
{"id": "cs/0111024v1", "title": "Building Multi-Platform User Interfaces with UIML", "abstract": "There has been a widespread emergence of computing devices in the past few years that go beyond the capabilities of traditional desktop computers. However, users want to use the same kinds of applications and access the same data and information on these appliances that they can access on their desktop computers. The user interfaces for these platforms go beyond the traditional interaction metaphors. It is a challenge to build User Interfaces (UIs) for these devices of differing capabilities that allow the end users to perform the same kinds of tasks. The User Interface Markup Language (UIML) is an XML-based language that allows the canonical description of UIs for different platforms. We describe the language features of UIML that facilitate the development of multi-platform UIs. We also describe the key aspects of our approach that makes UIML succeed where previous approaches failed, namely the division in the representation of a UI, the use of a generic vocabulary, and an integrated development environment specifically designed for transformation-based UI development. Finally we describe the initial details of a multi-step usability engineering process for building multi-platform UI using UIML.", "authors": "Mir Farooq Ali, Manuel A. Perez-Quinones, Eric Shell, Marc Abrams", "num_authors": 4, "published_date": "2001-11-09", "days_since_pub": 8569, "updated_date": "2001-11-09", "days_since_update": 8569, "primary_category": "cs.HC", "categories": "cs.HC, H.5.2;H.5.4;I.3.6;D.2.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0111024v1", "title_word_count": 7, "title_word_diversity": 1.0, "title_avg_word_len": 6.142857142857143, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 185, "abstract_word_diversity": 0.5567567567567567, "abstract_avg_word_len": 5.437837837837838, "abstract_avg_sent_len": 25.125, "abstract_readability": 22.65, "abstract_sentiment": "Positive"}
{"id": "cs/0111025v1", "title": "A Multi-Step Process for Generating Multi-Platform User Interfaces using UIML", "abstract": "There has been a widespread emergence of computing devices in the past few years that go beyond the capabilities of traditional desktop computers. These devices have varying input/output characteristics, modalities and interaction mechanisms. However, users want to use the same kinds of applications and access the same data and information on these appliances that they can access on their desktop computers. The user interfaces for these devices and platforms go beyond the traditional interaction metaphors. It is a challenge to build User Interfaces (UIs) for these devices of differing capabilities that allow the end users to perform the same kinds of tasks. The User Interface Markup Language (UIML) is an XML-based language that allows the canonical description of UIs for different platforms. We present a multi-step transformation-based framework for building Multi-Platform User Interfaces using UIML. We describe the language features of UIML that facilitate the development of multi-platform UIs, the multi-step process involved in our framework and the transformations needed to build the UIs.", "authors": "Mir Farooq Ali, Manuel A. Perez-Quinones, Marc Abrams", "num_authors": 3, "published_date": "2001-11-09", "days_since_pub": 8569, "updated_date": "2001-11-09", "days_since_update": 8569, "primary_category": "cs.HC", "categories": "cs.HC, H.5.2;H.5.4;I.3.6;D.2.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0111025v1", "title_word_count": 11, "title_word_diversity": 0.9090909090909091, "title_avg_word_len": 5.909090909090909, "title_avg_sent_len": 10.0, "title_sentiment": "Neutral", "abstract_word_count": 168, "abstract_word_diversity": 0.5357142857142857, "abstract_avg_word_len": 5.476190476190476, "abstract_avg_sent_len": 22.375, "abstract_readability": 25.29, "abstract_sentiment": "Positive"}
{"id": "cs/0205054v1", "title": "Eavesdropping on Electronic Guidebooks: Observing Learning Resources in Shared Listening Environments", "abstract": "We describe an electronic guidebook, Sotto Voce, that enables visitors to share audio information by eavesdropping on each other's guidebook activity. We have conducted three studies of visitors using electronic guidebooks in a historic house: one study with open air audio played through speakers and two studies with eavesdropped audio. An analysis of visitor interaction in these studies suggests that eavesdropped audio provides more social and interactive learning resources than open air audio played through speakers.", "authors": "Allison Woodruff, Paul M. Aoki, Rebecca E. Grinter, Amy Hurst, Margaret H. Szymanski, James D. Thornton", "num_authors": 6, "published_date": "2002-05-21", "days_since_pub": 8376, "updated_date": "2002-05-21", "days_since_update": 8376, "primary_category": "cs.HC", "categories": "cs.HC, H.5.1; H.5.2; H.5.3; H.5.5; J.5; K.3.1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0205054v1", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 8.181818181818182, "title_avg_sent_len": 12.0, "title_sentiment": "Positive", "abstract_word_count": 75, "abstract_word_diversity": 0.7066666666666667, "abstract_avg_word_len": 5.866666666666666, "abstract_avg_sent_len": 27.666666666666668, "abstract_readability": 20.42, "abstract_sentiment": "Optimistic"}
{"id": "cs/0205055v1", "title": "Practical Strategies for Integrating a Conversation Analyst in an Iterative Design Process", "abstract": "We present a case study of an iterative design process that includes a conversation analyst. We discuss potential benefits of conversation analysis for design, and we describe our strategies for integrating the conversation analyst in the design process. Since the analyst on our team had no previous exposure to design or engineering, and none of the other members of our team had any experience with conversation analysis, we needed to build a foundation for our interaction. One of our key strategies was to pair the conversation analyst with a designer in a highly interactive collaboration. Our tactics have been effective on our project, leading to valuable results that we believe we could not have obtained using another method. We hope that this paper can serve as a practical guide to those interested in establishing a productive and efficient working relationship between a conversation analyst and the other members of a design team.", "authors": "Allison Woodruff, Margaret H. Szymanski, Rebecca E. Grinter, Paul M. Aoki", "num_authors": 4, "published_date": "2002-05-21", "days_since_pub": 8376, "updated_date": "2002-05-21", "days_since_update": 8376, "primary_category": "cs.HC", "categories": "cs.HC, H.5.2; H.5.3", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0205055v1", "title_word_count": 11, "title_word_diversity": 1.0, "title_avg_word_len": 7.090909090909091, "title_avg_sent_len": 12.0, "title_sentiment": "Neutral", "abstract_word_count": 143, "abstract_word_diversity": 0.5874125874125874, "abstract_avg_word_len": 5.426573426573427, "abstract_avg_sent_len": 27.0, "abstract_readability": 28.88, "abstract_sentiment": "Optimistic"}
{"id": "cs/9810003v1", "title": "A Linear Shift Invariant Multiscale Transform", "abstract": "This paper presents a multiscale decomposition algorithm. Unlike standard wavelet transforms, the proposed operator is both linear and shift invariant. The central idea is to obtain shift invariance by averaging the aligned wavelet transform projections over all circular shifts of the signal. It is shown how the same transform can be obtained by a linear filter bank.", "authors": "Andreas Siebert", "num_authors": 1, "published_date": "1998-10-02", "days_since_pub": 9703, "updated_date": "1998-10-02", "days_since_update": 9703, "primary_category": "cs.CV", "categories": "cs.CV, I.4.3", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9810003v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 7.8, "title_avg_sent_len": 6.0, "title_sentiment": "Neutral", "abstract_word_count": 55, "abstract_word_diversity": 0.8, "abstract_avg_word_len": 5.5636363636363635, "abstract_avg_sent_len": 15.5, "abstract_readability": 40.04, "abstract_sentiment": "Neutral"}
{"id": "cs/9810017v1", "title": "General Theory of Image Normalization", "abstract": "We give a systematic, abstract formulation of the image normalization method as applied to a general group of image transformations, and then illustrate the abstract analysis by applying it to the hierarchy of viewing transformations of a planar object.", "authors": "Stephen L. Adler", "num_authors": 1, "published_date": "1998-10-19", "days_since_pub": 9686, "updated_date": "1998-10-19", "days_since_update": 9686, "primary_category": "cs.CV", "categories": "cs.CV, I.2.10, I.4.7, I.4.8", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9810017v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 6.6, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 36, "abstract_word_diversity": 0.75, "abstract_avg_word_len": 5.805555555555555, "abstract_avg_sent_len": 42.0, "abstract_readability": 6.51, "abstract_sentiment": "Neutral"}
{"id": "cs/9908017v1", "title": "A Differential Invariant for Zooming", "abstract": "This paper presents an invariant under scaling and linear brightness change. The invariant is based on differentials and therefore is a local feature. Rotationally invariant 2-d differential Gaussian operators up to third order are proposed for the implementation of the invariant. The performance is analyzed by simulating a camera zoom-out.", "authors": "Andreas Siebert", "num_authors": 1, "published_date": "1999-08-26", "days_since_pub": 9375, "updated_date": "1999-08-26", "days_since_update": 9375, "primary_category": "cs.CV", "categories": "cs.CV, I.4.7", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9908017v1", "title_word_count": 4, "title_word_diversity": 1.0, "title_avg_word_len": 7.75, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 48, "abstract_word_diversity": 0.8125, "abstract_avg_word_len": 5.895833333333333, "abstract_avg_sent_len": 13.5, "abstract_readability": 24.95, "abstract_sentiment": "Positive"}
{"id": "cs/0001024v1", "title": "A Parallel Algorithm for Dilated Contour Extraction from Bilevel Images", "abstract": "We describe a simple, but efficient algorithm for the generation of dilated contours from bilevel images. The initial part of the contour extraction is explained to be a good candidate for parallel computer code generation. The remainder of the algorithm is of linear nature.", "authors": "B. R. Schlei, L. Prasad", "num_authors": 2, "published_date": "2000-01-25", "days_since_pub": 9223, "updated_date": "2000-01-25", "days_since_update": 9223, "primary_category": "cs.CV", "categories": "cs.CV, I.2.10, D.1.3, G.1.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0001024v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 6.777777777777778, "title_avg_sent_len": 10.0, "title_sentiment": "Neutral", "abstract_word_count": 42, "abstract_word_diversity": 0.7380952380952381, "abstract_avg_word_len": 5.380952380952381, "abstract_avg_sent_len": 16.0, "abstract_readability": 31.17, "abstract_sentiment": "Optimistic"}
{"id": "cs/0003065v1", "title": "Image Compression with Iterated Function Systems, Finite Automata and Zerotrees: Grand Unification", "abstract": "Fractal image compression, Culik's image compression and zerotree prediction coding of wavelet image decomposition coefficients succeed only because typical images being compressed possess a significant degree of self-similarity. Besides the common concept, these methods turn out to be even more tightly related, to the point of algorithmical reducibility of one technique to another. The goal of the present paper is to demonstrate these relations.   The paper offers a plain-term interpretation of Culik's image compression, in regular image processing terms, without resorting to finite state machines and similar lofty language. The interpretation is shown to be algorithmically related to an IFS fractal image compression method: an IFS can be exactly transformed into Culik's image code. Using this transformation, we will prove that in a self-similar (part of an) image any zero wavelet coefficient is the root of a zerotree, or its branch.   The paper discusses the zerotree coding of (wavelet/projection) coefficients as a common predictor/corrector, applied vertically through different layers of a multiresolutional decomposition, rather than within the same view. This interpretation leads to an insight into the evolution of image compression techniques: from a causal single-layer prediction, to non-causal same-view predictions (wavelet decomposition among others) and to a causal cross-layer prediction (zero-trees, Culik's method).", "authors": "Oleg Kiselyov, Paul Fisher", "num_authors": 2, "published_date": "2000-03-15", "days_since_pub": 9173, "updated_date": "2000-03-15", "days_since_update": 9173, "primary_category": "cs.CV", "categories": "cs.CV, I.4.2; I.4.10; G.1.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0003065v1", "title_word_count": 12, "title_word_diversity": 1.0, "title_avg_word_len": 7.083333333333333, "title_avg_sent_len": 14.0, "title_sentiment": "Positive", "abstract_word_count": 206, "abstract_word_diversity": 0.587378640776699, "abstract_avg_word_len": 5.762135922330097, "abstract_avg_sent_len": 29.625, "abstract_readability": 11.75, "abstract_sentiment": "Optimistic"}
{"id": "cs/0003079v1", "title": "Differential Invariants under Gamma Correction", "abstract": "This paper presents invariants under gamma correction and similarity transformations. The invariants are local features based on differentials which are implemented using derivatives of the Gaussian. The use of the proposed invariant representation is shown to yield improved correlation results in a template matching scenario.", "authors": "Andreas Siebert", "num_authors": 1, "published_date": "2000-03-26", "days_since_pub": 9162, "updated_date": "2000-03-26", "days_since_update": 9162, "primary_category": "cs.CV", "categories": "cs.CV, I.4.7", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0003079v1", "title_word_count": 5, "title_word_diversity": 1.0, "title_avg_word_len": 8.4, "title_avg_sent_len": 5.0, "title_sentiment": "Neutral", "abstract_word_count": 44, "abstract_word_diversity": 0.8636363636363636, "abstract_avg_word_len": 6.363636363636363, "abstract_avg_sent_len": 16.0, "abstract_readability": 13.95, "abstract_sentiment": "Positive"}
{"id": "cs/0004012v1", "title": "Assisted Video Sequences Indexing : Motion Analysis Based on Interest Points", "abstract": "This work deals with content-based video indexing. Our viewpoint is semi-automatic analysis of compressed video. We consider the possible applications of motion analysis and moving object detection : assisting moving object indexing, summarising videos, and allowing image and motion queries. We propose an approach based on interest points. As first results, we test and compare the stability of different types of interest point detectors in compressed sequences.", "authors": "Emmanuel Etievent, Frank Lebourgeois, Jean-Michel Jolion", "num_authors": 3, "published_date": "2000-04-21", "days_since_pub": 9136, "updated_date": "2000-04-21", "days_since_update": 9136, "primary_category": "cs.CV", "categories": "cs.CV, I.4.8; I.4.9", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0004012v1", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 6.5, "title_avg_sent_len": 11.0, "title_sentiment": "Positive", "abstract_word_count": 68, "abstract_word_diversity": 0.7352941176470589, "abstract_avg_word_len": 5.705882352941177, "abstract_avg_sent_len": 15.0, "abstract_readability": 24.24, "abstract_sentiment": "Optimistic"}
{"id": "cs/0005001v1", "title": "Robustness of Regional Matching Scheme over Global Matching Scheme", "abstract": "The paper has established and verified the theory prevailing widely among image and pattern recognition specialists that the bottom-up indirect regional matching process is the more stable and the more robust than the global matching process against concentrated types of noise represented by clutter, outlier or occlusion in the imagery. We have demonstrated this by analyzing the effect of concentrated noise on a typical decision making process of a simplified two candidate voting model where our theorem establishes the lower bounds to a critical breakdown point of election (or decision) result by the bottom-up matching process are greater than the exact bound of the global matching process implying that the former regional process is capable of accommodating a higher level of noise than the latter global process before the result of decision overturns. We present a convincing experimental verification supporting not only the theory by a white-black flag recognition problem in the presence of localized noise but also the validity of the conjecture by a facial recognition problem that the theorem remains valid for other decision making processes involving an important dimension-reducing transform such as principal component analysis or a Gabor transform.", "authors": "Liang Chen, Naoyuki Tokuda", "num_authors": 2, "published_date": "2000-05-03", "days_since_pub": 9124, "updated_date": "2000-05-03", "days_since_update": 9124, "primary_category": "cs.CV", "categories": "cs.CV, I.2.10; I.5.2; H.1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0005001v1", "title_word_count": 9, "title_word_diversity": 0.7777777777777778, "title_avg_word_len": 6.444444444444445, "title_avg_sent_len": 9.0, "title_sentiment": "Neutral", "abstract_word_count": 188, "abstract_word_diversity": 0.6117021276595744, "abstract_avg_word_len": 5.654255319148936, "abstract_avg_sent_len": 66.0, "abstract_readability": -18.87, "abstract_sentiment": "Positive"}
{"id": "cs/0006001v1", "title": "Boosting the Differences: A fast Bayesian classifier neural network", "abstract": "A Bayesian classifier that up-weights the differences in the attribute values is discussed. Using four popular datasets from the UCI repository, some interesting features of the network are illustrated. The network is suitable for classification problems.", "authors": "Ninan Sajeeth Philip, K. Babu Joseph", "num_authors": 2, "published_date": "2000-05-31", "days_since_pub": 9096, "updated_date": "2000-05-31", "days_since_update": 9096, "primary_category": "cs.CV", "categories": "cs.CV, I1.2;F.1.1;F1.2;C1.3", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0006001v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 7.125, "title_avg_sent_len": 10.0, "title_sentiment": "Positive", "abstract_word_count": 36, "abstract_word_diversity": 0.8333333333333334, "abstract_avg_word_len": 5.944444444444445, "abstract_avg_sent_len": 13.333333333333334, "abstract_readability": 25.46, "abstract_sentiment": "Optimistic"}
{"id": "cs/0006002v1", "title": "Distorted English Alphabet Identification : An application of Difference Boosting Algorithm", "abstract": "The difference-boosting algorithm is used on letters dataset from the UCI repository to classify distorted raster images of English alphabets. In contrast to rather complex networks, the difference-boosting is found to produce comparable or better classification efficiency on this complex problem.", "authors": "Ninan Sajeeth Philip, K. Babu Joseph", "num_authors": 2, "published_date": "2000-05-31", "days_since_pub": 9096, "updated_date": "2000-05-31", "days_since_update": 9096, "primary_category": "cs.CV", "categories": "cs.CV, I1.2;F.1.1;F1.2;C1.3", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0006002v1", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 8.0, "title_avg_sent_len": 11.0, "title_sentiment": "Neutral", "abstract_word_count": 43, "abstract_word_diversity": 0.7906976744186046, "abstract_avg_word_len": 5.883720930232558, "abstract_avg_sent_len": 22.0, "abstract_readability": 8.37, "abstract_sentiment": "Neutral"}
{"id": "cs/9809018v1", "title": "Influencing Software Usage", "abstract": "Technology designers often strive to design systems that are flexible enough to be used in a wide range of situations. Software engineers, in particular, are trained to seek general solutions to problems. General solutions can be used not only to address the problem at hand, but also to address a wide range of problems that the designers may not have even anticipated. Sometimes designers wish to provide general solutions, while encouraging certain uses of their technology and discouraging or precluding others. They may attempt to influence the use of technology by ``hard-wiring'' it so that it only can be used in certain ways, licensing it so that those who use it are legally obligated to use it in certain ways, issuing guidelines for how it should be used, or providing resources that make it easier to use the technology as the designers intended than to use it in any other way.   This paper examines several cases where designers have attempted to influence the use of technology through one of these mechanisms. Such cases include key recovery encryption, Pegasus Mail, Platform for Internet Content Selection (PICS) Guidelines, Java, Platform for Privacy Preferences Project (P3P) Implementation Guide, Apple's style guidelines, and Microsoft Foundation Classes. In some of these cases, the designers sought to influence the use of technology for competitive reasons or in order to promote standardization or interoperability. However, in other cases designers were motivated by policy-related goals such as protecting privacy or free speech. As new technologies are introduced with the express purpose of advancing policy-related goals (for example, PICS and P3P), it is especially important to understand the roles designers might play in influencing the use of technology.", "authors": "Lorrie Faith Cranor, Rebecca N. Wright", "num_authors": 2, "published_date": "1998-09-11", "days_since_pub": 9724, "updated_date": "1998-09-11", "days_since_update": 9724, "primary_category": "cs.CY", "categories": "cs.CY, K.4.0;K.6.3", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9809018v1", "title_word_count": 3, "title_word_diversity": 1.0, "title_avg_word_len": 8.0, "title_avg_sent_len": 3.0, "title_sentiment": "Neutral", "abstract_word_count": 278, "abstract_word_diversity": 0.539568345323741, "abstract_avg_word_len": 5.255395683453237, "abstract_avg_sent_len": 31.5, "abstract_readability": 26.24, "abstract_sentiment": "Optimistic"}
{"id": "cs/9903013v1", "title": "The Impact of Net Culture on Mainstream Societies: a Global Analysis", "abstract": "In this work the impact of the Internet culture on standard mainstream societies has been analyzed. After analytically establishing the fact that the Net can be viewed as a pan-societal superstructure which supports its own distinct culture, an ethnographic analysis is provided to find out the key aspects of this culture. The elements of this culture which have an empowering impacts on the standard mainstream societies, as well as the elements in it which can cause discouraging social effects are then discussed by a global investigation of the present status of various fundamental aspects (e,g, education, economics, politics, entertainment etc) of the mainstream societies as well as their links with the Net culture. Though immensely potential for providing various prominent positive impacts, the key findings of this work indicate that misuse of Internet can create tremendous harm to the members of the mainstream societies by generating a set of morally crippled people as well as a future generation completely void of principles and ethics. This structured diagnostic approach to the social problems caused by the manhandling of Internet leads to a concrete effort of providing the measures that can be taken to enhance or to overcome the supporting and limiting effects of the Net culture respectively with the intent to benefit our society and to protect the teratoidation of certain ethical values.", "authors": "Tapas Kumar Das", "num_authors": 1, "published_date": "1999-03-18", "days_since_pub": 9536, "updated_date": "1999-03-18", "days_since_update": 9536, "primary_category": "cs.CY", "categories": "cs.CY, K.4.0;K.4.1;K.4.2", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9903013v1", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 5.6, "title_avg_sent_len": 12.0, "title_sentiment": "Neutral", "abstract_word_count": 217, "abstract_word_diversity": 0.5668202764976958, "abstract_avg_word_len": 5.400921658986175, "abstract_avg_sent_len": 47.6, "abstract_readability": 9.49, "abstract_sentiment": "Optimistic"}
{"id": "cs/9909008v2", "title": "Not Just a Matter of Time: Field Differences and the Shaping of Electronic Media in Supporting Scientific Communication", "abstract": "The shift towards the use of electronic media in scholarly communication appears to be an inescapable imperative. However, these shifts are uneven, both with respect to field and with respect to the form of communication. Different scientific fields have developed and use distinctly different communicative forums, both in the paper and electronic arenas, and these forums play different communicative roles within the field. One common claim is that we are in the early stages of an electronic revolution, that it is only a matter of time before other fields catch up with the early adopters, and that all fields converge on a stable set of electronic forums. A social shaping of technology (SST) perspective helps us to identify important social forces centered around disciplinary constructions of trust and of legitimate communication that pull against convergence. This analysis concludes that communicative plurality and communicative heterogeneity are durable features of the scholarly landscape, and that we are likely to see field differences in the use of and meaning ascribed to communications forums persist, even as overall use of electronic communications technologies both in science and in society as a whole increases.", "authors": "Rob Kling, Geoffrey McKim", "num_authors": 2, "published_date": "1999-09-07", "days_since_pub": 9363, "updated_date": "2000-04-29", "days_since_update": 9128, "primary_category": "cs.CY", "categories": "cs.CY, I.7.4; J2; J3", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/9909008v2", "title_word_count": 17, "title_word_diversity": 0.9411764705882353, "title_avg_word_len": 5.882352941176471, "title_avg_sent_len": 19.0, "title_sentiment": "Positive", "abstract_word_count": 185, "abstract_word_diversity": 0.5675675675675675, "abstract_avg_word_len": 5.556756756756757, "abstract_avg_sent_len": 34.166666666666664, "abstract_readability": 14.12, "abstract_sentiment": "Optimistic"}
{"id": "cs/0001011v1", "title": "Agents of Choice: Tools that Facilitate Notice and Choice about Web Site Data Practices", "abstract": "A variety of tools have been introduced recently that are designed to help people protect their privacy on the Internet. These tools perform many different functions in-cluding encrypting and/or anonymizing communications, preventing the use of persistent identifiers such as cookies, automatically fetching and analyzing web site privacy policies, and displaying privacy-related information to users. This paper discusses the set of privacy tools that aim specifically at facilitating notice and choice about Web site data practices. While these tools may also have components that perform other functions such as encryption, or they may be able to work in conjunction with other privacy tools, the primary pur-pose of these tools is to help make users aware of web site privacy practices and to make it easier for users to make informed choices about when to provide data to web sites. Examples of such tools include the Platform for Privacy Preferences (P3P) and various infomediary services.", "authors": "Lorrie Faith Cranor", "num_authors": 1, "published_date": "2000-01-14", "days_since_pub": 9234, "updated_date": "2000-01-14", "days_since_update": 9234, "primary_category": "cs.CY", "categories": "cs.CY, K.4.1", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0001011v1", "title_word_count": 14, "title_word_diversity": 0.9285714285714286, "title_avg_word_len": 5.214285714285714, "title_avg_sent_len": 15.0, "title_sentiment": "Neutral", "abstract_word_count": 155, "abstract_word_diversity": 0.6064516129032258, "abstract_avg_word_len": 5.309677419354839, "abstract_avg_sent_len": 33.0, "abstract_readability": 23.5, "abstract_sentiment": "Optimistic"}
{"id": "cs/0005007v1", "title": "Scientific Collaboratories as Socio-Technical Interaction Networks: A Theoretical Approach", "abstract": "Collaboratories refer to laboratories where scientists can work together while they are in distant locations from each other and from key equipment. They have captured the interest both of CSCW researchers and of science funders who wish to optimize the use of rare scientific equipment and expertise. We examine the kind of CSCW conceptions that help us best understand the character of working relationships in these scientific collaboratories. Our model, inspired by actor-network theory, considers technologies as Socio-technical Interaction Networks (STINs). This model provides a rich understanding of the scientific collaboratories, and also a more complete understanding of the conditions and activities that support collaborative work in them. We illustrate the significance of STIN models with several cases drawn from the fields of high energy physics and materials science.", "authors": "Rob Kling, Geoffrey McKim, Joanna Fortuna, Adam King", "num_authors": 4, "published_date": "2000-05-08", "days_since_pub": 9119, "updated_date": "2000-05-08", "days_since_update": 9119, "primary_category": "cs.CY", "categories": "cs.CY, H.5.3", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0005007v1", "title_word_count": 9, "title_word_diversity": 1.0, "title_avg_word_len": 8.777777777777779, "title_avg_sent_len": 10.0, "title_sentiment": "Neutral", "abstract_word_count": 129, "abstract_word_diversity": 0.7054263565891473, "abstract_avg_word_len": 5.751937984496124, "abstract_avg_sent_len": 23.333333333333332, "abstract_readability": 24.27, "abstract_sentiment": "Optimistic"}
{"id": "cs/0108014v1", "title": "What's Fit To Print: The Effect Of Ownership Concentration On Product Variety In Daily Newspaper Markets", "abstract": "This paper examines the effect of ownership concentration on product position, product variety and readership in markets for daily newspapers. US antitrust policy presumes that mergers reduce the amount and diversity of content available to consumers. However, the effects of consolidation in differentiated product markets cannot be determined solely from theory. Because multi-product firms internalize business stealing, mergers may encourage firms to reposition products, leading to more, not less, variety. Using data on reporter assignments from 1993-1999, results show that differentiation and variety increase with concentration. Moreover, there is evidence that additional variety increases readership, suggesting that concentration benefits consumers.", "authors": "Lisa M. George", "num_authors": 1, "published_date": "2001-08-22", "days_since_pub": 8648, "updated_date": "2001-08-22", "days_since_update": 8648, "primary_category": "cs.CY", "categories": "cs.CY, K.4.m Miscellaneous", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0108014v1", "title_word_count": 16, "title_word_diversity": 1.0, "title_avg_word_len": 5.375, "title_avg_sent_len": 18.0, "title_sentiment": "Positive", "abstract_word_count": 100, "abstract_word_diversity": 0.73, "abstract_avg_word_len": 6.37, "abstract_avg_sent_len": 19.333333333333332, "abstract_readability": 3.76, "abstract_sentiment": "Positive"}
{"id": "cs/0108015v1", "title": "Spiders and Crawlers and Bots, Oh My: The Economic Efficiency and Public Policy of Contracts that Restrict Data Collection", "abstract": "Recent trends reveal the search by companies for a legal hook to prevent the undesired and unauthorized copying of information posted on websites. In the center of this controversy are metasites, websites that display prices for a variety of vendors. Metasites function by implementing shopbots, which extract pricing data from other vendors' websites. Technological mechanisms have proved unsuccessful in blocking shopbots, and in response, websites have asserted a variety of legal claims. Two recent cases, which rely on the troublesome trespass to chattels doctrine, suggest that contract law may provide a less demanding legal method of preventing the search of websites by data robots. If blocking collection of pricing data is as simple as posting an online contract, the question arises whether this end result is desirable and legally viable.", "authors": "Jeffrey M. Rosenfeld", "num_authors": 1, "published_date": "2001-08-22", "days_since_pub": 8648, "updated_date": "2001-08-22", "days_since_update": 8648, "primary_category": "cs.CY", "categories": "cs.CY, K.4.m", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0108015v1", "title_word_count": 19, "title_word_diversity": 0.8947368421052632, "title_avg_word_len": 5.368421052631579, "title_avg_sent_len": 21.0, "title_sentiment": "Neutral", "abstract_word_count": 126, "abstract_word_diversity": 0.6587301587301587, "abstract_avg_word_len": 5.587301587301587, "abstract_avg_sent_len": 24.0, "abstract_readability": 32.53, "abstract_sentiment": "Negative"}
{"id": "cs/0109007v2", "title": "Voice vs Data: Estimates of Media Usage and Network Traffic", "abstract": "The popular conception is that data traffic nearly, if not already, exceeds voice traffic on backbone networks. However, the results of research reported in this paper imply that voice traffic greatly exceeds data traffic when real users are asked to estimate their usage of a wide variety of media. Media usage was surveyed for students in New York City and in Los Angeles. Other than significant differences in radio listening, e-mails, and downloads, the usage was quite similar. Telephone usage (wired and wireless) was nearly an hour per day. When converted to bits, the telephone traffic was much greater than the data traffic over the Internet. This paper reports on the details of the two user studies. The traffic implications of the results are estimated. The finding that voice exceeds data will then be reconciled with the popular opposite conception.", "authors": "A. Michael Noll", "num_authors": 1, "published_date": "2001-09-05", "days_since_pub": 8634, "updated_date": "2001-09-26", "days_since_update": 8613, "primary_category": "cs.CY", "categories": "cs.CY, K.4.m Miscellaneous", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0109007v2", "title_word_count": 10, "title_word_diversity": 1.0, "title_avg_word_len": 4.9, "title_avg_sent_len": 11.0, "title_sentiment": "Neutral", "abstract_word_count": 139, "abstract_word_diversity": 0.6115107913669064, "abstract_avg_word_len": 5.057553956834532, "abstract_avg_sent_len": 17.555555555555557, "abstract_readability": 47.18, "abstract_sentiment": "Optimistic"}
{"id": "cs/0109008v1", "title": "The Role of Incentives for Opening Monopoly Markets: Comparing GTE and BOC Cooperation with Local Entrants", "abstract": "While the 1996 Telecommunications Act requires all incumbent local telephone companies to cooperate with local entrants, section 271 of the Act provides the Bell companies (but not GTE) additional incentives to cooperate. Using an original data set, I compare the negotiations of AT&T, as a local entrant, with GTE and with the Bell companies in states where both operate. My results suggest that the differential incentives matter: The Bells accommodate entry more than does GTE, as evidenced in quicker agreements, less litigation, and more favorable prices offered for network access. Consistent with this, there is more entry into Bell territories", "authors": "Federico Mini", "num_authors": 1, "published_date": "2001-09-06", "days_since_pub": 8633, "updated_date": "2001-09-06", "days_since_update": 8633, "primary_category": "cs.CY", "categories": "cs.CY, K.4.m Miscellaneous", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0109008v1", "title_word_count": 16, "title_word_diversity": 1.0, "title_avg_word_len": 5.625, "title_avg_sent_len": 17.0, "title_sentiment": "Positive", "abstract_word_count": 96, "abstract_word_diversity": 0.7083333333333334, "abstract_avg_word_len": 5.489583333333333, "abstract_avg_sent_len": 29.0, "abstract_readability": 29.18, "abstract_sentiment": "Positive"}
{"id": "cs/0109009v1", "title": "The Effect of Native Language on Internet Usage", "abstract": "Our goal is to distinguish between the following two hypotheses: (A) The Internet will remain disproportionately in English and will, over time, cause more people to learn English as second language and thus solidify the role of English as a global language. This outcome will prevail even though there are more native Chinese and Spanish speakers than there are native English speakers. (B) As the Internet matures, it will more accurately reflect the native languages spoken around the world (perhaps weighted by purchasing power) and will not promote English as a global language.   English's \"early lead\" on the web is more likely to persist if those who are not native English speakers frequently access the large number of English language web sites that are currently available. In that case, many existing web sites will have little incentive to develop non-English versions of their sites, and new sites will tend to gravitate towards English. The key empirical question, therefore, is whether individuals whose native language is not English use the Web, or certain types of Web sites, less than do native English speakers. In order to examine this issue empirically, we employ a unique data set on Internet use at the individual level in Canada from Media Metrix. Canada provides an ideal setting to examine this issue because English is one of the two official languages.   Our preliminary results suggest that English web sites are not a barrier to Internet use for French-speaking Quebecois. These preliminary results are consistent with the scenario in which the Internet will promote English as a global language.", "authors": "Neil Gandal, Carl Shapiro", "num_authors": 2, "published_date": "2001-09-06", "days_since_pub": 8633, "updated_date": "2001-09-06", "days_since_update": 8633, "primary_category": "cs.CY", "categories": "cs.CY, K.4.m Miscellaneous", "n_categories": 2, "pdf_url": "http://arxiv.org/pdf/cs/0109009v1", "title_word_count": 8, "title_word_diversity": 1.0, "title_avg_word_len": 5.0, "title_avg_sent_len": 8.0, "title_sentiment": "Neutral", "abstract_word_count": 257, "abstract_word_diversity": 0.5369649805447471, "abstract_avg_word_len": 5.151750972762646, "abstract_avg_sent_len": 29.2, "abstract_readability": 36.42, "abstract_sentiment": "Optimistic"}
